{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re excited to announce the <b>Microsoft 365 Copilot app for MacOS</b>—a streamlined way for Mac users to weave AI into their daily flow to move faster, stay focused, and get more done. Launch the Microsoft 365 Copilot app directly from the Dock on Mac devices to get AI-powered enterprise search, memory in chat, content creation tools, agents, and more.</p><p> \n</p><p><b>When this will happen:</b></p><p>The app will be available for download starting late June 2025.</p><p>\n</p><p><b>How this affects your organization:</b></p><p>Users on MacOS will be able to enjoy:\n</p><ul><li>The full Microsoft 365 Copilot app experience with a native Mac feel\n</li><li>Instant access from their device’s Dock with pinning - no need to navigate through the web browser</li></ul><p>Users must manually download the Microsoft 365 Copilot app for Mac. This app does not replace the <a href=\"https://m365.cloud.microsoft/\" target=\"_blank\">Microsoft 365 Copilot web app</a>, which users can still access via their web browser.&nbsp;</p><p><b>What you need to do to prepare:</b></p><ul><li>Once available, the Microsoft 365 Copilot app for Mac will be available for download on the <a href=\"https://www.microsoft.com/en-gb/microsoft-365/copilot/download-copilot-app\" target=\"_blank\">app webpage</a>. Prepare comms to share with your organization’s Mac users that include a link to the webpage as well as additional information like the <a href=\"https://support.microsoft.com/en-us/topic/welcome-to-the-microsoft-365-copilot-app-092599f1-5917-4bd6-bd59-58af628bbc39\" target=\"_blank\">Microsoft 365 Copilot app support page</a>. </li><li>Update internal documentation or support channels with guidance on how to access the app and pin to Dock for when it becomes available.</li></ul><p><b>Compliance Considerations:</b></p><ul><li>Does the change provide end users any new way of interacting with generative AI? Yes (new native app interface for Copilot)</li></ul><p></p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot app for Mac will be available for download in late June 2025. Mac users can access AI-powered tools directly from the Dock. The app does not replace the web version. Organizations should prepare communications and update documentation for users."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098168",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-18T23:13:23.09Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-18T23:13:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Announcing the Microsoft 365 Copilot app for Mac",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
