{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re excited to announce two major enhancements to sharing files with Copilot Summary:</p><ol><li>Broader file types and endpoint support: Sharing with Copilot summary now supports more file types, including PowerPoint web, Excel web, PDF, images, and text (.txt) files, across OneDrive web, SharePoint Document Library, and M365 File Previewer.\n</li><li>Support for protected files: Files labeled as protected or confidential can now be summarized. This is especially valuable for customers that apply a default sensitive label to all documents, enabling them to use this feature while keeping data protected at all times.</li></ol><p>These enhancements represent a significant step forward in broadening access to capabilities and making sharing more collaborative and impactful in daily collaboration.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=490156\" target=\"_blank\" style=\"\">490156</a><b><br></b></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-May 2025 and expect to complete by mid-June 2025.</p><p><b>How this affects your organization:</b></p><p>When sharing Word, Excel, PowerPoint, PDF, image (.png, .jpeg), or text (.txt) files via the web, users will have the option to generate a file summary by clicking the Copilot button inside the share dialog. The generated summary will be automatically included in the share notification email sent to the intended recipients.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/c192d7aa-79e8-4057-90b1-24ee502e1203/b91044ba2a1738323d6d41e5574e2759239b1f3f.png\" width=\"400\" height=\"\"></p><p><b>What you can do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490156"
    },
    {
      "Name": "Summary",
      "Value": "Sharing with Copilot summary now supports more file types, including PowerPoint, Excel, PDFs, images, and text files, as well as protected files. These enhancements will roll out from mid-May to mid-June 2025. Users can generate file summaries via the Copilot button, included in share notification emails."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1070847",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-09T21:27:20.72Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-09T21:26:35Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Sharing with Copilot summary - Now supporting PowerPoint, Excel, PDFs, Images, .txt, and protected files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
