{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 24, 2025: We have updated the timeline. Thank you for your patience.</p><p>Coming soon to the chat experience in Microsoft 365 Copilot (formerly BizChat): Users will be able to use a <i>File type</i> filter and <i>People </i>refiners&nbsp;in the CIQ menu to apply search criteria and find relevant files more quickly.\n</p><p><a href=\"https://support.microsoft.com/topic/using-context-iq-to-refer-to-specific-files-people-and-more-in-microsoft-365-copilot-272ac2c1-c5f7-49c9-8a42-2a8a87846fa0\" target=\"_blank\" style=\"\">Context IQ (CIQ)</a> is a set of AI capabilities from Microsoft that allows users to search for, select, and insert relevant enterprise or personal data directly into their prompts or conversations. This capability helps users to “ground” or anchor their prompts in specific, contextually relevant data, making responses more accurate, specific, and useful.</p><p>\n\n</p><p></p><p>This message applies to the chat experience in Microsoft 365 Copilot for Windows desktop and Copilot Chat on the web.</p><p>A Microsoft 365 Copilot license is required to use this feature.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481136\" target=\"_blank\">481136</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early August 2025 (previously late June) and expect to complete by mid-August 2025 (previously mid-July).</p><p><b>How this will affect your organization:</b></p><p>\n</p><p><span>Before this rollout, in the chat experience in Microsoft 365 Copilot, users can refine search results by entering text in the search box in&nbsp;the CIQ menu.</span></p><p><span>After this rollout, in the chat experience in Microsoft 365 Copilot, users can enter text in the search box and also use the <i>File type</i> filter and <i>People </i>refiners in the CIQ <span style=\"background-color: rgb(206, 222, 231);\">menu's&nbsp;</span><i>Files</i> tab.</span></p><p>The CIQ menu <i>Files </i>tab before this rollout:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/7eb280a0-0ad5-4daa-b171-e97997915087\" style=\"width: 400px;\" alt=\"admin controls\"></p><p>\n</p><p>The CIQ menu <i>Files </i>tab after this rollout, with the new <i style=\"\">File type</i> filter and <i style=\"\">People </i>refiners:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1570f555-6bf7-457f-a182-dbbe9c668e58\" style=\"width: 400px;\" alt=\"admin controls\">\n<br></p><p>This feature will be on by default.</p><p><b>What you need to do to prepare:</b></p><p></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481136"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot's chat will soon include File type and People filters in the CIQ menu's Files tab for improved search refinement. The rollout starts early August 2025, requires no admin action, and enhances finding relevant files by applying specific search criteria."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1048631",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-24T14:45:03.313Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T23:15:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot: The chat experience will offer better search refinement in the CIQ menu \"Files\" tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
