{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re excited to announce the general availability (GA) of the Researcher agent in the Microsoft 365 Copilot Prompt Box, starting July 18, 2025. This enhancement brings the power of deep research directly into the flow of work, helping users tackle complex, multi-step research tasks more efficiently.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout will begin mid-July 2025 and will be available to all Microsoft 365 Copilot-licensed users.\n</p><p><b>How this affects your organization:</b></p><p>The Researcher agent, previously accessible only via the Left Nav as a standalone experience, will now also appear as a button in the M365 Copilot Prompt Box across Microsoft 365 apps, including Teams, Outlook, and the Copilot Chat experience.</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1ddcc855-7e74-4d82-8866-047012a87ea5\" width=\"400\" height=\"\"></p><p>Key benefits:\n</p><ul><li>Combines OpenAI’s deep research model with Copilot’s orchestration and search capabilities.\n</li><li>Can reason over work and web data, including third-party data via connectors or other agents.\n</li><li>No changes to existing functionality—this is an additional entry point for easier access.\n</li></ul><p>Note: Only users with a Microsoft 365 Copilot license will see the Researcher agent in the Prompt Box.\n</p><p><b>What you can do to prepare:</b></p><p>No admin action is required to enable this feature.\n</p><p>Admins can manage agent availability via the Microsoft 365 admin center. For more information, refer to:\n</p><p><a href=\"https://learn.microsoft.com/en-us/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn.</a>\n</p><p><b>Compliance considerations:</b></p><ul><li>Alters how existing customer data is processed, stored, or accessed: Maybe</li><li>Introduces or modifies AI/ML capabilities that interact with customer data: Yes\n</li><li>Provides new ways for users to interact with generative AI: Yes</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Researcher agent in the Microsoft 365 Copilot Prompt Box will be generally available starting July 18, 2025. It integrates deep research capabilities into Microsoft 365 apps, enhancing efficiency for complex research tasks. No admin action is required, but management is possible via the Microsoft 365 admin center."
    }
  ],
  "EndDateTime": "2025-08-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098163",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-18T23:10:03.673Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-18T23:09:46Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Researcher on M365 Copilot Prompt Box",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
