{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 28, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Out-of-the-box agents are available within Microsoft 365 apps or Copilot Chat, adding specialized skills and knowledge while automating tasks at hand. They handle aspects from simple, mundane tasks to complex, multi-step business processes, working alongside individuals or on behalf of teams. Today, we’re announcing a new agent, Skill Discovery, and updates to agents available in public preview.</p><ul><li><i>Skills:</i> Available in June 2025, the new People Skills data layer will power a new Skills agent. Employees will be able to easily find experts in the organization, understand colleagues’ skills, and make informed decisions about skill development. Leaders will get support on strategic workforce planning decisions with an up-to-date view of talent landscape strengths, gaps, and opportunities.  For additional details on People Skills and Skills agent, please reference <span style=\"background-color: rgb(255, 255, 0);\">MC <b>Placeholder for number &amp; link to People Skills MC post</b>\n</span></li><li><i>Interpreter:</i> The Interpreter agent allows each user to enable real-time speech-to-speech interpretation in multilingual Teams meetings so they can speak and listen in the language of their choice, instantly overcoming language barriers. Interpreter works best in structured conversations where one person speaks at a time for longer periods. Users can opt-in to have Interpreter simulate their voice, helping others identify them more easily and follow the conversation more naturally. Alternatively, users can opt to choose from a set of default voices. Interpreter is now available in public preview.\n</li><li><i>Facilitator:</i> The Facilitator agent works alongside you and your team in Teams meetings to enable more effective collaboration. During the meeting, Facilitator takes real-time notes, allowing everyone to co-author and collaborate easily. Now, Facilitator will also help moderate meetings by leveraging the set agenda from the meeting invite or identifying the goal from the meeting discussion. At the halfway point and before wrapping up the meeting, Facilitator will recap the decisions made and open questions, ensuring that important follow-up tasks and details are not missed. These two Facilitator capabilities are now available in public preview. \n</li><li><i>Project Manager:</i> The Project Manager agent in Planner automates project and task management for all your team needs. Project Manager can automatically create a new plan from scratch or use a pre-configured template based on goals and relevant files you input. It can also complete tasks, including content creation. Now, Project Manager can generate a status report for any project in a matter of minutes. Reports will include a project summary, the reporting period, potential blockers, and more to keep team members informed. Collaborate with your team to refine the report and share it across surfaces including SharePoint newsletters to reach a broader audience.  \n</li></ul><p><b>When will this happen:</b></p><ul><li>Skills: Will be generally available in June 2025.</li><li>Interpreter: Fully rolled out to public preview.</li><li>Facilitator: Public preview roll out of the new meeting moderation capability will start on early May 2025.</li><li>Project Manager: Public preview roll out of the new status report capability will start on late May 2025 (previously late April).</li></ul><p><b>What you need to do prepare:</b></p><p>Users must have a Microsoft 365 Copilot license to access Interpreter, Facilitator, and Project Manager in public preview. Beyond preview access, additional licensing details will be communicated prior to general availability. \n</p><p><i>Interpreter:</i></p><ul><li>Admins can manage access to Interpreter and configure the default behavior of voice simulation for users via PowerShell. For more information refer to the admin documentation here: <a href=\"https://learn.microsoft.com/microsoftteams/interpreter-agent-teams\" target=\"_blank\">Manage Interpreter agent for your organization - Microsoft Teams | Microsoft Learn</a>\n</li></ul><p><i>Facilitator:</i></p><ul><li>The Facilitator app controls both AI-generated notes and the meeting moderation capability mentioned in this post. It will be allowed by default unless all apps are blocked by your organization. However, as an admin, you control whether Facilitator will be available to your entire organization or to a certain group of users. For more information, refer to our admin documentation here: <a href=\"https://learn.microsoft.com/MicrosoftTeams/facilitator-teams\" target=\"_blank\">Set up Facilitator in Microsoft Teams for collaborative AI notes - Microsoft Teams | Microsoft Learn</a> \n</li><li>Facilitator capabilities require transcription and for the 'Allow Copilot' meeting option to be set to 'During and After Meeting.' Facilitator needs to be added within the first 5 minutes from scheduled start time to experience to full capabilities.\n</li></ul><p><i>Project Manager:</i></p><ul><li>Admins do not need to take action to enable the status report capability as it will be automatically available after rollout.\n</li><li>The status report capability will begin rolling out before a control in the admin portal to disable Project Manager is available. If you would like to disable Project Manager before the admin control is available, open a support request with Planner support and we can disable it on your behalf temporarily until the self-service option is available. Learn more: <a href=\"https://learn.microsoft.com/Planner/turn-off-project-manager\" target=\"_blank\">Turn off Project Manager in Planner for your organization</a>. \n</li></ul><p><br></p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Out-of-the-box agents in Microsoft 365 apps and Copilot Chat automate tasks and enhance productivity. New updates include the Skills agent (June 2025), Interpreter (public preview), Facilitator (public preview), and Project Manager (public preview). Users need a Microsoft 365 Copilot license. Admins can manage access and configurations via PowerShell and admin portals."
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060863",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-28T16:58:00.41Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:37:23Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Out-of-the- box Agents in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
