{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing a new cost control feature in the Power Platform admin center, accessible from the tenant view, to help manage Copilot Studio agents efficiently in Microsoft Power Platform governance and administration. This feature will reach general availability on July 14, 2025.<br><br>\n<b>How does this affect me?</b><br>\nThis feature will provide the following:<br><br>\n<b>Visibility And Control</b><ul>\n    <li>Centralized agent view across the tenant provides IT and business admins full transparency into AI agent usage and limits.</li>\n    <li>Enables quick identification of high-usage agents, helping avoid unexpected consumption or cost spikes.</li>\n</ul>\n<b>Cost Management and Predictability</b><ul>\n    <li>Set monthly caps on agent usage to stay within budget or enforce prepaid limits.</li>\n    <li>For Pay-as-you-go environments, control how much you're willing to spend by applying limits per agent.</li>\n    <li>Helps prevent overconsumption that leads to unplanned billing.</li>\n</ul>\n<b>Capacity Optimization</b><ul>\n    <li>Ensures agents in prepaid environments don't exceed allocated capacity, avoiding disruption to other workloads.</li>\n    <li>Supports intelligent resource planning by monitoring trends and adjusting limits proactively.</li>\n</ul>\n<b>Operational Efficiency</b><ul>\n    <li>Enables faster admin actions like turning off an agent or adjusting limits without needing backend support.</li>\n    <li>Reduces support overhead and manual monitoring through self-service controls.</li>\n    <li>Usage Accountability.</li>\n    <li>Promotes cost accountability by linking agents to environments or teams.</li>\n    <li>Facilitates chargeback or models where departments are billed based on what they use.</li>\n</ul>\n<b>What do I need to do to prepare?</b><br>\nThis message is for awareness and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-07-14T15:35:09Z",
  "HasAttachments": false,
  "Id": "MC1094634",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-14T15:36:30.34Z",
  "Services": [
    "Power Platform"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-14T15:35:09Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Power Platform governance and administration - Agent Level Message Capacity Limit",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
