{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 4, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Clipchamp now offers an AI-powered video creation feature through Clipchamp Copilot for work. Simply type your prompt, and Clipchamp will generate a bespoke script, source high-quality stock footage, and assemble a video project complete with music, voiceover, text overlays, and transitions. This provides you with a first draft, which you can edit in the app. You can then export the video to mp4, which will be saved in OneDrive and count towards your OneDrive quota, ready for sharing. This feature is ideal for creating informational videos, video messaging, how-to guides, demos, and video presentations. Available on the Microsoft 365 Copilot plan.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=471441\" target=\"_blank\">471441</a>.\n</p><p>Video creator limitations\n</p><p>The video creation skill does not generate new video clips, animations, images, or audio. We use content in existing Microsoft 365 asset libraries to bring your video to life. Once the script is generated, we select the most appropriate audio and imagery available in our asset libraries to complement both the content and the style of your video. You can edit the video to update the script, replace the selected media, or extend the video with new content.\n</p><p><b>When this will happen:</b></p><ul><li>Targeted Release: We will begin rolling out in mid-April 2025 and expect to complete by late-April 2025.\n</li><li>General Availability: We will begin rolling out in late-April 2025 and expect to complete by early June 2025 (previously late May).\n</li></ul><p><b>How this will affect your organization:</b></p><p>Controlling access to your videos: The video creation skill will generate a Clipchamp video project within the user's OneDrive (inside a Videos/Clipchamp folder). For more information about Clipchamp, visit our <a href=\"https://adoption.microsoft.com/en-us/clipchamp/\" target=\"_blank\">Clipchamp Adoption page</a>, or the <a href=\"https://support.microsoft.com/en-gb/topic/what-is-clipchamp-750e8940-cd76-4abf-9767-b34d3d3285d7\" target=\"_blank\">Get Started</a> page on our support site.\"&nbsp;</p><p>Managing access to video creation: This feature is only available for users who have the Microsoft 365 Copilot plan and will not be an upsell offering to other customers. There are no admin controls provided specifically for this feature. The feature only appears when users open a new blank project in Clipchamp.\n</p><p><b>What you need to do to prepare:</b></p><p>Inform your team about the new feature and help us improve it by providing feedback. In addition to existing support and feedback mechanisms, users can provide quick feedback by clicking the thumbs-up or thumbs-down icon below their video. Clicking these icons will open the feedback dialog and allow users to enter comments and (optionally) include a screenshot or prompt information.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "471441"
    },
    {
      "Name": "Summary",
      "Value": "Clipchamp introduces AI-powered video creation with Clipchamp Copilot for work, allowing users to generate and edit video projects using prompts. The feature, available on the Microsoft 365 Copilot plan, will roll out from mid-April to early June 2025. Videos are saved in OneDrive and count towards the user's quota."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024396",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-04T17:45:53.883Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:51:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Clipchamp introduces AI-powered video creation with Clipchamp Copilot for work",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
