{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 3, 2025: This post has been updated to include mobile and associated timelines</p><p>Coming soon: With the new <i>Generate an audio overview</i> option, users can listen to AI-generated audio overviews that summarize or discuss the contents of Microsoft Word documents, PDF files, and Microsoft Teams meeting recordings with transcripts that are stored in OneDrive.</p><p>This feature is also coming to mobile for Microsoft Word documents and PDF files.</p><p>A Microsoft 365 Copilot license is required to access this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478649\" target=\"_blank\">478649</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by mid-July 2025 (previously mid-June) for OneDrive web.</p><p>General Availability (Worldwide): We will begin rolling out in July 2025 and expect to complete by August 2025 for OneDrive mobile.</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users can access the new feature in OneDrive web by going to a Word document, PDF, or Teams meeting recording with transcript, selecting the Copilot icon, and choosing <i>Generate an audio overview:</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/84219389-986c-4206-96ba-1f10cafb4f4d\" style=\"width: 50%;\">\n</p><p>The floating, draggable audio player will launch and after a little while, the audio overview will play:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6ac6c811-51b5-415f-b109-ec1f4f6d09a6\" style=\"width: 50%;\">\n</p><p>Audio overviews will play in a summary style by default (one person, professional, and succinct). If desired, users can switch to <i>Podcast style </i>from the three-dot menu for a longer, two-person, more casual discussion of the content of their files:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c33767de-4854-4d84-817e-6eba1abdb5da\" style=\"width: 50%;\">\n</p><p>\n</p><p>After this rollout, users can access the new feature in OneDrive mobile by taking the follow steps:</p><ol><li>Open the OneDrive mobile app&nbsp;</li><li>Ensure you are in your OneDrive for work account&nbsp;</li><li>Navigate to a Word document or PDF&nbsp;</li><li>Click on the three dots next to the file or open the file and swipe up.&nbsp;</li><li>Tap on “Generate an audio overview</li></ol><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/d4420e93-4916-4ff8-816a-bc8d675300e9/20b0ccb0a9c7d522594431dea86af8d186cde7c2.png\" style=\"\"></p><p><br></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e81f98df-fb09-4c38-be92-ac5895e1db67/9e8c635d16352e090d2a8375410ff5a3ab5e6eab.png\" style=\"\"><br></p><p>This feature will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate. These features are available to users with a Copilot license.</p><p>Review the following resource to understand how to manage Microsoft 365 Copilot access within your organization:</p><ul><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-page\" target=\"_blank\">Manage Microsoft 365 Copilot scenarios in the Microsoft 365 admin center</a></li></ul><p>You can manage Copilot for specific apps or users through either the Microsoft 365 Admin center or Group Policy.</p>\n<p>Learn more:</p><ul><li><a href=\"https://support.microsoft.com/topic/generate-audio-overviews-with-copilot-in-onedrive-e5f2d98f-a53e-4242-aba7-d9b1d69f1089?preview=true\" target=\"_blank\">Generate audio overviews with Copilot in OneDrive - Microsoft Support</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478649"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will soon offer AI-generated audio overviews for Word documents, PDF files, and Teams meeting recordings stored in OneDrive. This feature will be available on both web and mobile platforms, requiring a Copilot license. Rollout begins in May 2025 for web and July 2025 for mobile."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060872",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-03T16:47:24.09Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:50:57Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot: New audio overviews for Word and PDF files in Microsoft OneDrive",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
