{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 8, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Understanding, collaborating on and refining a document takes time and effort. That’s why Copilot will soon include a dynamic document snapshot that updates in real time, giving you a clear summary, key insights, activity and comment highlights, and coaching suggestions in the top of your document. Whether you're learning, managing projects, or need a writing assistant, Copilot helps you stay focused and in control.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483519\" target=\"_blank\">483519</a>.</p><p><b>When this will happen:</b>\n</p><p>General availability (Worldwide):</p><ul><li>Document snapshot - Summary is currently rolling out in Web and in Word desktop.</li><li>Document snapshot - Insights tab will roll out late April 2025 in Web and will start rolling out July 2025 in Word desktop.</li><li>Document snapshot - Activity will roll out late May 2025 (previously mid-May) in Web and will start rolling out July 2025 in Word desktop</li><li>Document snapshot - Discussion will roll out mid-May 2025 in Web and will start rolling out around August 2025 in Word desktop</li><li>Document snapshot - Coaching will start rolling out in June 2025 in Web. There is no ETA for Word desktop at present.&nbsp;</li></ul><p><b>How this will affect your organization:</b></p><p>With the new Copilot document snapshot, you can:</p><ul><li>See an automatic summary in the document snapshot (Summary tab). In the summary, you can choose the level of summary detail –brief, standard, or detailed. Detailed summary now supports up to 3000 pages in a document, an upgrade from the previous cap of 300 pages (a 10x increase!).\n</li><li>Get a quick view of key numbers in the document, or example questions you could ask to get other details (Insights tab). If you have more questions, you can scroll down to the bottom, select the chat button and enter a prompt.\n</li><li>Catch up on what has changed in the document since you last opened it (Activity tab). You can also decide to look back what happened over the last 3 days, 1 week or 2 weeks.\n</li><li>See a summary of all active document comments and discussions (Discussion tab).&nbsp;</li><li>See coaching suggestions to improve your document (Coach tab).</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c626b645-ad3f-4dd2-a754-5b891cf37607\" style=\"width: 450px;\"></p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate. These features are available to users with a Copilot license.</p><p>Review the following resource to understand how to manage Microsoft 365 Copilot access within your organization:</p><ul><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-page\" target=\"_blank\">Manage Microsoft 365 Copilot scenarios in the Microsoft 365 admin center</a></li></ul><p>You can manage Copilot for specific apps or users through either the Microsoft 365 Admin center or Group Policy.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483519"
    },
    {
      "Name": "Summary",
      "Value": "Word Copilot's document snapshot provides real-time summaries, key insights, activity and comment highlights, and coaching suggestions. Features are rolling out between April and August 2025. Organizations should update training and documentation. Available to users with a Copilot license. More details at Microsoft 365 Roadmap ID 483519."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060867",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-08T17:41:13.75Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:47:29Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Word Copilot's document snapshot lets you see a summary, key insights, activity and comment highlights, and coaching",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
