{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 10, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Microsoft Graph connectors enable you to index enterprise content in third-party systems for knowledge extension in Microsoft 365 Copilot. Microsoft offers a wide range of out of the box connectors for products like ServiceNow, Jira, Confluence, Salesforce, File shares etc. Configured Graph connectors will automatically power M365 Copilot.&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late June 2025 (previously late May) and expect to complete by late July 2025 (previously late June) .</p><p><b>How this will affect your organization:</b></p><p>Upon configuration of Graph connectors, your end users will be able to prompt Copilot to ask queries about the indexed content. Your end users will also be able to search for the content in any of the Microsoft Search clients like SharePoint, Bing, Microsoft 365 (Office) app etc.</p><p><u>What is changing? \n</u></p><p>Graph connectors are now available in a new, centralized location, bringing Graph Connectors and Copilot together under one unified experience in the <a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-page\" target=\"_blank\">Copilot Control System</a>.\n</p><ul><li><i style=\"\">Previous Navigation:</i> Microsoft 365 Admin Center (MAC) → Settings → Search &amp; Intelligence → Data sources\n</li><li><i>New Navigation:</i> MAC → <b>Copilot Control System</b> → <b>Agents &amp; Connectors</b> → Connectors\n</li></ul><p>Previously, accessing connectors required navigating through three levels. With this change, we’ve brought connectors to the forefront. This experience reflects our commitment to aligning Graph Connectors with the way you manage Copilot today, bringing them closer to the Agents experience for unified, simplified, and intuitive management across data sources and AI workflows.\n</p><p><u>What is new? \n</u></p><p>Alongside this relocation, we’re rolling out an enhanced connector gallery experience designed to help you discover and deploy connectors more efficiently.\n</p><p>Here’s what’s improved:\n</p><ul><li><i>Improved Discoverability with Categories:</i> Connectors are now grouped based on usage scenarios and business needs, making it easier to explore what’s relevant to your organization.\n</li><li><i>Search by Category or Name:</i> You can now search using connector names or by category to quickly find what you need.\n</li><li><i>Clearer Descriptions for Better Decision-Making:</i> Each connector now includes rich descriptions and context to help you determine if it fits your organization’s requirements. – expected in June 2025</li></ul><p><b>What you need to do to prepare:</b></p><p>You may consider updating documentation to reflect the new location for managing connectors.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Graph connectors are now available in the Copilot tab with a new connector gallery look. The rollout will start in late June 2025 and complete by late July 2025. The connectors are relocated for better accessibility and enhanced with improved discoverability, search functionality, and clearer descriptions."
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060840",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-10T17:44:12.607Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:06:25Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Graph connectors are now available in Copilot tab with new connector gallery look",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
