{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Copilot now makes it easier to schedule meetings directly from email conversations. With the new Schedule with Copilot option, Copilot analyzes the email thread and automatically creates a meeting invitation—pre-filling the title, agenda, and attaching the email thread. Attendees from the email are added to the invite, and you can quickly review, edit, and send.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=494154\" target=\"_blank\">494154</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out on early July 2025 and expect to complete by late August 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Once available, users will see a new Schedule with Copilot option in supported email threads. This feature streamlines meeting creation by reducing manual steps and improving consistency in meeting details.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/903c9ddf-9cc3-43bb-bc8d-837c822e5703/eeecd37feb82336bd11e3d76ff953c5b5a43d85f.png\" width=\"400\" height=\"\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494154"
    },
    {
      "Name": "Summary",
      "Value": "Copilot now allows scheduling meetings directly from email threads by analyzing the conversation and creating invitations with pre-filled details. This feature will roll out globally from July to August 2025, requiring no admin action but notifying users and updating documentation is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-10-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090693",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-09T23:15:32.267Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:15:26Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Create a meeting from an email thread with Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
