{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 20, 2025: We have updated the content below for clarity. Thank you for your patience.</p><p>This upcoming feature will enable IT admins to configure and customize of Microsoft 365 Copilot Search across your organization. This feature provides centralized tools to tailor search experiences to organizational needs. This improved governance and customization enhances information discoverability, reduces time spent searching for critical content, and supports better decision-making across teams. Designed to enhance productivity and maximize the value of Microsoft 365 Copilot, the feature supports both setup and ongoing optimization of enterprise search experiences.</p><p>A Microsoft 365 Copilot license is required to use this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=495460\" target=\"_blank\">495460</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Microsoft 365 Copilot Search will begin rolling out early July 2025 and expect to complete by mid-July 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>To access the settings for Copilot Search in Microsoft 365 admin center, go to <i>Copilot Control Systems &gt; Search.\n</i></p><p>Acronym management in Copilot search:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6f818dd2-0e0d-4b36-8796-904699350227\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/32ea6fdc-d7a2-4bac-9d8c-f816a8e0b359\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Bookmark management in Copilot search:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b77279b1-4d87-4a34-b71d-8da3567846c3\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>A user must have the global admin, global reader, or AI admin role to view these settings.</p><p>The new settings will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>Assign the required roles to view the new settings.</p><p>Learn more: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-search\" target=\"_blank\">Microsoft 365 Copilot Search | Microsoft Learn</a></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "495460"
    },
    {
      "Name": "Summary",
      "Value": "New admin controls for Microsoft 365 Copilot Search will allow IT admins to configure and customize search experiences. This feature, requiring a Copilot license, will enhance information discoverability and productivity. It will roll out globally from early to mid-July 2025. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1094049",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-20T20:37:39.43Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-13T21:52:17Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: New admins controls for Copilot Search management",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
