{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To improve performance and reliability, we have scheduled planned maintenance for the Windows 365 service. This maintenance will occur during non-peak hours, based on the Client Device’s local time zone, to minimize potential impact on your organization. For organizations with users across multiple regions, we recognize that non-peak hours may vary. Maintenance will take place separately in each region, affecting only users connecting from that location during the scheduled time. The times listed below indicate the actual maintenance start times for each region, not adjusted for different time zones.\n</p><p>During this period, there will be no service downtime. Users are expected to experience little to no disruption.\n</p><p><b>Maintenance Schedule: \n</b></p><ul><li>Start Date: June 2, 2025\n</li><li>End Date: June 7, 2025\n</li></ul><p><b>Daily Maintenance Window Start Times: \n</b></p><ul><li>Africa: 23:00 UTC \n</li><li>Asia Pacific: 16:30 UTC \n</li><li>Australia: 14:00 UTC \n</li><li>Europe: 00:00 UTC \n</li><li>India: 19:30 UTC \n</li><li>North America: 06:00 UTC \n</li><li>South America: 05:00 UTC \n</li></ul><p><b>Daily Maintenance Window End Times:\n</b></p><ul><li>Africa: 03:00 UTC \n</li><li>Asia Pacific: 20:30 UTC\n</li><li>Australia: 18:00 UTC\n</li><li>Europe: 04:00 UTC \n</li><li>India: 23:30 UTC\n</li><li>North America: 10:00 UTC\n</li><li>South America: 09:00 UTC\n</li></ul><p><b>How does this affect my organization?</b> \n</p><ul><li>During the maintenance window, users actively connected via UDP relay may experience brief, automatic reconnections, with each disconnection lasting less than a minute. \n</li><li>While the total planned impact duration is up to 4 hours within the maintenance window, disconnections will only occur 1-2 times and will not persist throughout the entire 4-hour period. \n</li><li>Users can establish new connections without impact during the maintenance window. The service will remain fully available without any downtime. \n</li></ul><p><b>What do I need to do to prepare for this change?</b> \n</p><p>No further action is required, as systems will automatically recover from any temporary interruptions. You may want to notify your helpdesk and end-users of the scheduled maintenance and the potential for brief disruptions.  \n</p><p>We are committed to providing a seamless experience and appreciate your understanding as we carry out this necessary maintenance to enhance the reliability of Windows 365 services. \n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Planned maintenance for Windows 365 will occur from June 2 to June 7, 2025, during non-peak hours in each region. No service downtime is expected, but brief, automatic reconnections may occur. No action is required from users, though notifying helpdesk and end-users is recommended."
    }
  ],
  "EndDateTime": "2025-07-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1078756",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-20T23:35:59.95Z",
  "Services": [
    "Windows 365"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-20T23:35:29Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Planned Maintenance: Windows 365 Service",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
