{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 4, 2025: We have updated the timeline. Thank you for your patience.</p><p>Soon, users will be able to summarize PDF, Microsoft Word (.docx), and Microsoft PowerPoint (.pptx) email attachments with Copilot in Outlook. The new feature will be available in Microsoft Outlook for the web, the new Microsoft Outlook for Windows desktop, Microsoft Outlook for Android/iOS, and the new Microsoft Outlook for Mac desktop.\n</p><p>A Microsoft 365 Copilot license is required to access this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=475249\" target=\"_blank\">475249</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late July 2025.</p><p>General Availability (GCC): We will begin rolling out mid-June 2025 and expect to complete by late September 2025 (previously late August).</p><p>\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users will be able to pick a classic attachment from the email thread and summarize it with Copilot by selecting <i>Summarize </i>in the attachment's three-dot context menu or in the attachment's Preview, or by selecting <i>Summarize a file</i> in the <i>Summary by Copilot</i> card. The Copilot summary will display below the existing email summary inside the <i>Summary by Copilot</i> card:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2f3a67da-11d4-45a2-91ec-71d1d6de96a4\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>We do not support encrypted files or files protected by Microsoft Information Protection (MIP).\n</p><p>This feature will be available by default for users with a Copilot license, but this feature will respect the Copilot control toggle setting in Outlook. Users who have turned off this toggle will not see this feature.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/cd1d516d-1d52-453f-be3d-ccb719a8e04c\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/summarize-an-email-thread-with-copilot-in-outlook-a79873f2-396b-46dc-b852-7fe5947ab640?preview=true\" target=\"_blank\">Summarize an email thread with Copilot in Outlook - Microsoft Support</a> (will be updated before rollout)</p><p>#newoutlookforwindows</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "475249"
    },
    {
      "Name": "Summary",
      "Value": "Starting mid-May 2025, Outlook users with a Microsoft 365 Copilot license can summarize PDF, Word, and PowerPoint email attachments using Copilot across web, desktop, and mobile. The feature rolls out automatically, excludes encrypted/MIP-protected files, and respects the Copilot toggle setting."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1073094",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-04T14:38:06.05Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-13T23:51:03Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Summarize email attachments with Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
