{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 28, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Coming soon for Microsoft SharePoint: A new web part for FAQs, to help assist content owners keep their content fresh and relevant. Powered by Microsoft 365 Copilot, this new web part can help content owner easily curate FAQ by working with agents and connected grounding data.</p><p>Copilot license requirements:</p><ul><li>Reading: All readers can view FAQ web part content without a Copilot license.\n</li><li>Creating &amp; Editing: A Copilot license is necessary for creating and editing content using Copilot features.</li></ul><p>\n</p><p>This feature requires a SharePoint license and a Microsoft 365 Copilot license.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=482198\" target=\"_blank\">482198</a>.</p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide): We will begin rolling out&nbsp;early August 2025 and expect to complete by late August 2025.</p><p>\n</p><p>Public Preview (GCC): We will begin rolling out late September 2025 and expect to complete by mid-October 2025.</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-November 2025 and expect to complete by late November 2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, authors can add the web part for FAQs directly to pages or news posts during editing:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/49f6a030-e9ed-472e-bdb6-c33997562530\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>By selecting one or more grounding source files, AI will automatically generate FAQ content, reducing the time and effort needed for manual creation of FAQs. The web part currently supports FAQ types such as<i> Event, Product, and Policy,</i> with the option for authors to provide additional descriptions to guide more targeted content generation. \n</p><p>FAQs created using the web part can be indexed for search and shared via email, making it easier to distribute consistent, up-to-date information to your organization.</p><p>This change will be available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "482198"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint will introduce a new FAQ web part powered by Microsoft 365 Copilot, enabling easy creation and editing of FAQs using AI. Readers can view FAQs without a Copilot license, but authors need one to create or edit. Rollout starts August 2025 with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1074972",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-28T16:57:52.497Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-15T23:00:10Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: New web part for FAQs powered by Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
