{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 17, 2025: We have updated the content below with additional information regarding mobile apps. Thank you for your patience.</p><p>Frontier offers the ability to get hands-on with the latest model innovation and provide feedback before experiences are made generally available. Microsoft 365 Admins can configure Frontier features for their end users within their own tenant. This post outlines how to configure access to Frontier features across platforms and what to expect.</p><p>Frontier feature admin control for mobile apps:</p><p>Frontier features will now be visible to all users using Android Beta or iOS TestFlight applications. Prior, admins could control which users on these applications would be able to see Frontier features. </p><p><b>When this will happen:</b></p><p>General Availability: We will roll out the capability in May 2025.</p><p><b>How this will affect your organization:</b></p><p>Frontier lets M365 Admins opt-in users for early access to experimental AI features. This lets selected users experience the latest AI features being released with the own data inside their own tenant.</p><p><b>What you need to do to prepare:</b></p><p>To prepare for the rollout, IT Admins should identity end users who would benefit from early access to Frontier features. Those users should be added to a Microsoft Entra ID group, so that the group can then be configured for access.&nbsp;</p><p><i>Licensing Requirements:</i></p><p>Users must have an active Copilot license to access Frontier features.</p><p><i>Configuration for Desktop (Win32 &amp; Mac) and Mobile:</i></p><ul><li>Add users to the Insiders Beta Channel as you normally would.\n</li><li>To opt users out, remove them from Insiders Beta or move them to Insiders Current Channel (CC).\n</li><li>We recommend enabling the Channel Picker for end users, allowing them to self-manage their participation.</li><li>For Mobile, Frontier features will be available to all users on Android Beta and iOS TestFlight apps.</li></ul><p><i>Configuration for Web-based Products:\n</i></p><ul><li>A new control is available in the Microsoft 365 Admin Center. The control can be accessed through the Settings page under the Copilot tab.</li><li>Admins can manage access by adding or removing AAD groups.</li></ul><p><i>Agent Features:</i></p><ul><li>&nbsp;Agent-related features are not managed via the new admin control. These are handled separately through the Agent Store.</li></ul><p><i>Important Notes:</i></p><ul><li>Frontier features are experimental and subject to change. There is no guarantee they will be released to general availability.</li><li>Participation in Frontier is optional.</li></ul><p><i>Next Steps:</i></p><ul><li>Review your current Insider configurations.</li><li>Identify users or groups who may benefit from early access.</li><li>Use the new admin controls to manage access as needed.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Updated July 17, 2025: Frontier features in Microsoft 365 allow admins to configure early access to experimental AI features for end users. Mobile apps now show Frontier features to all users on Android Beta and iOS TestFlight. Admins should prepare by identifying users, configuring access via Microsoft Entra ID groups, and ensuring users have active Copilot licenses."
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084633",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-17T23:58:51.27Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-28T22:43:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Configure End Users for Frontier features in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
