{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To streamline the content creation experience within Microsoft 365 Copilot and align with tenant-level policies, Microsoft will no longer pre-install Visual Creator agent in Microsoft 365 Copilot Chat.\n</p><p>Users will continue to be able to generate images directly in Copilot Chat. For broader content creation scenarios, we recommend using the Create experience in the Microsoft 365 Copilot app. Create offers a comprehensive set of tools for generating and editing visual content for work, including images, posters, banners, and videos. Learn more about Create.</p><p>\n</p><p><b>When this will happen:</b>\n</p><p>This change will begin rolling mid-July, 2025 and is expected to complete by mid-July, 2025.</p><p><b>How this will affect your organization:</b>\n</p><ul><li>The Visual Creator agent will no longer be pre-installed or automatically appear in the agent list in Copilot Chat across endpoints.\n</li><li>Users will still be able to find and install the Visual Creator agent from the Agent Store, provided your tenant policy allows Microsoft-built agents.\n</li><li>Past interactions and files created using the Visual Creator agent will remain accessible in Chat &gt; Conversations.\n</li><li>Users will still be able to generate images within the Copilot Chat experience or use the Create experience in the M365 Copilot app for broader content generation scenarios</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>No admin action is required for this change. However, it is recommended that you notify your users about the upcoming change and update internal documentation that reference the Visual Creator agent\n</p><p>If your tenant policy blocks Microsoft-built agents by default but you want users to continue using Visual Creator, you can deploy the agent or publish to specific users or groups in the admin center. \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will no longer pre-install the Visual Creator agent in Microsoft 365 Copilot Chat starting mid-July 2025. Users can still generate images in Copilot Chat and use the Create experience for broader content creation. No admin action is required, but notifying users and updating documentation is recommended."
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098165",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-18T23:10:41.713Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-18T23:10:17Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft 365 Copilot: Visual Creator Agent will no longer be pre-installed",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
