{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Microsoft 365 Copilot Interaction Export API for Microsoft 365 Copilot apps will enable third-party apps and ISVs to export Copilot user interaction data for processing in their security and compliance (S+C) applications. This new API captures the user prompts and Copilot responses in Copilot private interactions chat and provides insights into the resources Copilot has accessed to generate the response. The new API will be available in the public cloud.\n</p><p>A Microsoft 365 Copilot license is required to access this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=491631\" target=\"_blank\">491631</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early June 2025 and expect to complete by mid-June 2025.</p><p><b>How this will affect your organization:</b></p><p>The new API will be available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>To access the API, you need: </p><ol><li>AiEnterpriseInteraction.Read.All permissions</li><li>A Microsoft 365 Copilot license\n</li></ol><p>Learn more: <a href=\"https://learn.microsoft.com/graph/api/aiinteractionhistory-getallenterpriseinteractions?view=graph-rest-beta&amp;tabs=http\" target=\"_blank\">aiInteractionHistory: getAllEnterpriseInteractions - Microsoft Graph beta | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "491631"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft 365 Copilot Interaction Export API allows third-party apps to export Copilot user interaction data for security and compliance processing. It requires a Microsoft 365 Copilot license and will be available in June 2025. No admin action is required before the rollout. Roadmap ID: 491631."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1080682",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-22T23:44:12.48Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-22T23:44:05Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Interaction Export API",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
