{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 11, 2025: We have updated the timeline below. Thank you for your patience.</p><p>The Interpreter agent allows each user to enable real-time speech-to-speech interpretation in multilingual Teams meetings so they can speak and listen in the language of their choice, instantly overcoming language barriers.&nbsp;</p><p>Users can opt-in to have Interpreter simulate their voice, helping others identify them more easily and follow the conversation more naturally. Alternatively, users can opt to choose from a set of default voices. &nbsp;</p><p>Whether you're collaborating with global teams or engaging with international clients, the Interpreter agent ensures everyone can speak, listen, and understand without barriers - making meetings more accessible and engaging.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490740\" target=\"_blank\">490740</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early June 2025 and expect to complete by late July 2025 (previously mid-June).</p><p><b>How this will affect your organization:</b>\n</p><p>For users:</p><ul><li>When using the Interpreter agent for the first time, users need to set up their preferred interpretation settings, including:&nbsp;<ul><li>Language selection: Choose the language you want to listen to.&nbsp;</li><li>Audio volume balance: Adjust the ratio between original and interpreted audio.&nbsp;</li><li>Voice preference: Decide whether to use their own simulated voice or one of the default voices for interpretation.&nbsp;</li></ul></li><li>Once set up, these preferences will make future meetings smoother and more intuitive, ensuring a better experience. </li><li>Since different languages have unique speech structures, grammar rules, and sentence orders, the interpreted audio may arrive at slightly different speeds. &nbsp;</li><li>Interpreter works best in structured conversations where one person speaks at a time for longer periods. To ensure a smooth and clear conversation, participants may need to pause briefly after someone speaks, allowing the translation to fully process before responding. This helps maintain accuracy and ensures everyone stays on the same page. &nbsp;</li><li>Interpreter is not optimized for   meetings with rapid exchanges, interruptions, or overlapping dialogue, since the translation may take longer than the original speech, which can make it harder to follow the conversation and respond naturally. &nbsp;</li><li>Interpreter is currently available during scheduled or channels meetings in Teams. Support for calls (VoIP, PSTN), town halls, or Teams Rooms is not currently available.&nbsp;</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>For IT administrators:</p><ul><li>Feature control &amp; customization: Admins can manage access to the Interpreter agent and configure the default behavior of voice simulation for users via PowerShell.&nbsp;</li><li>License requirement: To participate in the public preview and use Interpreter in Teams meetings, users must have a Microsoft 365 Copilot license. Any users with a Microsoft 365 Copilot license can enable Interpreter during a meeting. Beyond preview access, additional licensing details will be communicated prior to general availability.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Interpreter agent in Teams meetings allows real-time speech-to-speech interpretation, enabling users to speak and listen in their preferred language. Users can choose voice preferences and adjust audio settings. The feature is rolling out from early June to late July 2025 and requires a Microsoft 365 Copilot license."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1038409",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-11T13:51:34.94Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-21T17:01:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Interpreter agent in Teams meetings (Copilot)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
