{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft PowerPoint is introducing a new capability that enables users to rephrase or rewrite text using natural language instructions via Microsoft 365 Copilot. This enhancement allows for more tailored and expressive content creation directly in PowerPoint.\n</p><p>A Microsoft 365 Copilot license is required to access this feature.</p><p>This message refers to PowerPoint for Windows desktop, PowerPoint for Mac desktop, and PowerPoint for the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=494831\" target=\"_blank\">494831</a>, Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=494832\" target=\"_blank\">494832</a> and Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=494833\" target=\"_blank\">494833</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early July 2025 and expect to complete by late July 2025.</p><p>General Availability (GCC): We will begin rolling out mid-August 2025 and expect to complete by late August 2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, users will see a new option under the existing Copilot rewrite dropdown menu in textboxes. This feature introduces a prompt box where users can enter natural language instructions to rephrase or replace selected text.</p><ul><li>This feature will be on by default.\n</li><li>No changes to existing permissions or settings are required.</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: The section called <i>Using the PowerPoint Rewrite Feature</i> in <a href=\"https://support.microsoft.com/topic/elevate-your-presentation-game-with-copilot-s-text-rewrite-feature-in-powerpoint-d70b140b-bb3f-46b7-be64-ceec526a8d\" target=\"_blank\">Elevate your presentation game with Copilot's text rewrite feature in PowerPoint - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494831,494832,494833"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft PowerPoint will introduce a feature allowing users to rephrase text using natural language prompts via Microsoft 365 Copilot, starting July 2025. A Copilot license is required. The feature will be available on Windows, Mac, and web versions, and will be enabled by default without needing admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1099688",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-20T22:15:28.417Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-20T22:15:22Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft PowerPoint: Use Microsoft 365 Copilot to rephrase text with natural language prompts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
