{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Planner: The preview of web search capability in <a href=\"https://techcommunity.microsoft.com/blog/plannerblog/unleashing-the-power-of-agents-in-microsoft-planner/4304794\" target=\"_blank\">Project Manager Agent (PMA)</a>. With this capability, Project Manager Agent can bring real-time information into tasks it executes in Planner. For tasks that require web inputs, Project Manager Agent will automatically search the web and incorporate relevant content directly into the task output. All references from the search will be included on the generated Microsoft Loop page for transparency and traceability.\n</p><p>This feature requires a Microsoft 365 Copilot license and access to Microsoft Planner through a Microsoft 365 license.</p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide): We will begin rolling out in early June 2025 and expect to complete by late July 2025.</p><p>General Availability: We will communicate the plan for General Availability in a future post.</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization has previously enabled web grounding for specific users, those users will now benefit from enhanced task assistance via the Project Manager agent in Planner. This update builds on previously enabled capabilities and does not change existing configurations.</p><p>This change will be available by default.</p><p>Web search capability in the Project Manager Agent in Planner:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/87dfa327-b671-4132-ad90-76557d8963f9\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>No action is required after the rollout if web grounding is already enabled for your users. If you wish to enable this capability for additional users, please review your web search settings. Learn more about how you as an admin can <a href=\"https://learn.microsoft.com/copilot/microsoft-365/manage-public-web-access#it-admin-control-for-both-microsoft-365-copilot-and-microsoft-365-copilot-chat\" target=\"_blank\">turn web search on or off</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Planner will soon preview a web search capability in the Project Manager Agent (PMA), allowing real-time web information integration into tasks. This feature requires a Microsoft 365 Copilot license and will roll out from June to July 2025. No admin action is needed before rollout, but review configurations and notify users."
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1089319",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-06T23:33:45Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-06T23:33:37Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Planner: Web search capability in the Project Manager Agent (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
