{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Prioritize my inbox by Copilot helps you manage and prioritize your communications by analyzing your emails and marking them with a high priority mark; alternatively, users can choose to have Copilot also mark low priority emails with a different mark.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=411302\" target=\"_blank\">411302</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out April 2025 to new Outlook for Windows and web  in English.&nbsp;</p><p>Other clients and languages will follow soon.</p><p><b>How this will affect your organization:</b>\n</p><p>When this change happens, users in your tenant with Microsoft 365 Copilot licenses will be able to opt-in to Prioritize my inbox and enable it on their mailbox.&nbsp;</p><p>Prioritize will appear in the Copilot dropdown in the top corner of Outlook email. If selected by users, a set-up wizard will appear walking them through enabling this feature.\n</p><p>Prioritize only works on your main inbox not in folders.\n</p><p>Prioritize my inbox does not work on other mailboxes (shared or group).\n</p><p>The feature will be opt-in, users will have to specifically request the feature and go through a wizard to opt-in. For now, you can't choose which of your users get Prioritize, it will be available on a first-come/first-serve basis while we continue to roll out broadly.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/41836793-0a3d-4052-a07c-1d1f219290d7\" width=\"200\" height=\"\">\n</p><p>While we roll out Prioritize, there will be a limit to the number of users who can turn on the feature, at which point the ability to opt-in to the feature will become unavailable.\n</p><p>For more information, review <a href=\"https://aka.ms/olkprioritizehelp\" target=\"_blank\">Prioritize my email</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>There is nothing you need to prepare; this change will happen automatically. \n</p><p>For now, there is no control for you to assign specific users with a \"prioritize\" seat.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "411302"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook's \"Prioritize my Inbox\" by Microsoft 365 Copilot will roll out in April 2025 for new Outlook for Windows and web in English. Users with Microsoft 365 Copilot licenses can opt-in to prioritize emails. The feature is limited to the main inbox and will be available on a first-come, first-served basis. No preparation is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1020481",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-01T04:56:51.443Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-01T04:55:59Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Prioritize my Inbox by Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
