{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 25, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Users will be able to summarize files with <i>Summarize for me</i>&nbsp;using Microsoft Copilot within one-on-one or group Microsoft Teams chats. This feature will work on common file types like Word and PDF initially, and other file formats will be added over time.&nbsp;This summarization respects the file's security policies, ensuring that only users with access to the file receive a summary, which will carry the same sensitivity label as the original file. A Microsoft 365 Copilot license is required to use this feature.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=418564\" target=\"_blank\">418564</a>.</p><p>&nbsp;<b>When this will happen:</b>&nbsp;</p><p>Targeted Release: We will begin rolling out late July 2025 (previously early July) and expect to complete by mid-August 2025 (previously mid-July).</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2025 (previously late July) and expect to complete by early September 2025 (previously early August).</p><p>General Availability (GCC): We will begin rolling out mid-August 2025 (previously late July) and expect to complete by early September 2025 (previously early August).\n</p><p><b>How this will affect your organization:</b></p><p>Users will be able to summarize files with <i>Summarize for me</i>&nbsp;in Copilot within Teams chats. </p><p>This feature will be available by default.&nbsp;&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "418564"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot will enable file summarization in Teams chats for Word and PDF files, respecting security and sensitivity labels. Rollout starts late July 2025 for Targeted Release and mid-August 2025 for General Availability, requiring a Microsoft 365 Copilot license. No admin action needed; users should be informed."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-10-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1003344",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-25T18:51:08.39Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-11T23:57:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Copilot: File summary in Microsoft Teams chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
