{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 24, 2025: We have updated the content. Thank you for your patience.</p><p>We are rolling out enhanced agent discovery within the Copilot app via the Agent Store. This rollout allows all Copilot users to view and explore the catalog of agents available to them. This message applies to the Microsoft 365 Copilot app (desktop, web) and Copilot in Teams (Windows desktop, Mac desktop, and web).</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=486699\" target=\"_blank\">486699</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late May 2025 and expect to complete by early June 2025.\n</p><p><b>How this affects your organization:</b></p><p>Before this rollout:</p><ul><li>Copilot users could click \"Get agents\" via the right navigation pane to explore the catalog of Agents shown within the App Store in Microsoft 365 and Microsoft Teams. This experience was for users with and without a Microsoft 365 Copilot license.</li><li>The agents shown in the Store were based on existing Store settings for Teams and Microsoft 365 apps, that could be set by tenant admins. For more information, see Manage agents.</li></ul><p>After this rollout:</p><ul><li>Copilot users within the Microsoft 365 Copilot app can click on \"All agents\" from the left navigation pane to launch the new Agent Store experience natively within the Copilot app. This new Agent Store is an embedded, contextual experience tailored to surface agents, keeping users within Copilot and empowering them to discover, engage with, and re-discover the most relevant agents for them.\n</li><li>Within the Agent Store, users can find their set of installed agents under the \"Your agents\" section. They can also search for and explore various collections of agents available to be installed. These include recommended agents built by Microsoft, agents built by the user's organization, and the most popular agents within the user's organization, among others. Please note that the Built by Microsoft collection may also include agents which cannot be added (per admin policies) but are available for users' awareness and exploration.</li></ul><p>Copilot users within Microsoft Teams can launch the same Agent Store experience via the \"Get agents\" entry point on the right navigation pane.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Access to agents can be controlled and configured within the Microsoft 365 Admin Center:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in Integrated Apps</a></li></ul><p></p><p>Review the following resource to understand how to manage Microsoft 365 Copilot access within your organization:</p><ul><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-page\" target=\"_blank\">Manage Microsoft 365 Copilot scenarios in the Microsoft 365 admin center</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486699"
    },
    {
      "Name": "Summary",
      "Value": "Starting late May to early June 2025, Microsoft 365 Copilot will roll out an enhanced Agent Store for easier discovery and management of agents within the Copilot app and Teams. No admin action is needed, but admins can control agent access via the Microsoft 365 Admin Center."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060855",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-24T21:47:46.12Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:31:35Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Agent Store enhanced agent discovery",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
