{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 19, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>This feature allows admins to pin Copilot agents for users or groups or everyone within their tenant. This improves end-users' ability to discover new and popular agents, ensuring these agents are instantly accessible and contextually relevant to users' tasks. This enhances users' awareness of and engagement with available Copilot agents.&nbsp;</p><ul><li>Microsoft can pin up to 2 agents. Admin’s can view the Microsoft pre-pinned agents in MAC.</li><li>Admins can pin up to 3 agents.&nbsp;</li><li>Both Microsoft and Admin slots remain separate.&nbsp;</li><li>Irrespective of whether the user had acquired the agent before or not, the agent will be pinned.&nbsp;</li><li>Only 3 agents can be pinned per user, so order matters. Admins can drag and drop agents up and down to prioritize which agents appear first.&nbsp;</li><li>Users cannot unpin or unacquire Microsoft or Admin-pinned agents.&nbsp;</li></ul><p> <b>When this will happen:</b></p><p>Private Preview: We will begin rolling out in early August 2025 and complete by mid-August 2025.</p><p>General Availability (Worldwide): We will begin rolling out in late August 2025 (previously mid-August) and complete by early September 2025 (previously late August).</p><p> </p><p><b>How this will affect your organization:</b></p><p>Admins will have the capability to pin Copilot agents for users or groups, improving the discoverability and usage of these agents. This will help users find and engage with agents that are relevant to their tasks, thereby boosting productivity and engagement.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/88082c7e-c03e-4a7e-9ae0-4b4185803547/ef942604f5b99875ed423d111a724364972ce320.png\" style=\"width: 25%;\"><br><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/c0937af7-dbe5-487d-832b-69499ce8024e/6eafb184b0974c3173f0fd3805e0769fc69ab842.png\" style=\"width: 25%;\"></p><br><p><b>What you need to do to prepare:</b></p><p>Admins should familiarize themselves with the new pinning capabilities once they are launched and plan which agents to pin for different user/ groups. They should also monitor any feedback they get from users regarding pinned agents to optimize their deployment and ensure they meet the needs of their users&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins can pin up to 3 Copilot agents per user or group in Microsoft 365, improving agent discoverability and engagement. Microsoft can pin 2 separate agents. Users cannot unpin these agents. Rollout starts August 2025. Admins should plan and monitor pinned agents to optimize usage."
    }
  ],
  "EndDateTime": "2025-10-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066941",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-19T14:44:33.223Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-02T23:02:26Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot (Microsoft 365): Admins can use MAC to pin Agents for their entire tenant or specific users or groups.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
