{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 10, 2025: We have updated the timeline below. Thank you for your patience.</p><p>This feature allows admins to pin Copilot agents for users or groups or everyone within their tenant. This improves end-users' ability to discover new and popular agents, ensuring these agents are instantly accessible and contextually relevant to users' tasks. This enhances users' awareness of and engagement with available Copilot agents&nbsp; &nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in early July 2025 and complete mid-July 2025.</p><p><b>How this will affect your organization:</b></p><p>Admins will have the capability to pin Copilot agents for users or groups, improving the discoverability and usage of these agents. This will help users find and engage with agents that are relevant to their tasks, thereby boosting productivity and engagement&nbsp; &nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/406c506d-0317-4271-a13b-126f1406e0f5\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b></p><p>Admins should familiarize themselves with the new pinning capabilities once they are launched and plan which agents to pin for different user/ groups. They should also monitor any feedback they get from users regarding pinned agents to optimize their deployment and ensure they meet the needs of their users.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins can pin Copilot agents for their entire tenant or specific users/groups, enhancing discoverability and engagement. The rollout will occur from early to mid-July 2025. Admins should prepare by planning which agents to pin and monitoring user feedback to optimize deployment."
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066941",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-10T21:09:04.753Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-02T23:02:26Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot (Microsoft 365): Admins can use MAC to pin Agents for their entire tenant or specific users or groups.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
