{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 14, 2025: We have updated the timeline below. Thank you for your patience.</p><p>April 18, 2025:&nbsp; After further review we have decided not to proceed with GCC at this time. We also have updated the rollout timeline below. We apologize for any inconvenience</p><p>When creating a presentation in Copilot for Microsoft PowerPoint, users will be able to reference TXT files in addition to Microsoft Word files.</p><p>A Microsoft 365 Copilot license is required to use this feature.</p><p>This message applies to PowerPoint for Windows desktop, PowerPoint for Mac desktop, and PowerPoint on the web.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488795\" target=\"_blank\">488795</a>, Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488796\" target=\"_blank\">488796</a>, and Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488794\" target=\"_blank\">488794</a>.</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 (previously early May) and expect to complete by late May 2025 (previously mid-May).</p><p><b>How this will affect your organization:</b></p><p>After this rollout, users can see TXT files when searching for files that Copilot can use to create a presentation. Select the Copilot icon from the PowerPoint ribbon, choose <i>Create a presentation from <b>file</b>,</i> and search for TXT files by file name or paste the URL of your TXT file from Microsoft OneDrive or Microsoft SharePoint:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/092e8897-5571-4b67-9ad7-dfdcdbf58549\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/create-a-new-presentation-with-copilot-in-powerpoint-3222ee03-f5a4-4d27-8642-9c387ab4854d\" target=\"_blank\">Create a new presentation with Copilot in PowerPoint - Microsoft Support </a>(will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488794,488795,488796"
    },
    {
      "Name": "Summary",
      "Value": "Users will be able to reference TXT files when creating presentations with Microsoft 365 Copilot in PowerPoint. The rollout begins mid-May 2025 and completes by late May 2025. No admin action is required. This applies to PowerPoint for Windows, Mac, and the web. A Microsoft 365 Copilot license is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web, Mac, Desktop"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1056264",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-14T18:58:42.677Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-15T23:23:43Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft PowerPoint: Reference a TXT file when creating a presentation with Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
