{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 9, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft OneNote Copilot Chat is coming to OneNote for the web and OneNote in Teams. OneNote Copilot Chat is an intelligent assistant, transforming the way users interact with their notes. Users enter natural language prompts, and Copilot helps them understand, summarize, and rewrite notes for enhanced clarity and purpose.\n</p><p>A Microsoft 365 Copilot license is required to use this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=417005\" target=\"_blank\">417005</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out in early February 2025 and expect to complete rollout by late June 2025 (previously late March).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Copilot Chat for OneNote for the web and OneNote in Teams will be available automatically by default. No action is needed to enable this experience. Learn more: <a href=\"https://techcommunity.microsoft.com/blog/Microsoft365CopilotBlog/increase-your-productivity-with-copilot-on-onenote-web-and-onenote-in-teams/4374756\" target=\"_blank\">Increase Your Productivity with Copilot on OneNote Web and OneNote in Teams | Microsoft Community Hub</a>\n</p><p>If you prefer to disable Copilot Chat for your tenant, review these <a href=\"https://learn.microsoft.com/copilot/manage#removing-access-to--chat\" target=\"_blank\">instructions</a> in Manage Copilot | Microsoft Learn.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "417005"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft OneNote Copilot Chat will be available in OneNote for the web and OneNote in Teams starting February 2025, completing by late June 2025. It requires a Microsoft 365 Copilot license and will be enabled by default. No action is needed, but you may notify users and update documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1009928",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-09T20:48:41.473Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-19T00:42:14Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneNote Copilot Chat is coming to Microsoft OneNote for the web and Microsoft OneNote in Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
