{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 16, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>We're expanding the capabilities of the Researcher Agent by integrating it into Copilot Notebooks. This enhancement allows users to conduct complex, multi-step research across enterprise data sources—without leaving the Notebook experience—using OpenAI’s deep researcher model with chain-of-thought reasoning.</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=493288\" target=\"_blank\">493288</a>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout will begin in mid-September 2025 (previously early September) and is expected to complete by late October 2025 (previously late September).\n</p><p><b>How this affects your organization:</b></p><p>Users who currently have access to the Researcher Agent in Microsoft 365 Copilot Chat will now also be able to use it directly within Copilot Notebooks. This integration enables more seamless, in-context research workflows, especially for tasks that require iterative reasoning and synthesis across multiple data sources.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a9f73b82-29fa-4488-afb1-80be66465bfd\" width=\"400\" height=\"\"></p><p>This feature will be on by default for tenants with access to both Copilot Notebooks and the Researcher Agent.\n</p><p><b>What you can do to prepare:</b></p><p>No specific action is required at this time. This update builds on existing capabilities in Copilot Notebooks and the Researcher Agent. You may wish to inform users who rely on research-intensive workflows so they can take advantage of the enhanced experience.</p><p><b>Compliance considerations:</b></p><ul><li>Alters processing/storage/access of existing customer data?\tYes – Researcher Agent may access enterprise data sources for research tasks\n</li><li>Introduces or modifies AI/ML capabilities that interact with customer data?\tYes – Uses OpenAI’s researcher model with chain-of-thought reasoning</li><li>Provides new ways for users to interact with generative AI?\tYes – Enables generative research within Notebooks</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493288"
    },
    {
      "Name": "Summary",
      "Value": "The Researcher Agent is integrated into Copilot Notebooks, enabling complex, multi-step research across enterprise data using OpenAI’s model. Rollout starts mid-September 2025, completing by late October. The feature is on by default for eligible tenants, enhancing in-context research workflows without user action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1099685",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-16T15:23:53.14Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-20T22:14:52Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Researcher in Copilot Notebooks",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
