{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 29, 2025: The Researcher and Analyst agents (Frontier) will begin to rollout in phases in May 2025 for Microsoft 365 Copilot licensed users. For more information on Frontier and the Researcher and Analyst agents, please see Microsoft 365 Copilot Frontier features now becoming available.</p><p>The Researcher and Analyst agents (Frontier) are coming soon. For more information on Frontier and the Researcher and Analyst agents, please see <a href=\"https://techcommunity.microsoft.com/blog/Microsoft365CopilotBlog/microsoft-365-copilot-frontier-experiences-becoming-available/4406781\" target=\"_blank\">Microsoft 365 Copilot Frontier features now becoming available</a>.</p><p>Microsoft 365 Copilot-licensed users will soon be able to access two new deep reasoning agents. These agents will be English-only when they first become available. \n</p><ul><li><b>Researcher: </b>Combines OpenAI’s deep research model with Copilot’s advanced orchestration and deep search capabilities to help users tackle complex, multi-step research at work. It can simultaneously reason over work and web data, including third-party data via connectors or data pulled in from other agents, for its response.</li><li><b>Analyst: </b>Leverages OpenAI’s o3-mini reasoning model and is optimized to do advanced data analysis at work. Analyst uses chain-of-thought reasoning to progress through problems iteratively, taking as many steps as necessary to refine its reasoning and provide a high-quality answer that mirrors human analytical thinking. It can run Python to tackle complex data queries and users can view the code it's running in real time and check its work.</li></ul><p>Researcher and Analyst will start rolling out to users with a Microsoft 365 Copilot license in April as part of a new “Frontier” program that gives customers early access to new Copilot innovations while they are still in development. If timing changes, we will notify you.\n</p><p>Users must have a Microsoft 365 Copilot license to access Researcher and Analyst as part of the “Frontier” program. These agents will be available at no additional cost and will work with existing Copilot agent settings in the Copilot Control System.</p><p>Learn more about this announcement  <a href=\"https://aka.ms/reasoningagents\" target=\"_blank\">here</a>.</p><p><b>When this will happen:</b>\n</p><p>The Researcher and Analyst agents will begin rolling out in May 2025 (previously April).</p><p><b>How this will affect your organization:</b>\n</p><p>Once available, Researcher and Analyst will be visible to Microsoft 365 Copilot-licensed users in the “Built by Microsoft” section of the app store. Both agents will be labeled ending in “(Frontier)”. \n</p><p>Microsoft 365 Copilot-licensed users will be able to install and use these agents based on your existing Copilot agent settings through Integrated apps in the Microsoft 365 admin center.</p><p><b>What you need to do to prepare:</b>\n</p><p>Review how you manage Copilot agents in your environment using the existing controls through Integrated apps in the Microsoft 365 admin center. Learn more about these controls <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">here</a>.\n</p><p>If you’ve previously set <b>Allow the following users access to Copilot agents</b>&nbsp;to “No Users”, you will need to enable agents for “All Users” or “Specific Users” to allow access to Researcher and Analyst. You will also need to enable <b>Let users access Microsoft apps in your tenant</b>&nbsp;from the default settings or, alternatively, you will need to assign Researcher and Analyst to specific users or user groups so they have access to these specific agents if you are not enabling Microsoft apps by default.\n</p><p>You can manage Researcher and Analyst in your environment for specific users or groups using the same controls that work for any other app in the Microsoft 365 admin center. By default, agents are available for users to install.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will introduce two new agents, Researcher and Analyst, starting in May 2025 for licensed users. These agents will assist with complex research and data analysis tasks. Users must have a Microsoft 365 Copilot license and adjust settings in the admin center to access these agents."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041319",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-29T18:09:05.747Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T03:02:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: New Researcher and Analyst agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
