{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to connect Azure Databricks to Microsoft Power Platform to create canvas apps in Power Apps using Databricks data in a no-code way, and to use Azure Databricks as a knowledge source to ground your Copilot agents for intelligent, data-driven responses. This feature will reach general availability on July 19, 2025.<br><br>\n<b>How does this affect me? </b><br>\nThe new Databricks Connector that links Azure Databricks to Power Platform provides users:<ul>\n<li><b>Canvas app integration: </b>Build apps in Power Apps with real-time Azure Databricks data to ensure current and accurate information. Interact with your data through natural language, backed by Databricks’ powerful processing engine.</li>\n<li><b>Real-time CRUD Support: </b>Enable seamless CRUD (create, read, update, delete) operations on Azure Databricks data directly within Power Apps.</li>\n<li><b>Knowledge Source for Copilot Agents: </b>Add Azure Databricks datasets and tables that can be curated by developers and analysts as a Knowledge Source, enabling Copilot Agents to answer natural language queries using structured Databricks data. </li>\n<li><b>Low-code availability: </b> A scalable, real-time integration point between Databricks and Microsoft’s low-code ecosystem, accelerating insights and reducing operational overhead. </li></ul>\n<b>What action do I need to take? </b><br>\nThis message is for awareness and no action is required.<br><br>\nThe Azure Databricks connector is currently in preview. To start using Azure Databricks as a Knowledge Source before general availability: <ol>\n<li>Connect your Databricks workspace to Power Platform using the <b>Azure Databricks Connector</b>.</li>\n<li>Add your Databricks tables as <b>Knowledge Sources</b> in Copilot Studio.</li>\n<li>Configure and test your Copilot Agent to respond to natural language queries grounded in Databricks data.</li></ol>\nIf you would like more information on this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/11072/connectors/databricks\">Azure Databricks - Connectors</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-07-20T00:01:46Z",
  "HasAttachments": false,
  "Id": "MC1098956",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-20T00:03:32.1Z",
  "Services": [
    "Microsoft Dataverse"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-20T00:01:46Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Dataverse - Build Agents with Azure Databricks as your knowledge source",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
