{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 29, 2025: We have updated the timeline. Thank you for your patience.</p><p>We’re expanding access to Copilot Notebooks—your AI-powered workspace—by bringing it to the Microsoft 365 mobile apps on iOS and Android, including iPad. This update enables users to stay productive on the go by accessing and interacting with their existing Copilot Notebooks directly from their mobile devices.\n</p><p>Copilot Notebooks help users organize and focus their work by bringing together Copilot chats, files, pages, meeting notes, links, and more in one place. As users collaborate with Copilot, they receive contextual responses based on the content in their notebook, which updates in real time as the project evolves.\n</p><p>This rollout includes the following capabilities in the Microsoft 365 mobile apps:\n</p><ul><li>Open existing Copilot Notebooks created on the web version of Microsoft 365.\n</li><li>Create new Copilot chats within existing notebooks.\n</li><li>Open Copilot Pages and references stored in existing notebooks.\n</li></ul><p>Note: The ability to create a new Copilot Notebook directly from the mobile apps will be available in an upcoming release.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout will begin in mid-June 2025 and is expected to complete by mid-August 2025 (previously mid-July).\n</p><p>Rollout to government clouds will occur at a later date.\n</p><p><b>How this will affect your organization:</b></p><p>This update enhances mobile productivity for users with Microsoft 365 Copilot licenses by enabling access to Copilot Notebooks on iOS and Android. Users can continue their work seamlessly across devices, leveraging AI-powered insights and references wherever they are.\n</p><p>This feature is included with the Microsoft 365 Copilot license and is enabled by default.\n</p><p><b>What you can do to prepare:</b></p><p>No admin action is required. You may wish to inform your users about the new mobile capabilities and encourage them to explore Copilot Notebooks on their mobile devices.\n</p><p>Learn more about Copilot Notebooks: <b>Insert Microsoft Learn or support link if available</b></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Copilot Notebooks will soon be available on Microsoft 365 mobile apps for iOS and Android, allowing users to access and interact with existing notebooks, create new Copilot chats, and open pages. Rollout starts mid-June 2025, enhancing mobile productivity for Copilot license holders."
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1099689",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-29T15:06:32.62Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-20T22:16:01Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Copilot Notebooks coming soon in Microsoft 365 mobile apps (iOS and Android)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
