{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This message is associated with MC1060846 <i>(Highlight) New Service Plan: People Skills - Advanced</i> (published April 23, 2025).&nbsp;</p><p>People Skills is an intelligent data layer that infers skills from user activity mapped to a customizable built-in skill taxonomy, enhancing Copilot Chat, Microsoft 365, and Microsoft Viva experiences with contextualized information about the people in your organization. Read more: <a href=\"https://techcommunity.microsoft.com/blog/microsoft365copilotblog/announcing-people-skills-general-availability-and-new-skills-agent/4406364\" target=\"_blank\">Announcing People Skills general availability and new Skills agent | Microsoft Community Hub</a></p><p>Customers with Microsoft 365 Copilot and the “Microsoft 365 Copilot in Productivity Apps service plan,” excluding faculty and student SKUs, will see People Skills available to set up in Microsoft 365 admin center by mid-June 2025.</p><p>This message applies to Microsoft 365 Copilot for Windows desktop and for the web as well as the other Windows desktop and web platforms where People Skills appears in profile cards, People Companion, and other Microsoft 365 apps.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485726\" target=\"_blank\">485726</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Available now.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, the People Skills experience will include&nbsp;these capabilities:</p><ul><li>An AI-generated, personalized skill profile for Microsoft 365 Copilot users to help make it easy to share skills in the organization and keep skill data fresh\n</li><li>A built-in skills library, ready to use out-of-the-box or customize as needed \n</li><li>Skills-driven experiences in Microsoft 365 Copilot, Microsoft 365 profile card and profile editor, Org Explorer, and People Companion.\n</li><li>Skills-based learning experience in Viva Learning\n</li></ul><p>Starting mid-June 2025, People Skills will also include these capabilities:</p><ul><li>Skills landscape reports for leaders and analysts, accessible from the advanced insights app in Viva Insights.\n</li><li>Skills agent for employees and leaders: The Skills agent enables employees to easily find the right colleague for a given need, understand colleagues’ skillsets, and make informed decisions about skill development. Leaders can use the Skills agent to access skills analytics for their organization to support staffing and upskilling initiatives. The agent will be available in the Microsoft 365 Copilot chat Agent Store.</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. People Skills data will only be shown in applicable Microsoft 365 surfaces and Microsoft 365 Copilot after you have set it up in the Microsoft 365 admin center. You may want to notify your users about this change and update your relevant documentation.</p><p>We recommend the \"quick setup” of People Skills, which includes the out-of-the-box skills library of over 16,000 skills. Organizations also have the option to curate their own library by importing custom skills. View setup documentation: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-overview\" target=\"_blank\">Overview of People Skills | Microsoft Learn</a></p><ol><li>From the Copilot page in the <a href=\"https://admin.microsoft.com/adminportal/home\" target=\"_blank\">Microsoft 365 admin center</a>, select <i>People Skills in Microsoft 365 Copilot.</i></li><li>You’ll be redirected to the page in the Microsoft 365 admin center to complete setup.</li><li>Select <i>Begin quick setup.</i></li></ol><p><i>Notes</i></p><ul><li>You may add or remove skills later after setting up People Skills.</li><li>If your organization has a dependency on the skills field in User Profile Application (UPA)\\SharePoint profile, those skills will no longer appear on the Microsoft 365 profile card or profile editor after you deploy People Skills. The skills will remain accessible and will be available in other experiences. Learn more: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-overview\" target=\"_blank\">Overview of People Skills | Microsoft Learn</a></li><li>A few days after your organization launches People Skills, users will see a personalized list of skills on their profile cards. Both skills that users confirm and those provided by AI will be visible by default on their profile card. Skills added by AI will be identified as skills a user might have.*\n</li></ul><p><i>Privacy and visibility controls:</i> Both admins and users have control over their skills inference setting and skill profile visibility. You can use our visibility and sharing controls to selectively pilot People Skills to small groups in your organization and set default AI inferencing settings to comply with Works Council or business requirements. Learn more: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-sharing-inferencing-controls\" target=\"_blank\">Manage privacy and sharing controls in People Skills | Microsoft Learn</a></p><p><i>Adoption guides:</i>&nbsp;Adoption resources for People Skills are available on the <a href=\"https://adoption.microsoft.com/ai-agents/people-skills/\" target=\"_blank\">People Skills adoption site</a>.</p><p><i>*Known issues:&nbsp;</i>Skills added by AI will be shown in a user's own Skills profile but will not be visible to others in Copilot searches or other Microsoft 365 experiences. We expect this issue to be resolved and for AI-inferred skills to appear along with confirmed skills by mid-June 2025.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485726"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot: People Skills is now generally available, enhancing user experience with AI-generated skill profiles, a customizable skills library, and skills-driven features across Microsoft 365 apps. The rollout requires no admin action and will be completed by mid-June 2025. Organizations can notify users and update documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-10-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1088724",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-05T23:39:04.407Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-05T23:37:54Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: People Skills is generally available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
