{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 5, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>We’re expanding the Microsoft 365 Copilot mobile experience by introducing the agent store on mobile. After this rollout, users will be able to directly acquire agents from the Agent Store in the Copilot mobile apps for iOS and Android—without needing to be dependent on the web or desktop versions for this acquisition. This update builds on our May 2025 release, which brought previously installed agents to the Copilot apps for iOS and Android.</p><p>A Microsoft 365 Copilot license is required to use this feature.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 (previously late June) and expect to complete by mid-August 2025 (previously late July).\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, users can select the G<i>et agents </i>button or select an agent link shared in Microsoft Teams for iOS/Android or Microsoft Outlook for iOS/Android to install a new agent in the Copilot app. Some agents may appear with a <i>Coming soon</i> label in the install list. These will become available in future versions of the Copilot mobile app.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/20a95a23-3705-4048-a9bc-65a8303e3cd4\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be available by default.</p><p>Agents installed on the Copilot app for iOS/Android will be also available to use in Copilot for the web and Copilot for Windows desktop. </p><p>As with the Agent Store on Copilot for Windows desktop and web, the Agent Store on mobile will respect admin policies—only agents allowed by admins will be visible.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update your relevant documentation.</p><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Existing admin controls</a> in <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide&amp;context=%2Fmicrosoft-365-copilot%2Fextensibility%2Fcontext#enable-or-disable-copilot-extensibility\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a></li><li><a href=\"https://support.microsoft.com/topic/get-started-with-agents-in-microsoft-365-copilot-943e563d-602d-40fa-bdd1-dbc83f582466\" target=\"_blank\">Get started with agents in Microsoft 365 Copilot - Microsoft Support</a></li></ul><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot mobile apps for iOS and Android will gain an Agent Store by mid-August 2025, allowing users to acquire agents directly on mobile. Installed agents sync across web and desktop. Admin policies control agent visibility. No admin action is needed before rollout."
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1092429",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-05T21:33:24.8Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-11T22:53:23Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot app for iOS and Android: Agent Store will be available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
