{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The AI adoption category page in Adoption Score helps adoption specialists measure progress towards making Microsoft 365 Copilot a daily habit. We are changing the name of this page to AI adoption, and the corresponding score to AI adoption score. We’re updating the page with new Microsoft 365 Copilot usage metrics and organizational messages, and we’re adding AI adoption score to the total Adoption Score.</p><p>\n</p><p>Note: The option to opt out specific user groups from being included in People Experience insights does not currently apply to metrics in the AI adoption category page. Learn more about Adoption Score settings here: <a href=\"https://learn.microsoft.com/microsoft-365/admin/adoption/privacy?view=o365-worldwide\" target=\"_blank\">Privacy controls for Adoption Score</a>.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=185700\" target=\"_blank\">185700</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-April 2025 and expect to complete by the end of April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>The updated AI Adoption score introduces:</p><ul><li>The AI assistance score is renamed as AI adoption score.\n</li><li>AI adoption score is now added to the total adoption score. The overall adoption score increased. If your tenant doesn’t have any Microsoft 365 Copilot licenses, then the maximum total score is unchanged (700) and the peer benchmark is unchanged (sum of all category reports except AI adoption score).\n</li><li>Organizational messages: Admins with organizational message writer roles or global admins can now schedule in-product messages via new Teams or Windows 11 to prompt inactive Copilot-licensed end users to try out Copilot features.\n</li><li>New Copilot feature level insights: The revised score takes into account a much wider range of Microsoft 365 Copilot features compared to V2, including usage of Microsoft 365 Copilot Chat (web), all Microsoft 365 Copilot capabilities across Teams, Outlook, and Office apps, and usage of declarative agents.</li></ul><p>These insights provide you with a more comprehensive view of Copilot engagement, helping you measure and drive adoption.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/966281fc-dbc2-4415-8a9a-0cb417fb31b6\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>Admins that use Adoption Score may see their overall Adoption Score increase, and will have access to new metrics and organizational messages within the AI adoption score category.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "185700"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1056262",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-23T22:58:28.767Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-15T23:23:19Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "AI adoption category in Adoption Score now generally available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
