{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 24, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Coming Soon:  In Microsoft PowerPoint when creating a presentation using Microsoft Copilot from an existing presentation, it will create the new presentation in a new file without affecting the original presentation.&nbsp;</p><p>A Microsoft 365 license is required to access this Copilot feature. &nbsp;</p><p>This message refers to PowerPoint for Windows desktop and Web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=489450\" target=\"_blank\">489450</a>&nbsp;(Desktop), <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=489451\" target=\"_blank\">489451</a> (Mac),&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=489452\" target=\"_blank\">489452</a>&nbsp;(Web)</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out to Desktop in early May 2025 and expect to complete by mid-June 2025 (previously late May).</p><p>General Availability (Worldwide): We will begin rolling out to Mac in late May 2025 (previously mid-May) and expect to complete by mid-June 2025 (previously early June)</p><p>General Availability (Worldwide): We will begin rolling out to Web in mid-June 2025 (previously late May) and expect to complete by late July 2025 (previously late June).</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout in Microsoft PowerPoint, when using Copilot to create a presentation from an existing one, the original presentation remains unchanged. Copilot generates the new presentation in a separate file, preserving the integrity of the content in the original file<br></p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate. These features are available to users with a Copilot license.</p><p>Review the following resource to understand how to manage Microsoft 365 Copilot access within your organization:</p><ul><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-page\" target=\"_blank\">Manage Microsoft 365 Copilot scenarios in the Microsoft 365 admin center</a></li></ul><p>You can manage Copilot for specific apps or users through either the Microsoft 365 Admin center or Group Policy.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489450,489452,489451"
    },
    {
      "Name": "Summary",
      "Value": "PowerPoint Copilot will create new presentations in separate files when starting from existing ones, preserving originals. Rollout begins May-July 2025 for Desktop, Mac, and Web. A Microsoft 365 Copilot license is required. Organizations should update training and manage access via the Microsoft 365 admin center."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web, Mac"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060857",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-24T21:40:45.68Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:34:08Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "PowerPoint: Copilot generates a new presentation in a new file when starting from an existing presentation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
