{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 4, 2025: We have updated the content below to provide additional information. Thank you for your feedback.</p><p>We’re excited to announce the general availability (GA) of the Analyst and Researcher agents. As shared in MC1041319, the Analyst and Researcher agents began rolling out in May 2025 to Microsoft 365 Copilot-licensed users under the Frontier program.\n</p><p><u>What's New:</u></p><p>Starting May 30, 2025, the Analyst and Researcher agents will be generally available for Microsoft 365 Copilot licensed users as part of the Copilot experience.\n</p><ul><li><i>Researcher:</i> Combines OpenAI’s deep research model with Copilot’s advanced orchestration and deep search capabilities to help users tackle complex, multi-step research at work. It can simultaneously reason over work and web data, including third-party data via connectors or data pulled in from other agents, for its response.\n</li><li><i>Analyst:</i> Leverages OpenAI’s o3-mini reasoning model and is optimized to do advanced data analysis at work. Analyst uses chain-of-thought reasoning to progress through problems iteratively, taking as many steps as necessary to refine its reasoning and provide a high-quality answer that mirrors human analytical thinking. It can run Python to tackle complex data queries, and users can view the code it's running in real time and check its work.\n</li></ul><p>&nbsp;<u>What’s changing:\n</u></p><ul><li>The Analyst and Researcher agents will transition out of the Frontier preview program and become generally available globally.\n</li><li>They will appear at the top of the agent list in Microsoft 365 chat for Copilot-licensed users.</li><li>Researcher will initially be available in 37 languages, while Analyst will support 8.\n</li><li>These agents can be managed via the Microsoft 365 admin center, refer to <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#block-or-unblock-agentsG%2Bxlh%2BQ%3D&amp;reserved=0\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a>. To Block Researcher or Analyst for everyone in your organizations see <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#block-or-unblock-agents\" target=\"_blank\">Block or Unblock Agents</a>.</li></ul><p><b>When this will happen:</b>\n</p><p>General availability (Worldwide): We will begin rolling out Friday, May 30, 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><ul><li>The Analyst and Researcher agents without the Frontier label/notation will appear in the Agent Store under ‘Built by Microsoft’ located within the ‘All agents’ and ‘Get agents’ landing page across the Microsoft 365 Copilot app, Teams, and Outlook entry points for Copilot Chat. \n<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1a566d5c-6b6f-4f03-b3d7-0c42d378159e\" width=\"400\" height=\"\"></p></li><li>For users with a Microsoft 365 Copilot licensed assigned, Researcher and Analyst agents will be easily accessible.<p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/07d7668d-c476-4c78-8ab3-a5209ea0d1ee/ab097470ee41c4b0453dfebe53180711e1331acb.png\n\" width=\"400\" height=\"\"></p>\n</li><li>Users without Microsoft 365 Copilot licenses will not be able to access these agents.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><ul><li>No additional admin action is required.\n</li><li>For managing these agents via Microsoft 365 admin center, refer to <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#block-or-unblock-agents\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a>.\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Analyst and Researcher agents for Microsoft 365 Copilot-licensed users will be generally available starting May 30, 2025. These agents offer advanced research and data analysis capabilities. They will be accessible globally, managed via the Microsoft 365 admin center, and available in multiple languages. No additional admin action is required."
    }
  ],
  "EndDateTime": "2025-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1085251",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-04T22:12:12.427Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-30T06:35:53Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Researcher and Analyst moving to General Availability",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
