{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Brainstorm out loud and let your ideas flow freely. Copilot helps you go from voice notes to structured documents. In Word Copilot on iOS you&nbsp;can&nbsp;speak&nbsp;your ideas&nbsp;aloud&nbsp;and&nbsp;choose how you want to structure&nbsp;them&nbsp;into a document format.&nbsp;</p><p> Open the Word app on your iPhone. Select the New (+) button, and then select the Use Copilot link below the Search box.&nbsp;&nbsp;</p><p> Choose your preferred language, then choose a format from three pre-set modes: </p><ul><li>Document (a document with sections and headings)</li><li>Notes (a document with paragraphs)</li><li>Email (a document with an email body and sign-off).&nbsp;&nbsp;</li></ul><p> NOTE: You can also create a custom format by selecting the Create New Mode button, giving the new mode a name, and then providing a prompt description of the format you’d like Copilot to follow. You can change your language and format at any time while recording or after you’ve finished recording.</p><p> Tap the microphone button to begin recording. When you’ve finished recording, select Done in the lower right-hand corner to have Copilot generate a document based on your voice note and pre-set preferences.</p>  Select whether you want to keep what Copilot has generated, edit the content or structure, regenerate new content, copy the transcription, or delete the content.   <br> <p></p><p></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout has begun and expected to complete by early December 2025.</p><p><b>How this will affect your organization:</b></p><p></p><p>  If you’ve typed out or formatted documents on your iPhone before, you know how difficult it can be to get the details right; your thoughts are either running faster than your fingers are typing, or the small screen size is making even the simplest tasks feel complex.</p><p>This support now simplifies the document generation process with voice and Copilot to make it easier than ever to get your thoughts into a polished format.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This feature is available to Word for iOS users with a Copilot license (get more details on licenses for <a href=\"https://www.microsoft.com/microsoft-365/business/copilot-for-microsoft-365\">businesses</a>) running Version 2.96 (Build 25041112) or later in the following languages and locales:</p><table><tbody><tr><td>Language</td><td>Locale(s)</td></tr><tr><td>English</td><td>US, UK, AU, IN, CA</td></tr><tr><td>Spanish</td><td>ES, MX</td></tr><tr><td>French</td><td>CA, FR   </td></tr><tr><td>Portuguese</td><td>BR</td></tr><tr><td>Chinese</td><td>CN</td></tr><tr><td>German</td><td>DEU</td></tr><tr><td>Italian</td><td>IT</td></tr><tr><td><p>Japanese</p></td><td>JA</td></tr></tbody></table><p><br></p><p>The ability to turn voice notes into documents will be coming in more languages and locales soon!</p><p>You can manage Copilot for specific apps or users through either the Microsoft 365 Admin center or Group Policy.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Turn voice notes into documents with Copilot in Word for iOS. Open the Word app, select New (+), and Use Copilot. Choose a language and format, record your voice note, and Copilot generates a document. Available for users with a Copilot license running Version 2.96 (Build 25041112) or later."
    }
  ],
  "EndDateTime": "2026-02-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060866",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T16:46:34.007Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:45:42Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Turn voice notes into documents with Copilot in Word for iOS",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
