{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 27, 2025: We have updated the content and rollout timeline below. Thank you for your patience.\n</p><p>Coming soon for Microsoft PowerPoint: Users will be able to create presentations with Microsoft 365 Copilot in PowerPoint with your organization's brand images in two ways:</p><ul><li>With an organizational asset library (OAL) in Microsoft SharePoint\n</li><li>With a Templafy library (a third-party solution)\n</li></ul><p><b>NOTE:</b> You can choose either option, both options, or neither option. The current image default option in PowerPoint is Microsoft 365 images. If you take no action, your users will continue to have access to these Microsoft 365 images.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=475055\" target=\"_blank\">475055</a> and Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=475064\" target=\"_blank\">475064</a>.\n</p><p>A Microsoft 365 Copilot license is required to use this feature.\n</p><p>This message applies to PowerPoint for Windows desktop, PowerPoint for Mac desktop, and PowerPoint for the web.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 (previously March) and expect to complete by early July 2025 (previously late June).</p><p><b>How this will affect your organization:</b>\n</p><p><i>Connecting your OAL to Microsoft 365 Copilot in PowerPoint:</i>\n</p><p>After this rollout: As an admin, after you connect your OAL, hosted on SharePoint, to Microsoft 365 and Microsoft 365 Copilot, your users will be able to create presentations with your organization's images. Users will have the option to use branded images from your OAL and/or Microsoft 365 images.</p><p>To use your OAL with Microsoft 365 Copilot, you will need to:\n</p><ol><li><a href=\"https://learn.microsoft.com/sharepoint/organization-assets-library\" target=\"_blank\">Create an organization assets library</a> for your company's brand assets\n</li><li>Run a Microsoft PowerShell command to <a href=\"https://learn.microsoft.com/sharepoint/connect-organizational-asset-libraries-to-copilot\" target=\"_blank\">connect your image OAL to Copilot</a>.</li><li>Make sure the images in your asset library have robust metadata (keywords, title, and alt-text) so they are searchable</li></ol><p><i>Connecting Templafy to Microsoft 365 Copilot in PowerPoint:</i>\n</p><p>After this rollout: As an admin, after you connect your asset library hosted by Templafy to Microsoft 365 and Microsoft 365 Copilot, your users will be able to create presentations with your organization's images.\n</p><p>Users will have the option to use branded images from your organization's library in Templafy and/or Microsoft 365 images.</p><p>To use your brand images with Microsoft 365 Copilot, you will need to:\n</p><ol><li>Have a Templafy account for your company's brand assets</li><li>Enable Microsoft Graph Connector to establish the Copilot connection in your company's Templafy account setting. Learn more: <a href=\"https://support.templafy.com/hc/articles/24656260075549-How-to-enable-Microsoft-Graph-Connector-for-Templafy-Image-Library\" target=\"_blank\">How to enable Microsoft Graph Connector for Templafy Image Library – Templafy Help center</a>\n</li><li>Make sure the images in your asset library have robust metadata (keywords, title, and alt-text) so they are searchable\n</li></ol><p>To use brand images in PowerPoint, users can select the Copilot icon in the top left of any slide and choose <i>Create a new presentation:</i>\n</p><p>&nbsp; &nbsp; &nbsp; &nbsp;<img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c5eceb49-3a13-47ed-b2ea-bcb52c0f07a6\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>On the next screen, users enter a prompt to ask Copilot to build the slide outline. After Copilot responds, users can scroll down to the Image settings. Users can pick if they want Copilot to use branded images from their organization's library and/or Microsoft 365 images\".</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/bf871a1e-b8a1-4b49-934d-1c2b12035175/96b7dcd2e59d2d4cf95ea04d2914caeb4ac709ed.png\" style=\"width: 500px;\"><br></p><p>The new features will be available by default for admins to configure for their users. With this rollout, Copilot will first use images from your organization library before using Microsoft 365 images as backup. Users have the option to use only on-brand images by turning on the image settings. However, if you do not wish for Copilot to use any Microsoft 365 images when creating a presentation, send an email to <a href=\"mailto://pptentimg_admin@microsoft.com\" target=\"_blank\">pptentimg_admin@microsoft.com</a>. <b>NOTE:</b> Disabling all Microsoft 365 images will severely impact the Copilot output for creating presentations. We recommend considering this option only if you have more than 1,000 images with robust metadata in your image library.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://support.microsoft.com/topic/keep-your-presentation-on-brand-with-copilot-046c23d5-012e-49e0-8579-fe49302959fc\" target=\"_blank\">Keep your presentation on-brand with Copilot - Microsoft Support</a>\n<a href=\"https://learn.microsoft.com/sharepoint/connect-organizational-asset-libraries-to-copilot\" target=\"_blank\"></a> (will be updated before rollout begins)\n</li><li><a href=\"https://learn.microsoft.com/sharepoint/connect-organizational-asset-libraries-to-copilot\" target=\"_blank\">Connect organizational asset libraries to Copilot for an on-brand experience - SharePoint in Microsoft 365 | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/en-us/sharepoint/organization-assets-library\" target=\"_blank\">Create an organization assets library - SharePoint in Microsoft 365 | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "475055,475064"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft PowerPoint will soon allow users to create presentations with Microsoft 365 Copilot using their organization's brand images via an organizational asset library (OAL) in SharePoint or a Templafy library. Rollout starts in early June 2025 and completes by late July 2025. Admins need to configure these libraries for users."
    },
    {
      "Name": "Platforms",
      "Value": "Web, Mac"
    }
  ],
  "EndDateTime": "2025-09-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024405",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-27T16:06:02.7Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:58:54Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft PowerPoint: Stay on-brand when creating a presentation with Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
