{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 18, 2025: We have updated the timeline. Thank you for your patience.</p><p>A new feature in the Project Manager agent that automates the creation of status reports for your plans. This capability streamlines the process to generate, view, modify, and share status reports based on project progress. The concise, accurate, and professional report is summarized based on your plan's progress, key milestones, and upcoming tasks. With this feature, you can ensure stakeholders stay informed effortlessly, saving time while maintaining transparency and alignment across your projects.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=474452\" target=\"_blank\">474452</a></p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide): We will begin rolling out late April 2025 and expect to complete by mid-May 2025.</p><p>General Availability (Worldwide): We will begin rolling out on late August 2025 (previously late June) and expect to complete by late September 2025 (previously late August).</p><p><b>How this will affect your organization:</b></p><p>Users with <span>an </span><span>appropriate license will be able to access the Status Report feature within their shared premium plans. Within the Reports tab, users can generate reports based on their defined parameters, view and delete past reports, and share their reports to a larger forum.</span></p><p><b>What you need to do to prepare:</b></p><p>Admins do not need to take action to enable the feature as it will be automatically available after rollout.</p><p>The Status Report feature will begin rolling out before a control in the admin portal to disable Project Manager is available. If you would like to disable Project Manager before the admin control is available, open a support request with Planner support and we can disable it on your behalf temporarily until the self-service option is available.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "474452"
    },
    {
      "Name": "Summary",
      "Value": "A new Project Manager agent feature in Planner automates status report creation, streamlining the process for generating, viewing, modifying, and sharing reports. Public preview starts late April 2025, with general availability by late August 2025. Admins need not take action; the feature will be auto-enabled."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060865",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-18T19:21:19.363Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:43:10Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Status Report with Project Manager Agent in Planner",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
