{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>You are receiving this message because your Microsoft 365 tenant’s billing address indicates that your tenant belongs to the EU, but your Teams Q&amp;A data currently resides in the US data boundary. Teams Q&amp;A is an experience in Teams, powered by Viva Engage, that allows presenters to take questions from meeting attendees and answer them in real time. Learn about Q&amp;A here <a href=\"http://aka.ms/GetQnA\" target=\"_blank\">aka.ms/GetQnA</a>&nbsp;</p><p>On July 11, 2025, at 10:00 PM Central European Time, your Teams Q&amp;A data will be relocated from datacenters in the US to datacenters in the EU as a part of a planned maintenance that is expected to last approximately 4 hours.</p><p>Starting July 11, 2025</p><p>Ending July 12, 2025</p><p><b>How this will affect you organization:</b></p><p>The relocation process will move your Q&amp;A data from the US to the EU data boundary.</p><p>During of the relocation process, users will:</p><p>Be able to view the Q&amp;A from prior meetings, but not be able to post new questions, edit or react to messages.</p><p>Meeting organizers will temporarily be unable to enable Q&amp;A for new Teams meetings directly from the Meeting Options. If they attempt to do so, the Q&amp;A panel will display a message stating, \"Q&amp;A is not successfully enabled for this event. Turn it on from Meeting Options.\" To resolve this, organizers should re-enable Q&amp;A from the Meeting Options once the relocation window is complete.</p><p>The read-only mode is expected to last for about 4 hours, after which, Q&amp;A will be reinstated.</p><p><b>What you need to do to prepare:</b></p><p>Please inform your users that there is a planned maintenance that will keep Q&amp;A in read-only for 4 hours on July 11, 2025, starting at 10:00 PM Central European Time.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "On July 11, 2025, at 10:00 PM CET, Teams Q&A data will be relocated from the US to the EU. The process will last about 4 hours, during which Q&A will be in read-only mode. Users can view but not post or edit questions. Inform users about this planned maintenance."
    }
  ],
  "EndDateTime": "2025-08-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1111169",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-07T23:52:16.73Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-07T23:51:50Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Planned Maintenance: Teams Q&A Data Relocation to EU",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
