{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>“<b>Hey Copilot” to start voice in Copilot on Windows devices</b></p><p><b><b>Introduction</b></b></p><p>Starting late November 2025, we’re introducing a new hands-free way to activate voice in <i>Microsoft 365 Copilot on Windows devices</i>. Users will be able to start a voice chat with Copilot by saying “Hey Copilot”. To end the conversation, users need to press the <i><b>“Dismiss/X” </b></i>button in the voice chat controls. In the future, users will be able to end the chat with a voice command. This allows users to stay in the flow of work, without switching apps or windows, while getting assistance from Copilot using voice. \n</p><p><b>Important</b>: The “Hey Copilot” feature is off by default.\n</p><p>Users can manually enable the feature by going to <b><i>Settings &gt; Quick view</i></b> in the&nbsp;<i>Microsoft 365 Copilot app</i> and turning on the<i><b> Listen for “Hey Copilot\" </b></i>toggle. When on, this capability operates locally on the device and only activates by “hearing” the trigger word “Hey Copilot” without recording or storing any conversation. Text transcripts from voice conversations with Copilot are stored and managed in the same way as text conversations in the <i>Microsoft 365 Copilot app</i>. No user or Copilot audio is stored. For more information about data retention for Copilot, see <a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-privacy\" target=\"_blank\">Data, Privacy, and Security for Microsoft 365 Copilot</a>.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497848\" target=\"_blank\">497848</a>.\n</p><p><b><b>When this will happen</b>\n</b></p><p><b>Preview (Frontier):</b> Begins rolling out at the <b>end of November 2025</b>.</p><p><b>General Availability (Worldwide): </b>Begins rolling out in late <b>December 2025</b> and expected to be generally available by <b>late January 2026.</b></p><p><b><b>How this will affect your organization</b></b></p><ul><li>Users will be able to start a voice conversation with Copilot hands free, saying “Hey Copilot” once turned on. \n</li><li>The “Hey Copilot” feature is off by default and must be turned on by users in <i>Copilot settings</i>.</li><li>When on, this capability operates locally on the device and only activates by “hearing” the trigger word “Hey Copilot” without recording or storing any conversation.</li><li>There is no admin control to disable this feature by an admin at a tenant or group level.</li><li>Voice in<i> Microsoft 365 Copilot</i> is currently available only for Copilot licensed users and this feature will be available only to those same users.\n</li><li>Activation respects organizational compliance boundaries and only responds when explicitly called.\n</li><li>To mute or end the conversation, the user must click to<b><i> “Mute”</i></b> or <i><b>“Dismiss” </b></i>as needed. At that point, Copilot stops listening. Copilot will end the session after  60 seconds of inactivity, giving users a notice after the first 30 seconds.&nbsp;</li><li>The feature will not activate if audio from another app is on or when the user’s device is locked.\n</li><li>This feature is supported in English only, but once activated, users can have conversation in any language Copilot that supports.\n</li></ul><p><b><b>What you need to do to prepare</b>\n</b></p><p>This feature will roll out default off but users will be prompted in product to try this feature by turning it on in the <i>Copilot settings</i>.\n</p><p>To enable, users need to go to Microsoft 365 Copilot app on Windows devices and enable it in settings and ensure that microphone permissions and device settings are compatible with voice activation</p><ul><li>Review how privacy and security of organizational data is protected when using this feature:<a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-privacy\" target=\"_blank\">&nbsp;Data, Privacy, and Security for Microsoft 365 Copilot</a>\n</li><li>Communicate the availability and benefits of this feature to your users.\n</li><li>Remind users to ensure that microphone permissions and device settings are compatible with voice activation.</li></ul><p><b><b>Learn more</b></b></p><p><a href=\"https://support.microsoft.com/topic/how-hey-copilot-voice-chat-wake-word-works-in-microsoft-365-copilot-a0bf9f39-6dab-47ae-9054-2d919753293e\" target=\"_blank\">How \"Hey Copilot\" voice chat wake word works in Microsoft 365 Copilot - Microsoft Support</a></p><p><a href=\"https://support.microsoft.com/topic/frequently-asked-questions-about-voice-features-in-microsoft-365-copilot-54f83fd3-ea7c-41f5-9502-07ed73fe4c64\" target=\"_blank\">Frequently asked questions about voice features in Microsoft 365 Copilot</a></p><p><a href=\"https://support.microsoft.com/topic/get-started-with-voice-features-in-microsoft-365-copilot-9262968d-565e-470c-a04b-991eb8e0d1ea\" target=\"_blank\">Get started with voice features in Microsoft 365 Copilot</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497848"
    },
    {
      "Name": "Summary",
      "Value": "Starting late November 2025, Microsoft 365 Copilot on Windows will support hands-free voice activation by saying “Hey Copilot,” off by default and enabled in settings. It operates locally without recording audio, supports English activation, and requires manual muting or dismissal to end conversations."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1189003",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-22T00:37:47.933Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-22T00:37:10Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: “Hey Copilot” to start voice in Copilot on Windows devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
