{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing Microsoft 365 Copilot Search, a new AI-powered, enterprise-grade search experience that will be generally available starting mid-July 2025 for users with an eligible Microsoft 365 Copilot license. This unified search experience is accessible through the Microsoft 365 Copilot app across web, mobile, and desktop platforms.</p><p>Copilot Search leverages Microsoft Graph and Microsoft 365 Copilot connectors to index content across Microsoft 365 and third-party apps. It interprets user context, natural language, behavioral signals, and organizational relationships to deliver highly personalized, context-aware answers to complex queries. Integrated with Microsoft 365 Copilot chat, it enables users to move seamlessly from information discovery to task execution using action-oriented queries.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=490778\" target=\"_blank\">490778</a></p><p>\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: Rolling out early July 2025, expected to complete by mid-July 2025.\n</p><p>General Availability: Rolling out mid-August 2025, expected to complete by late August 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Users with an eligible Microsoft 365 Copilot license will experience a new, intelligent search interface within the Microsoft 365 Copilot app on desktop, web, and mobile. Those without an eligible license will continue to use the classic Microsoft Search experience.\n</p><p><b>What you can do to prepare:</b>\n</p><ul><li>Review the documentation to understand capabilities and deployment considerations: <a href=\"https://learn.microsoft.com/en-us/copilot/microsoft-365/microsoft-365-copilot-search\" target=\"_blank\">Microsoft 365 Copilot Search</a>\n</li><li>Ensure eligible users are licensed appropriately to access the new experience.\n</li></ul><p><b>Compliance considerations:</b>\n</p><ul><li>Alters processing/storage of existing customer data: Yes – indexes and interprets content across Microsoft 365 and third-party apps</li><li>Introduces/modifies AI/ML capabilities: Yes – introduces AI-powered search and task execution\n</li><li>New generative AI interaction for end users: Yes – enables action-oriented queries and Copilot chat integration</li><li>Impacts Purview capabilities: Maybe – depending on how indexed content interacts with DLP, labels, and eDiscovery\n</li><li>Changes to compliance monitoring/reporting: Maybe – Copilot Search may influence how data access and usage are logged</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490778"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Search, an AI-powered search experience, will be generally available mid-July 2025 for eligible users. It integrates with Microsoft 365 Copilot app across platforms, leveraging Microsoft Graph and connectors for personalized, context-aware answers. Review documentation and ensure proper licensing. Compliance considerations include data processing and AI capabilities."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108844",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-03T23:38:15.637Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:37:56Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Search General Availability",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
