{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>What and Why:</b></p><p>To help users work more efficiently, Microsoft is enhancing Copilot in classic Outlook for Windows. With this update, Copilot can now summarize not only the body of an email but also the content of attached PDF, Word, and PowerPoint files—directly within the reading pane. This improvement is designed to reduce context switching and help users quickly understand the full scope of an email without opening attachments.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=491020\" target=\"_blank\">491020</a></p>\n\n<p><b>Rollout Schedule:</b></p>\n\n<ul><li>Public Preview: Rolling out now, expected to complete by late July 2025.</li><li>General Availability (Worldwide): Rolling out from mid-July 2025, expected to complete by late August 2025.\n</li></ul>\n\n<p><b>Impact on Your Organization:</b></p>\n<p style=\"margin-left: 25px;\"><b>Who is affected:</b></p><ul><li>Users licensed for Microsoft 365 Copilot and using classic Outlook for Windows.</li></ul>\n\n<p style=\"margin-left: 25px;\"><b>What will happen:</b></p>\n<ul>\n<li>Users will see Copilot-generated summaries of email body content and supported attachments (PDF, Word, PowerPoint) directly in the reading pane.</li>\n<li>The feature is ON by default for all eligible users.</li>\n<li>No configuration or admin action is required.</li>\n<li>There is no change to existing admin policies or user workflows.</li>\n</ul>\n\n<p><b>Action Required/Recommendations:</b></p>\n<p>No admin action is required. To prepare:</p>\n<ul>\n<li>Ensure users have the appropriate Microsoft 365 Copilot licensing.</li>\n<li>Communicate this new capability to users and helpdesk staff.</li>\n<li>Update internal documentation if you describe Copilot functionality.</li></ul>\n\n<p><b>Compliance Considerations:</b></p><table>\n<tbody><tr><th>Consideration</th><th>Explanation</th></tr>\n<tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Yes – Copilot now processes and summarizes content from attachments (PDF, Word, PowerPoint), which may include sensitive or regulated data.</td></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes – This enhancement expands Copilot’s generative AI capabilities to include summarization of attachments, increasing the scope of data it interacts with.</td></tr>\n<tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes – Users can now interact with Copilot to gain insights from attachments without opening them, directly from the reading pane.</td></tr>\n</tbody></table>\n<p></p><p>Thank you for your feedback. We're actively refining the format of Message center posts based on your input. Please let us know if this updated format improves your understanding of the changes being communicated.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "491020"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is enhancing Copilot in classic Outlook for Windows to summarize email attachments (PDF, Word, PowerPoint) directly in the reading pane. This feature, available by late August 2025, requires no admin action and is on by default. It affects users licensed for Microsoft 365 Copilot."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1112451",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-10T00:16:28.86Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-10T00:16:02Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Outlook: Summarize email attachments with Copilot in classic Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
