{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 12, 2025: We have updated the timeline. Thank you for your patience.</p><p><b><b>Introduction:</b></b></p><p>\nTo improve clarity and control over Frontier feature access, Microsoft is updating the Frontier Admin Control in the Microsoft Admin Center. Starting November 13, 2025, administrators will no longer be able to assign access using groups. This change aligns with feedback to simplify access management and ensure transparency in user-level assignments.</p>\n\n<p><b><b>When this will happen:</b></b></p><ul><li>Change takes effect: <b>November 13, 2025</b></li><li>Transition period: <b>November 6–13, 2025</b> (no changes to user assignments allowed during this time)</li></ul>\n\n<p><b><b>How this affects your organization:</b></b></p><p>\n<b>Who is affected:</b></p><ul><li>\nAdmins managing Frontier access in Microsoft 365 tenants.</li></ul><p>\n<b>What will happen:</b>\n</p><ul>\n<li>Group-based assignments for Frontier access will be removed.</li>\n<li>Admins will only be able to assign access to individual users.</li>\n<li>From November 6–13, changes to user assignments will be temporarily disabled to support migration.</li>\n<li>Existing group assignments will be converted to individual user entries based on group membership as of November 6.</li>\n<li>Group-based management may return in the future, but is not currently supported.</li>\n</ul>\n<p></p>\n\n<p><b><b>What you can do to prepare:</b></b></p><ul>\n<li>Review current Frontier access assignments and identify any group-based configurations.</li>\n<li>Transition group-based assignments to individual users before <b>November 13</b>&nbsp;to avoid disruption.</li>\n<li>Communicate this change to helpdesk and support teams.</li>\n<li>Update internal documentation to reflect the new assignment method.</li>\n<li>For more information, visit:&nbsp;<a href=\"https://adoption.microsoft.com/en-us/copilot/frontier-program/\" target=\"_blank\">Frontier program – Microsoft Adoption</a></li>\n</ul>\n<p></p>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting November 13, 2025, Microsoft will remove group-based assignments for Frontier Admin Control access, requiring admins to assign access to individual users only. A transition period from November 6–13 disables changes, during which existing group assignments convert to user-level entries. Prepare by reviewing and updating assignments."
    }
  ],
  "EndDateTime": "2025-12-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181201",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-12T22:35:49.26Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-29T00:03:04Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Frontier Admin Control User Assignment Changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
