{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 9, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re excited to announce the general availability (GA) of Source Controls for Researcher Agent.</p><p>\n</p><p>Beginning in late August 2025, users with Microsoft 365 Copilot licenses will be able to access Source Controls for the Researcher agent. Previously, Researcher had access to all sources—both work and web (unless blocked)—without user-level controls to narrow the scope. With Source Controls, users can now granularly select which sources Researcher should reason over. Available sources will include Web, Work, and additional options such as Connectors.</p><p>This feature will roll out in multiple phases. The initial phase will support Web, Work, and standard Graph entities (such as emails). Connector support will follow in a later phase. Source Controls will respect existing Admin Web settings.</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/graph/connecting-external-content-connectors-overview\" target=\"_blank\">Microsoft 365 Copilot connectors overview</a></p><p><b>When this will happen</b></p><p>General availability: We will begin rolling out late September 2025 (previously late August) and expect to complete by late October 2025 (previously mid-September).</p><p><b>How this affects your organization</b></p><ul><li>\nThe Source Control will appear on the Prompt box as a button across the Microsoft 365 Copilot app, Teams, and Outlook entry points for Researcher.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3406ad1d-2b0e-4ec4-aead-c626277ff106\" alt=\"user settings\" style=\"width: 400px\"></p><ul><li>For users with a Microsoft 365 Copilot licensed assigned, Source controls will automatically start showing up for Researcher Agent.\n</li><li>Users without Microsoft 365 Copilot licenses will not be able to access these agents.\n</li></ul><p><b>What you can do to prepare</b></p><ul><li>No further admin action is necessary to use Source Controls for Researcher Agent.\n</li><li>For managing these agents via Microsoft 365 admin center, refer to <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#block-or-unblock-agents\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a>.\n</li></ul><p><b style=\"\">Compliance considerations</b></p><p>\nNo compliance considerations identified, review as appropriate for your organization.</p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot's Researcher Agent now offers Source Controls, allowing licensed users to select specific sources (Web, Work, Graph entities) for research. Rolling out from late September to October 2025, this feature appears as a button in Copilot apps and requires no admin action."
    }
  ],
  "EndDateTime": "2025-12-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134173",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-09T19:16:07.907Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-12T23:02:18Z",
  "Tags": [
    "Updated message",
    "New feature"
  ],
  "Title": "Microsoft 365 Copilot: Source controls for Researcher Agent",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
