{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p>\n<p>We’re introducing the <b>People agent </b>in <i>Frontier</i>—a Copilot agent designed to help users quickly understand and discover people in their organization. By surfacing insights from emails, chats, meetings, and documents, the People agent simplifies meeting prep and helps users navigate organizational relationships. This release is part of the Frontier program, which provides early access to experimental Microsoft 365 Copilot innovations for evaluation and feedback.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Public Preview (Worldwide):</b>&nbsp;Begins in mid-November 2025.</li>\n<li><b>General Availability (Worldwide):</b>&nbsp;Begins in Q1 (January - March) 2026.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Admins managing Microsoft 365 Copilot deployments.</li>\n<li>Users with a Microsoft 365 Copilot license and the “Microsoft 365 Copilot in Productivity Apps” service plan.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>The People agent will be available to deploy via the Copilot Control System in the <i>Microsoft 365 admin center</i>.</li>\n<li>Users will be able to access the agent in <i>Microsoft 365 Copilot </i>and <i>Teams</i>.</li>\n<li>The People agent leverages three main data sources to provide a tailored experience for users:\n<ul>\n  <li><b>Microsoft 365 data available to the user</b>: Documents, emails, Teams messages, meeting recordings, and transcripts that the user has access to are used to build context about colleagues—who they are, what they care about, and prior interactions.</li><li><b>Organizational data from your company directory</b>: Enables high-fidelity org charts and answers questions about team structure.\n</li><li><b>The People Skills service</b>: Powers skill-based query responses and helps users find colleagues with specific skills.</li></ul>\n</li>\n<li>Admins can:\n  <ul>\n    <li><b>Deploy the agent</b> on behalf of users by accepting Microsoft Entra permissions.</li>\n    <li><b>Restrict access</b> to specific users or groups.</li>\n    <li><b>Remove or block</b> the agent entirely.</li></ul></li></ul><p><i>Screenshot 1 - People agent homepage, where a user can better understand the organization and the people in it, and prepare for meetings:</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/a9785a99-c486-4058-83b7-67ba215a84da/01a563b9d5d3b76bbcda0641761b50a1897e1ef9.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>Screenshot 2&nbsp;- People agent displaying organizational insights using directory and Copilot data:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/47cbb7d3-7542-4f0b-8f0a-cdd92b5e3b8c/6a584d282538714b5a2156c41568bca5b63bfb11.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Identify end users who will gain early access to Frontier features. Add those users to a Microsoft Entra ID group so the group can be configured for access.\n</li><li>Frontier features are experimental and subject to change. Participation in the Frontier program is optional.</li>\n<li>Review admin controls for agent deployment and access:&nbsp;<a href=\"https://learn.microsoft.com/en-us/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Settings for agents - Manage Microsoft 365 Copilot agents in the Microsoft 365 admin center | Microsoft 365 | Microsoft Learn</a></li><li>Ensure users have an active Microsoft 365 Copilot license.\n</li><li>Enable the People Skills service to unlock skills-related features in the agent.\n</li></ul><p><b>Licensing Requirements:</b></p><ul><li>Users must have an active Microsoft 365 Copilot license to access Frontier features, including the People agent.\n</li><li>To access skills features in the<i> People agent</i>, the People Skills service must be enabled for the tenant. If the service is not enabled, the skills tab and associated skills-related prompts will not appear in the <i>People agent</i>.</li></ul><a href=\"https://learn.microsoft.com/microsoft-365/admin/copilot/manage-agents\"></a>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<table border=\"1\">\n<tbody><tr><th>Question</th><th>Answer</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. The People agent uses generative AI to surface insights from emails, chats, meetings, and documents that the user has access to.</td></tr>\n<tr><td>Does the change alter how existing customer data is processed, stored, or accessed (e.g. documents, emails, chats, etc.)?</td><td>Yes. The agent aggregates and presents existing data in new contextual ways to help users understand colleagues and prepare for interactions.</td></tr>\n<tr><td>Does the change include an admin control and can it be controlled through Entra ID group membership?</td><td>Yes. Admins can manage deployment and access to the People agent using Microsoft Entra ID groups.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users can install or remove the agent if permitted by admin settings.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot’s People agent, launching in Frontier with public preview in November 2025 and general availability in Q1 2026, helps users discover organizational insights from emails, chats, meetings, and documents. Admins control deployment and access via Microsoft Entra ID groups; users need a Copilot license and enabled People Skills service."
    }
  ],
  "EndDateTime": "2026-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1184409",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-14T16:48:09.55Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-10T16:03:46Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: People agent now available in Frontier",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
