{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b>Update:</b> Release of this feature has been updated.<br><br>We are announcing the ability to autonomously grow your pipeline with Sales Agent in Microsoft 365 Copilot for Sales. This feature will reach general availability on March 31, 2026.<br><br>\n<b>How does this affect me?</b><br>\nThe sales agent works like a new sales rep instead of working on behalf of an existing sales rep. It engages your prospects in a two-way conversation and leads them to a meeting or purchase using the following capabilities:<ul>\n    <li>Research prospects deeply.</li>\n    <li>Send hyper-personalized emails to leads.</li>\n    <li>Send outreach emails to a list of prospects from CRM or a CSV file.</li>\n    <li>Follow up with leads if it doesn't receive a response.</li>\n    <li>Respond to questions, handle objections, and ask qualification questions</li>\n    <li>Hand-off leads to sales reps.</li>\n</ul>\nThe sales operations manager is the primary persona for the sales agent, and decides the criteria, knowledge, and behavior the sales agent presents.<br><br>\n<b>What action do I need to take?</b><br> \nThis message is for awareness, and no action is required.<br><br>\nIf you would like more information on this feature, please visit the <a href=\"https://aka.ms/ADO12137\" target=\"_blank\">Autonomously grow your pipeline with Sales Agent</a> article.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-04-30T15:57:00Z",
  "HasAttachments": false,
  "Id": "MC1164255",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-23T19:08:14.443Z",
  "Services": [
    "Power Platform"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-02T15:57:53Z",
  "Tags": [
    "Updated message",
    "New feature"
  ],
  "Title": "Microsoft 365 Copilot for Sales - Autonomously grow your pipeline with Sales Agent",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
