{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Users can now listen to podcast-style audio overviews of PDFs, Word documents, and Notebooks—making it easier to consume content on the go. These overviews feature two-host narration and can be customized on the Create experience, including options for length, speaker voices, and more.</p><p><b>When this will happen\n</b></p><p><b>General Availability (Worldwide):</b> Rollout will begin in mid-September 2025 and is expected to complete by late September 2025.\n</p><p><b>How this affects your organization\n</b></p><p>This feature enhances document accessibility and flexibility for users who prefer audio content. Only users with a Copilot license will be able to generate audio overviews.&nbsp;</p><p>This feature is on by default and does not require admin configuration.\n</p><p><b>What you can do to prepare\n</b></p><p>No action is required at this time. You may wish to inform users with Copilot licenses about this new capability and encourage adoption for productivity and accessibility benefits.</p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Audio overviews for PDFs, Word documents, and Notebooks will roll out globally from mid to late September 2025. Available to users with Copilot licenses, these customizable podcast-style narrations enhance accessibility and require no admin setup. No compliance issues identified; no action needed now."
    }
  ],
  "EndDateTime": "2025-10-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130396",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-06T23:45:26.637Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:45:19Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Audio overviews now available for files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
