{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p></p><p><b>Introduction</b></p><p>We’re introducing a major upgrade to the AI video creator in <i>Microsoft 365 Copilot</i>. This next-generation experience makes it easier than ever to create professional-quality videos from a text prompt, PowerPoint, PDF, or Word document. Key enhancements include:</p><ul><li>Transcript-based editing</li><li>Ability to replace stock media with your own from OneDrive</li><li>Updated natural-sounding voice options</li><li>Brand Kit integration for applying brand colors</li><li>New scene structure for improved storytelling</li><li>Redesigned editing interface for faster, more intuitive workflows</li></ul><p>These updates enable smoother video creation, richer customization, and more professional outputs—helping your organization produce videos that look and sound like they were made by experts.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501560\" target=\"_blank\">501560</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide):</b> We will begin rolling out in late September 2025 and expect to complete by late October 2025.</p><p><b>How this will affect your organization</b></p><p></p>This update enhances the video creation experience for users, allowing them to generate and edit videos directly from documents with improved customization and editing tools. The feature is <b>on by default&nbsp;</b>and <b>available to tenants using Microsoft 365 Copilot</b>.</p><p><b>What you can do to prepare</b><ul><li>No action is required at this time. </li><li>No preparation required.</li></ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/topic/create-a-video-with-the-microsoft-365-copilot-app-4edd41f6-a7ad-47d5-9a55-3fd25622c9f8\" target=\"_blank\">Create a video with the Microsoft 365 Copilot app | Microsoft Support</a></p><p></p><b>Compliance considerations</b><p></p><table class=\"table table-bordered\"><tbody><tr><td>Does this change alter how existing customer data is processed, stored, or accessed (e.g., documents, emails, chats)?</td><td>Yes. The AI video creator now processes documents (Word, PowerPoint, PDF) to generate video content, which may involve parsing and temporarily caching document data for rendering and editing purposes.</td></tr><tr><td>Does this change provide end users any new way of interacting with generative AI?</td><td>Yes. Users can now interact with generative AI to create and edit videos using text prompts and document inputs, including transcript-based editing and voice generation.</td></tr></tbody></table><p></p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501560"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot's AI video creator is upgraded with transcript-based editing, custom media from OneDrive, natural voices, Brand Kit integration, improved scene structure, and a redesigned interface. Rolling out worldwide from late September to October 2025, it enables easier, professional video creation from documents and text prompts."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-12-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1158334",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-14T20:36:00.05Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-23T23:09:27Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: AI video creator major update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
