{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re introducing a new request and approval experience in the Microsoft 365 admin center for Microsoft agents. This update enables users to request access to agents—even those currently unavailable due to your organization’s configuration—directly from the Agent Store.\n</p><p>You can manage these requests centrally from the <i>Copilot </i>&gt; <i>Agents &amp; connectors</i> page in the Microsoft 365 admin center, streamlining access control and improving visibility into user interest.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=494809\" target=\"_blank\">494809</a>.\n</p><p><b>When this will happen\n</b></p><p>Rollout will begin mid-August and complete in early September.</p><p><b>How this affects your organization</b></p><p>This update enhances flexibility and transparency in agent access management:\n</p><ul><li>Admins retain full control over access decisions and benefit from:<ul><li>Centralized management of agent access requests.</li><li>Granular control to approve or reject requests at the individual user level.</li></ul></li></ul><p>This feature is on by default and requires no configuration to enable.\n</p><p><b>What you can do to prepare\n</b></p><p>No setup is required—this feature will roll out automatically.\n</p><p>To prepare:\n</p><ul><li>Visit the <i>Copilot </i>&gt; <i>Agents &amp; connectors</i> page in the Microsoft 365 admin center to view and manage agent access requests.\n</li><li>Approve or reject requests based on your organization’s policies.</li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494809"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 admin center introduces a new request and approval system for agent access, allowing users to request agents directly from the Agent Store. Admins can centrally manage and control approvals via the Copilot > Agents & connectors page. Rollout starts mid-August through early September, with no setup needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134738",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T23:12:13.6Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-13T23:11:29Z",
  "Tags": [
    "New feature"
  ],
  "Title": "New request and approval experience for Microsoft agents in the Microsoft 365 admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
