{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b>Introduction</b></p><p>We’re expanding AI capabilities to SharePoint document libraries in Microsoft 365 on the web. <i>AI file actions</i>—already available in OneDrive—will now be accessible in SharePoint, enabling users to summarize content, compare files, generate FAQs, ask questions, and create audio overviews directly from document libraries.</p>\n\n<b>When this will happen</b>\n<ul>\n  <li>General Availability (Worldwide, GCC, GCC High, DoD): Rollout began mid-May 2025 and is expected to complete by mid-September 2025.</li>\n  <li>Targeted Release (Worldwide): Rollout began mid-May 2025 and is expected to complete by early September 2025.</li>\n</ul>\n\n<b>How this affects your organization</b><p></p><p><i>Figure i. You can access AI actions from the “AI Actions” button in the toolbar in document libraries in SharePoint<br></i></p><p></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/dc042b2d-bf1e-433b-a385-37929cd8c0a0\" style=\"width: 400px;\" alt=\"user settings\"><b></b></p><p>\n</p><p><i>Figure ii. You can also find these actions when you select or hover over an item in a document library</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e793b758-d9de-450b-920b-a27c3d41ec7a/8f6346dffcdacbdcbc5b7988d190f0ca91c36e86.png\" style=\"width: 400px;\" alt=\"user settings\"><i><br></i></p><p><i>AI file actions</i> will be available to all users with a Copilot license in SharePoint document libraries on the web. These actions mirror those currently available in OneDrive and offer enhanced productivity by enabling users to interact with files using natural language prompts. </p><p>This feature is <b>on by default </b>and does not require admin configuration.</p>\n\n<b>What you can do to prepare</b>\n<ul><li>No action is required to enable this feature. </li><li>We recommend informing your users about the new capabilities and reviewing Copilot licensing to ensure appropriate access.</li></ul><p><b>Compliance considerations</b></p><p></p><p></p><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n  <tbody><tr>\n    <th>Compliance Question</th>\n    <th>Explanation</th>\n  </tr>\n  <tr>\n    <td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td>\n    <td>Copilot file actions use AI to process and summarize document content, compare files, and generate responses based on user prompts.</td>\n  </tr>\n  <tr>\n    <td>Does the change provide end users any new way of interacting with generative AI?</td>\n    <td>Users can now interact with generative AI directly within SharePoint document libraries using actions such as summarization, Q&amp;A, and audio overview generation.</td>\n  </tr>\n  <tr>\n    <td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n    <td>Audit logging will capture Copilot interactions with files, ensuring traceability and compliance monitoring.</td>\n  </tr>\n  <tr>\n    <td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td>\n    <td>Access to Copilot features can be managed via licensing and Entra ID group membership.</td>\n  </tr>\n</tbody></table><br>\n<p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488297"
    },
    {
      "Name": "Summary",
      "Value": "AI file actions are expanding to SharePoint document libraries on the web, enabling users with a Copilot license to summarize, compare, generate FAQs, ask questions, and create audio overviews from files. The feature is on by default, rolling out from mid-May to mid-September 2025, requiring no admin setup."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1141949",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-25T22:46:27.007Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-25T22:45:58Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "AI actions coming to SharePoint document libraries",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
