{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 8, 2025: We have updated the content and timeline. Thank you for your patience.</p><p>To ensure continued reliability and performance, Teams Q&amp;A will undergo planned maintenance. During this period, Teams Q&amp;A will operate in read-only mode. This is the first of two planned maintenance windows.</p><p>\n</p><p><b>When this will happen:</b></p><p>We have maintenance planned for Teams Q&amp;A:\n</p><ul><li>Maintenance Window: Starting Friday, August 15th, 2025 at 18:00 UTC. The maintenance window will last approximately 6 hours. This is the first of two planned maintenance windows.</li></ul><p><b>How this will affect your organization:</b></p><p>During this maintenance window, Teams Q&amp;A will operate in read-only mode. Users will be able to view Q&amp;A messages, but will be unable to:\n</p><ul><li>Create meetings, Town halls, or webinars with Q&amp;A added\n</li><li>Turn Q&amp;A off/on in meeting options\n</li><li>Edit Q&amp;A engagement settings \n</li><li>Reply or react to Q&amp;A messages</li><li>Perform any other write-related actions\n</li></ul><p>When users attempt these actions during the maintenance windows, they will see error messages such as:\n</p><ul><li>\"Your message wasn't posted, please try again soon.\"\n</li><li>\"Sorry, something went wrong, please try again soon.\"\n</li></ul><p>This maintenance is planned outside of normal business hours to help minimize any impact on your organization.\n</p><p>For organizations with users around the globe, we recognize that \"outside of normal business hours\" might affect you differently. We apologize for the impact this may have on your users. We are working hard to improve Teams Q&amp;A and to minimize these maintenance windows.</p><p><b>What you need to do to prepare:</b></p><p>During these planned maintenance windows, please plan accordingly. No specific workaround is applicable.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Teams Q&A will undergo two planned maintenance windows starting August 15, 2025, at 18:00 UTC, lasting about 6 hours each. During maintenance, Q&A will be read-only; users cannot create or edit Q&A content and will see error messages if attempting write actions. Plan accordingly."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130380",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-08T21:36:48.833Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:23:14Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams Q&A Planned Maintenance",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
