{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re introducing a unified chat history experience across Microsoft 365 that consolidates all user conversations into a single, streamlined list. This change improves discoverability and continuity by removing the need to switch between web and work contexts.</p><p>For more information, refer to Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498545\" target=\"_blank\">498545</a>.</p><p>\n</p><p><b>When this will happen\n</b></p><ul><li><b>General Availability (Worldwide):</b> Rollout begins in&nbsp;mid-August 2025 and is expected to complete by late August 2025.\n</li><li><b>General Availability (GCC, GCC High, DoD):</b> Rollout begins in late August and is expected to complete by late September 2025.\n</li></ul><p><b>How this affects your organization\n</b></p><p>This update replaces the previous toggle-based chat view with a unified conversation list. Users will now see:\n</p><ul><li>A single list of all conversations, regardless of context.\n</li><li>The five most recent conversations in the left navigation pane.\n</li><li>A full chat history page that preserves the grounding state from the last visit.\n</li></ul><p>This change is designed to reduce user confusion and improve productivity. The feature is enabled by default and does not require admin configuration.\n</p><p><b>What you can do to prepare\n</b></p><ul><li>No admin action is required.\n</li><li>Consider notifying your support teams to prepare for potential user questions.\n</li><li>Update internal documentation or training materials to reflect the new experience.</li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498545"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 will introduce a unified chat history by August 2025, consolidating all conversations into a single list for improved continuity and ease of use. This default feature requires no admin action but may need user support and documentation updates. No compliance issues identified."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1135398",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-14T23:01:14.597Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-14T23:00:59Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Unified conversations: Streamlined chat history view",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
