{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Due to recent feedback regarding the licensing of Interpreter, we’re updating the licensing terms. We understand that our <a href=\"https://techcommunity.microsoft.com/blog/microsoft365copilotblog/what%E2%80%99s-new-in-microsoft-365-copilot--july-2025/4438253\" target=\"_blank\">earlier announcement</a> created frustration and uncertainty, and we sincerely apologize for the disruption this caused. Predictability and transparency are critical, and we are committed to communicating changes more clearly going forward.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490740\" target=\"_blank\">490740</a>.</p><p><b><b>When this will happen:</b></b></p><p>These changes are effective immediately.</p><p><b><b>How this will affect your organization:</b></b></p><p><b style=\"\">Who is affected:</b></p><ul><li>Organizations with users licensed for Microsoft 365 Copilot.</li><li>Admins managing Microsoft Teams and Interpreter usage.</li></ul><p><b style=\"\">What has happened:</b></p><p>We have carefully reviewed customer feedback and are making the following changes to better support our customer’s needs:\n</p><ol><li>We’re increasing the amount of included interpretation hours from 2 hours to 20 hours per user per month with a Microsoft 365 Copilot license. Access beyond the included hours is subject to available capacity.\n</li><li>To help teams adopt Interpreter seamlessly, we will provide IT admins with usage monitoring tools to help your teams plan and manage usage effectively. Usage monitoring tools will be available after March 31, 2026.\n</li><li>You will not be charged based on usage at this point in time. In the future, we may implement an option to purchase additional hours at which point we’ll provide clear and advanced notice. If we offer an option to purchase additional hours in the future, past usage will not be billed retroactively.\n</li></ol><p>We remain deeply invested in advancing AI technology that removes language barriers and streamlines global collaboration. Your feedback is essential in shaping how we deliver these capabilities, and we appreciate your partnership as we continue to refine the experience.\n</p><p>To learn more about Interpreter below are some useful resources:\n</p><ul><li>Read <a href=\"https://support.microsoft.com/office/interpreter-in-microsoft-teams-meetings-c7efe2bb-535d-42ab-a5c4-d2d91619b46d\" target=\"_blank\">Interpreter in Microsoft Teams meetings – Microsoft Support</a></li><li>Read <a href=\"https://learn.microsoft.com/microsoftteams/interpreter-agent-teams\" target=\"_blank\">Manage Interpreter agent for your organization - Microsoft Teams | Microsoft Learn</a></li></ul><p>Thank you for your trust and for being part of this journey with us.\n</p><p><b><b>What you need to do to prepare:</b>\n</b></p><p>This change will happen automatically with no admin action required. You may want to notify your users with Microsoft 365 Copilot licenses about this change and update any relevant documentation as appropriate.</p><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p> \n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490740"
    },
    {
      "Name": "Summary",
      "Value": "Interpreter licensing now includes 20 interpretation hours per user monthly with Microsoft 365 Copilot, up from 2 hours. Usage monitoring tools will be available after March 31, 2026. No current usage charges apply; future additional hours may be purchasable with advance notice. Changes are effective immediately."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-11-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1163764",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-01T22:37:46.727Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-01T22:37:40Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Licensing updates for Interpreter",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
