{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 3, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Users will now be able to use File Type Filters and People Refiners to apply search criteria to get to relevant files faster.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=481136\" target=\"_blank\">481136</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out by early September 2025 (previously late August).</p><p><b>How this will affect your organization:</b>\n</p><p>Users will now be able to refine their file searches more efficiently within the Files tab of the CIQ menu using two new filters:\n</p><ul><li>File Type Filters to narrow results by document type\n</li><li>People Refiners to filter files by collaborators or owners\n</li></ul><p>These enhancements are designed to help users quickly locate relevant files, improving productivity and reducing time spent searching.\n</p><p><b>What you can do to prepare:</b>\n</p><p>No admin action is required. This feature will be enabled by default for all users. You may consider notifying your users about this update to help them take advantage of the new filters.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481136"
    },
    {
      "Name": "Summary",
      "Value": "Copilot Chat's CIQ Menu File Tab now includes File Type and People filters for faster, more efficient file searches. The update will roll out worldwide starting early September 2025, requiring no admin action and improving user productivity by simplifying file refinement."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-10-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108139",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-03T21:16:44.723Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-02T22:41:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Copilot Chat now offers better Search Refinement on CIQ Menu File Tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
