{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 6, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p>&nbsp;<b>Introduction</b></p><p>We’re introducing <b>Immersive Search</b>, a new experience across Outlook for Web, Mac, iOS, Android, and the new Outlook for Windows. After performing a search, users will see an entry point to the Microsoft Copilot side pane, which presents a highly relevant, AI-generated summary based on their query. This summary includes content from emails, Teams messages, and documents—helping users quickly understand and act on their information.\n</p><p>This feature uses Microsoft 365 Copilot with an Outlook-specific experience and is available only to tenants with Copilot licenses.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498319\" target=\"_blank\">498319</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide):</b> We will begin rolling out in late October 2025 (previously late September) and expect to complete by late November 2025 (previously late October).</p><p><b>How this will affect your organization</b></p><p>Once rolled out, users will see a new entry point to the Copilot side pane after executing a search in Outlook. This pane surfaces AI-generated summaries, improving productivity and reducing time spent navigating search results.</p><p><i>Copilot side pane in Outlook search results:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/637e0f0a-ec4a-4ed7-bbf9-bac01707af2f/1c37dbf805f887009b8835de52b7be13a2ecd93e.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>\n</p><p>Key details:</p><ul><li>The Copilot side pane appears only after a user performs a search and selects the entry point on the search results page (SERP).\n</li><li>Summaries include all content supported by Microsoft 365 Copilot, such as indexed emails, Teams messages, attachments, and shared files from OneDrive or SharePoint.\n</li><li>This feature is <b>on by default </b>and <b>does not require admin configuration</b>.</li><li>There are no changes to existing DLP, eDiscovery, or retention policies.\n</li><li>Admins cannot control access to this feature via policy settings or Entra ID group membership.\n</li><li>There is currently no setting in the Microsoft 365 admin center or Outlook user settings to manage or disable this experience.\n</li><li>There is no way to monitor or audit usage of this feature through Microsoft Purview or Microsoft 365 audit logs.</li></ul><p><b>What you can do to prepare\n</b></p><p>No action is required at this time. However, we recommend informing users about this new experience to reduce confusion and help desk inquiries.\n</p><p>You may also want to review your organization's Copilot licensing and ensure users are aware of how to use the Copilot side pane effectively.</p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does this change store new customer data?</td><td>No.</td></tr><tr><td>Does this change alter how existing customer data is processed, stored, or accessed?&nbsp;</td><td>Emails, Teams messages, and documents are processed by large language models (LLMs) to generate summaries based on user search queries.</td></tr><tr><td>Does this change introduce or significantly modify AI or machine learning capabilities that interact with customer data?</td><td>This feature introduces generative AI capabilities that analyze and summarize user content across Outlook and connected Microsoft 365 services.</td></tr><tr><td>Does this change provide end users with a new way of interacting with generative AI?</td><td>Users can interact with Copilot summaries directly in the Outlook interface after performing a search.</td></tr></tbody></table><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498319"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook is introducing Immersive Search with a Copilot side pane across Web, Mac, iOS, Android, and new Windows Outlook. It provides AI-generated summaries from emails, Teams, and documents after searches. Rolling out worldwide from late October to November 2025, it requires Copilot licenses and is on by default without admin controls."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2026-01-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130610",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-06T12:52:32.14Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-07T06:34:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Enhanced search experience with Copilot across Web, Mac, and Mobile",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
