{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re bringing the power of Microsoft 365 Copilot directly into your daily file experience in <i>Windows</i>. This new feature enables users to generate summaries of files and share them directly from the share dialog in <i>File Explorer</i> and the <i>OneDrive activity center</i>. This enhancement is designed to streamline collaboration and improve productivity by making it easier to provide context when sharing files.</p><p>A Microsoft 365 Copilot license is required to access this feature.</p>\n\n<b>When this will happen</b><ul>\n<li><b>General Availability (Worldwide, GCC, GCC High, DoD):</b> Rollout begins in early January 2026 and is expected to complete by late January 2026.</li>\n</ul>\n\n<b>How this affects your organization:</b>\n<ul>\n<li><b>Who is affected:</b> All users of OneDrive and File Explorer in <i>Windows with Microsoft 365 Copilot enabled</i>.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will be able to summarize files and include the summary when sharing via File Explorer or OneDrive activity center:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/3e9a7ae5-eaa6-4a5b-b771-64f20c42d3b5/25fd40804b086451fc4cac4126fecc1b61575647.png\" style=\"width: 400px;\" alt=\"user settings\"></p>\n    <li>The feature is <b>enabled by default</b>.</li>\n    <li>No admin configuration is required.</li>\n  </ul>\n</li>\n</ul>\n\n<b>What you can do to prepare</b><ul>\n</ul><p>No admin action is required to enable this feature.</p><p>If your organization uses or plans to use Copilot, consider:\n  </p><ul>\n    \n    \n    \n  </ul>\n<p></p><ul><li>Informing users about the new summary-sharing capability.</li><li>Updating internal documentation to reflect this new functionality.</li><li>Reviewing Microsoft Copilot licensing and availability details:&nbsp;<a href=\"https://learn.microsoft.com/copilot/microsoft-365/which-copilot-for-your-organization\" target=\"_blank\">Which Copilot is right for me or my organization? | Microsoft Learn</a></li>\n</ul><ul>\n</ul>\n\n<b>Compliance considerations</b><table border=\"1\" cellpadding=\"4\" cellspacing=\"0\"><tbody><tr><th>Question</th><th>Answer</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. This feature uses Microsoft 365 Copilot to generate summaries of user files, which involves AI processing of customer content.</td></tr>\n<tr><td>Does the change provide users any new way of interacting with generative AI?</td><td>Yes. Users can now generate and share AI-generated summaries directly from File Explorer and OneDrive activity center.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will enable users to generate and share AI-generated file summaries directly from Windows File Explorer and OneDrive activity center starting January 2026. The feature is enabled by default, requires a Copilot license, and needs no admin setup. It enhances collaboration by providing context when sharing files."
    }
  ],
  "EndDateTime": "2026-03-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188228",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-19T23:33:30.737Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-19T23:32:49Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Summarize and share OneDrive files in Windows using Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
