{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We’re introducing a new way to personalize meeting summaries in <i>Microsoft Teams</i>. The Custom AI Summary feature allows Copilot users to create tailored meeting notes using sample content, instructions, or prebuilt templates. This enhancement is designed to improve flexibility and productivity by enabling users to generate summaries that better suit their needs.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501540\" target=\"_blank\">501540</a>.</p><p></p><p><b><b>When this will happen:</b></b></p><p><b>Targeted Release</b> rollout will begin in <b>mid-December 2025 </b>and is expected to complete by <b>mid-January 2026</b>.</p><p><b>We will share additional timelines later when available.</b></p><p><b><b>How this affects your organization:</b></b></p><p><i>Who is affected:</i></p><p>Copilot users in <i>Microsoft Teams on desktop</i> (English only).</p><p>The feature requires a Microsoft 365 Copilot license.</p><p><i>What will happen:</i></p><ul><li>Users will see a new option to create custom AI summaries in <i>Teams Meeting Recap</i>.</li><li>Users can build templates using sample notes, freeform instructions, or prebuilt structures.</li><li>Two out-of-box templates will be available: Speaker summary and Executive summary.</li><li>Templates can be saved and reused across meetings.</li><li>The feature is enabled by default for eligible users.</li><li>No admin policy changes are required.</li></ul><p><i>Screenshot 1 - View of a user-created Topic summary:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/2bb1c647-7651-4583-884f-a21af098ca15/f362bdfd8881bc7a88c749c902742afcee403421.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p><i>Screenshot 2 - View of a user-created Topic summary template:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/09cd611d-82ee-41a7-be40-19d496b01fc8/945d923ac907af6d172eceb000c25f72b099fa39.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b><b>What you can do to prepare:</b></b></p><p>No action is required at this time.</p><p>If desired, you may:</p><ul><li>Communicate this update to helpdesk or support staff.</li><li>Encourage Copilot users to explore the new summary options and provide feedback.</li><li>Review internal documentation if you reference Teams Meeting Recap features.</li></ul><p>Learn more:&nbsp;<a href=\"https://techcommunity.microsoft.com/blog/MicrosoftTeamsBlog/what%E2%80%99s-new-in-microsoft-teams--microsoft-ignite-2025/4470387\" target=\"_blank\">What’s New in Microsoft Teams | Microsoft Ignite 2025 | Microsoft Community Hub</a></p><p><b><b>Compliance considerations:</b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed (e.g., documents, emails, chats)?</td><td>Yes. Meeting data is now processed through customizable AI templates, allowing users to generate summaries based on their own instructions or samples.</td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. This feature introduces a new AI capability that allows users to create personalized summaries using Copilot, which interacts with meeting transcript and note data.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes. Users can now interact with generative AI by creating custom templates and instructions that guide how Copilot summarizes meeting content.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501540"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a Custom AI Summary feature in Meeting Recap for Copilot users, allowing personalized meeting notes via templates or instructions. Rolling out mid-Dec 2025 to mid-Jan 2026, it's enabled by default for licensed desktop users (English only) with no admin changes needed."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-02-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1189004",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-22T00:40:13.717Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-22T00:38:14Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Custom AI summary now available in Meeting Recap",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
