{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 24, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>Meetings should be more productive—not more work. The Facilitator agent is now generally available for Microsoft 365 Copilot-licensed users. This AI-powered agent helps keep meetings focused, organized, and action-oriented by surfacing agendas, tracking progress, and capturing key highlights in real time. It supports collaboration through a conversational interface and integrates with tools like Planner, Word, Loop, and Teams Rooms.</p>\n<p>This rollout includes general availability for core meeting skills and public preview for task management and document creation capabilities.</p><p> This message applies to Teams for Windows desktop, Mac desktop, the web, iOS, Android, and Microsoft Teams Rooms (MTR) devices and is associated with Roadmap IDs <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478611\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">478611</a>, <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499891\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">499891</a>, and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=500701\" target=\"_blank\">500701</a>.</p>\n\n<b>When this will happen:</b>\n<ul><li>Preview: Began in March 2025&nbsp;</li><li>General availability: We will begin rolling out late September and expect to complete by early October.</li></ul>\n\n<b>How this affects your organization:</b>\n<p><b>Who is affected:</b> Microsoft 365 users with Copilot licenses. Facilitator is included with a Microsoft 365 Copilot subscription license and subject to available capacity.</p>\n<p><b>What will happen:</b></p>\n<ul>\n    <li>Facilitator agent will be available for scheduled meetings and ad-hoc discussions</li>\n    <li>The Facilitator option is available by default in the Teams meeting experience for licensed users, meaning it appears in the meeting interface if the app is allowed in your tenant. However, it is not added to meetings automatically—meeting organizers or participants must choose to enable it before or during each meeting.</li><li>Facilitator is shipped as an app and is allowed by default, respecting existing app permission policies</li><li>If the Facilitator app is allowed in your tenant, it will appear in the meeting UX automatically</li><li>Users can enable Facilitator before or during meetings</li><p></p><p style=\"\">Screenshot 1: <i>Copilot License User can turn on Facilitator in meeting</i></p><p></p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5065fae4-711d-4a47-ae26-2cca9fe6b596\" style=\"width: 400px;\" alt=\"user settings\"><p></p>Screenshot 2: <i>Users can see messages from Facilitator and new agenda tracker on the meeting window</i><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/55b54eac-4aeb-44a5-801e-f0e80d97238b\" style=\"width: 400px;\" alt=\"user settings\"></p>\n    <p></p><li>Facilitator does not require recording and can be used with or without transcription</li><li>Visual timeline markers to track topics and time, with reminders at midway and wrap-up</li><li>Collaborative, real-time notes editable by all participants via the <i>Notes</i> tab </li><li>AI-powered Q&amp;A from meeting and web content</li><li>Task tracking integrated with Planner</li><li>Instant document drafting in Word or Loop</li><li>Enhanced Teams Rooms experience with chat, notes, and timers</li><li>Mobile capture of ad-hoc discussions and action items</li><li>Licensed users can interact with the agent by mentioning it in the chat, for example “@Facilitator add these topics to the agenda…”<p></p><ul>\n</ul>\n\n<b>What you can do to prepare:</b>\n</li><li>No admin action is required</li>\n<li>Notify Copilot-licensed users about Facilitator availability</li>\n<li>Update internal documentation as needed</li>\n<li>Review meeting options to configure Facilitator without transcription:<ul><li>Set <i>Allow Copilot</i> to <i>Only during the meeting</i> in <i>Meeting Options</i></li></ul></li>\n<li>Public documentation will be available at launch</li>\n</ul>\n\n<b>Compliance considerations:</b>\n<table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n<tbody><tr>\n<th>Consideration</th>\n<th>Explanation</th>\n</tr>\n<tr>\n<td>Introduces or modifies AI/ML capabilities</td>\n<td>Facilitator uses generative AI to interact with meeting content and participants.</td>\n</tr>\n<tr>\n<td>Provides new user interaction with generative AI</td>\n<td>Users can engage with Facilitator via chat and real-time notes.</td>\n</tr>\n<tr>\n<td>Includes admin control</td>\n<td>Managed via <i>Meeting Options</i> and Copilot settings.</td>\n</tr>\n<tr>\n<td>Allows user to enable/disable feature</td><td>Users can turn Facilitator on or off before or during meetings.</td>\n</tr>\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478611,499891,500701"
    },
    {
      "Name": "Summary",
      "Value": "The Facilitator agent is now generally available for Microsoft 365 Copilot-licensed users in Teams meetings, helping organize agendas, track progress, and capture highlights in real time. It integrates with Planner, Word, Loop, and Teams Rooms, and can be enabled by users before or during meetings without requiring recording or transcription."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-12-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1155927",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-25T15:45:23.917Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-19T16:05:07Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Facilitator agent to be generally available in Teams meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
