{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 13, 2025: We have updated the content below to show as intended. Thank you for your patience.</p>This feature is designed to support specialized roles—such as legal, investigative, or moderation teams—where exposure to sensitive content may be necessary. It enables these users to reason over sensitive content using Copilot Chat while maintaining organizational safeguards.\n<p></p><p>This feature is available with the Microsoft 365 Copilot add-on license, which enables Copilot in eligible Microsoft 365 plans.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499809\" target=\"_blank\">499809</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>Rollout will begin in early September 2025 and is expected to complete by early September 2025.</p><p><b>How this affects your organization</b></p><p>This update allows organizations to assign a new policy that enables specific users—such as those in legal or compliance roles—to interact with sensitive content in Copilot Chat. <b>By default</b>, this feature is <b>turned off </b>and will not affect users unless the policy is explicitly assigned. </p><p>Admins will see a new policy setting in the Microsoft 365 admin center (shown below), which enables assignment of harmful content access in Copilot Chat.</p><p> </p><p><i>Admin UX for assigning harmful content access policy in Microsoft 365 Copilot:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/b59b376b-32ee-4024-92b6-930844996a58/100c3eccedf2c295df79fcc0de5e815798893028.png\" style=\"width: 400px;\" alt=\"admin settings\"></p><p>For users who are assigned the policy:\n</p><ul><li>A new option will be available in Copilot Chat that allows them to disable harmful content protection for a specific conversation.</li><li>The default setting is RAI-protected, and users must explicitly turn off protection per conversation.</li></ul><p><b>What you can do to prepare</b></p><p>No action is required unless your organization wants to enable this capability for specific users. Admins can assign the policy to appropriate users based on role requirements. For more information, refer to the Microsoft 365 Copilot documentation (link to be added when available).</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499809"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot introduces a new admin policy allowing specific users, like legal or compliance teams, to access harmful content in Copilot Chat. This feature, off by default, requires explicit assignment and lets users disable harmful content protection per conversation. Rollout begins September 2025."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-10-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1133507",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T20:01:15.697Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-11T23:31:25Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot | New admin policy for harmful content access in Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
