{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:</b></p><p>The <i>August Copilot readiness insights</i> have been refreshed with the latest monthly data and are now available on the <i>Copilot Health</i> page in the <i>Microsoft 365 admin center</i>. These insights help administrators monitor and resolve configuration issues that may impact the Copilot experience. Over time, additional insights will be added to provide clear, actionable guidance to optimize Copilot for your organization.</p><p><b>When this will happen:</b></p><p>General Availability: Available now</p><p>Targeted Release: Available now</p><p><b>How this affects your organization:</b></p><p>Who is affected: </p><p>Admins with one of the following roles:</p><ul><li>Global Administrator</li><li>Global Reader</li><li>Office Apps Administrator</li><li>Security Administrator</li><li>AI Administrator</li></ul><p>What will happen:</p><ul><li>Admins can access refreshed Copilot readiness insights in the <i>Microsoft 365 admin center</i>.</li><li>Insights highlight configuration or rollout issues that may affect Copilot performance.</li><li>Additional insights will be added over time to improve visibility and optimization.</li><li>Access is limited to specific admin roles listed above.</li></ul><p><b>What you can do to prepare:</b></p><ul><li>Regularly review Copilot Health insights in the <i>Microsoft 365 admin center</i>.</li><li>Take recommended actions to resolve any flagged issues.</li><li>Ensure appropriate admin roles have access to the <a href=\"https://admin.cloud.microsoft/?#/copilot/health\" target=\"_blank\">Copilot Health</a> page.</li></ul><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "August Copilot readiness insights are now available in the Microsoft 365 admin center's Copilot Health page for specific admin roles. These insights help monitor and resolve configuration issues affecting Copilot, with ongoing updates planned. Admins should regularly review and address flagged issues to optimize Copilot performance."
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1151679",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-11T22:12:23.91Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-11T22:11:26Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: August Copilot readiness insights now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
