{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>Surveys Agent is a new Copilot agent in Microsoft 365 that helps users build, run, and analyze surveys with ease. It streamlines the entire survey lifecycle—from creation to analysis—enabling faster, insight-driven decisions with less manual effort.\n</p><p><b>When this will happen\n</b></p><ul><li><span style=\"background-color: rgb(255, 255, 255);\"><b style=\"\">Public Preview (Frontier): </b>Beginning mid-August 2025</span></li><li><span style=\"background-color: rgb(255, 255, 255);\"><b>General Availability (Worldwide):</b>&nbsp;Rollout is expected to begin in early September 2025 and complete mid-September 2025</span></li></ul><p><b>How this affects your organization\n</b></p><p>Surveys Agent enables users to create and manage surveys directly through chat in Microsoft 365 Copilot. It simplifies survey creation, distribution, and analysis, reducing time spent on manual tasks. Surveys are powered by Microsoft Forms and adhere to existing admin policies for the Forms service.\n</p><p>This feature is <b>off by default</b>. Users can choose to install the agent from the Microsoft 365 Copilot Agent Store under the \"Built by Microsoft\" section.\n</p><p><b>What you can do to prepare\n</b></p><p><span style=\"background-color: rgb(255, 255, 255);\">To ensure users can access Surveys Agent in the Frontier preview program, admins can take the following steps:</span></p><ul><li><span style=\"background-color: rgb(255, 255, 255);\">Verify users or user groups have a Microsoft 365 Copilot license.</span></li><li><span style=\"background-color: rgb(255, 255, 255);\">Ensure the setting \"Allow the following users access to Copilot agents\" is configured.</span></li><li><span style=\"background-color: rgb(255, 255, 255);\">Ensure the tenant-level setting \"Let users access Microsoft apps\" is configured.</span></li><li><span style=\"background-color: rgb(255, 255, 255);\">(Recommended/optional) Deploy Surveys Agent automatically to users or groups via the Deploy action in Integrated Apps. </span></li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center</a></p><p><span style=\"background-color: rgb(255, 255, 255);\">Surveys Agent creates surveys via Microsoft Forms. Admins should review Microsoft Forms policies to</span> ensure they align with organizational standards.</p><p>Once installed, users can:\n</p><ul><li>Create and send surveys via chat\n</li><li>Monitor responses and send reminders\n</li><li>Analyze results in chat or export to Excel</li></ul><p><b>Compliance considerations</b>\n</p><table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Response</th><th>Explanation</th></tr>\n<tr><td>Does the change store new customer data?</td><td>Yes</td><td>Survey responses are stored in Microsoft Forms and follow existing data retention and admin policies.</td></tr>\n<tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Maybe</td><td>Surveys Agent uses Microsoft Forms to collect and process data, which may include new access patterns via Copilot chat.</td></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes</td><td>Introduces a new Copilot agent that uses generative AI to help users create and analyze surveys.</td></tr>\n<tr><td>Does the change provide users any new way of interacting with generative AI?</td><td>Yes</td><td>Users interact with generative AI via chat to build, send, and analyze surveys.</td></tr>\n<tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes</td><td>Admins can manage access to the agent using Entra ID group membership.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes</td><td>Users can choose to install or remove the agent from the Copilot Agent Store.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Surveys Agent in Microsoft 365 Copilot enables users to create, distribute, and analyze surveys via chat, powered by Microsoft Forms. Launching mid-August 2025 (preview) and September 2025 (general), it is off by default and requires admin configuration and licensing for access."
    }
  ],
  "EndDateTime": "2025-10-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134742",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T23:14:51.62Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-13T23:14:36Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Build and analyze surveys with Surveys Agent in Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
