{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 5, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction\n</b></p><p>We’re introducing new capabilities in Microsoft 365 Copilot in Word that enhance how users interact with Copilot to create and refine content. These updates are designed to streamline document creation and editing through a more conversational and iterative experience.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499428\" target=\"_blank\">499428</a></p><p><b>When this will happen\n</b></p><p>General Availability (Worldwide): Rollout will begin in October 2025 (previously September) and is expected to complete in November 2025 (previously October).\n</p><p><b>How this affects your organization\n</b></p><p>Users with a Microsoft 365 Copilot license will be able to use Copilot in Word to draft new documents or sections, reorganize content into formats like FAQs, update existing content, or rewrite sections. Users will maintain control on the content as they will be able to review and approve any changes.&nbsp;</p><p><b>What you can do to prepare</b></p><p>No admin action is required for this rollout. We recommend informing users about the enhanced Copilot experience in Word and encouraging them to explore the new capabilities. Additional resources and documentation will be available closer to rollout.&nbsp;</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499428"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot in Word will roll out worldwide from October to November 2025, enabling users with licenses to create, edit, and transform content via chat. No admin action is needed; users can review changes, and no compliance issues are identified."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2026-01-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129126",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-05T18:41:26.043Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-04T22:51:14Z",
  "Tags": [
    "Updated message",
    "New feature"
  ],
  "Title": "Use Microsoft Copilot in Word to create, edit, and transform content directly from chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
