{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new capability in Microsoft 365 Copilot for PowerPoint that allows users to reference Excel files when creating a slide. This enhancement helps users seamlessly reuse data from Excel to generate more informative and data-driven presentations.</p><p>This message is associated with Microsoft 365 Roadmap IDs <a href=\"https://www.microsoft.com/microsoft-365/roadmap?id=497537\" target=\"_blank\">497537</a>,&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497538\" target=\"_blank\">497538</a>, and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?id=497539\" target=\"_blank\">497539</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out in early August 2025 and expect to complete by late September 2025.</p><p><b>How this will affect your organization</b></p><p>With this update, users can now reference an Excel file when selecting <b>\"<i>New Slide with Copilot\"</i></b>&nbsp;from the PowerPoint ribbon or <b>\"<i>Add a slide\"</i></b>&nbsp;from the Copilot button above the slide. This enables more efficient content creation by leveraging existing Excel data directly within PowerPoint.</p><p>Key details:\n</p><ul><li>Users can reference <b>one Excel file at a time </b>when creating a slide.\n</li><li>The Excel file must be stored in <b>OneDrive</b>.\n</li><li>Recommended file size for optimal performance is <b>24MB</b>.</li><li>Users can include a topic in their prompt to focus the slide content.\n</li><li>Copilot can generate slides that include <b>charts or tables</b> based on the Excel data.</li><li>This feature is available on <b>web</b>, <b>Win32</b>, and <b>Mac</b> platforms. There are <b>no browser-specific limitations</b>.</li></ul><p>This feature is <b>on by default</b> and does <b>not require admin configuration</b>.</p><p><b>What you need to do to prepare</b></p><ul><li>This feature requires the <b>Microsoft 365 Copilot add-on license</b> ($30/user/month). It is not included in standard Microsoft 365 SKUs (e.g., E3/E5).\n</li><li>Available only to tenants with Microsoft 365 E3/E5 <b>plus the Copilot license</b>.\n</li><li>There are <b>no admin controls</b> to enable, disable, or scope this feature.\n</li><li>Users can reference a file by <b>clicking the paperclip icon</b> or <b>typing a backslash</b> to select a file.</li><li>Only one file can be referenced per slide. The file must be an Excel format and stored in OneDrive.\n</li></ul><p>No admin action is required for this feature to become available. We recommend informing your users so they can take advantage of this new capability.</p><p>Learn more: <a href=\"https://www.microsoft.com/microsoft-365/copilot\" target=\"_blank\">Reinvent productivity with Microsoft 365 Copilot</a></p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Yes, because Copilot is now accessing and referencing Excel file content to generate PowerPoint slides, which may involve processing customer data in new ways.</td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes, this is a new Copilot capability that uses generative AI to interact with Excel data and generate slide content.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?&nbsp;</td><td>Yes, users can now prompt Copilot to generate a slide using an Excel file reference, which is a new interaction pattern.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497537,497538,497539"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot for PowerPoint will allow users to reference one Excel file stored in OneDrive when creating slides, enabling data-driven presentations with charts or tables. Rolling out August–September 2025, it requires a Copilot add-on license and works on web, Win32, and Mac platforms without admin setup."
    },
    {
      "Name": "Platforms",
      "Value": "Web, Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-11-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130389",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-06T23:32:48.517Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:32:18Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot | Reference an Excel file when creating a slide with PowerPoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
