{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new <i>Open in Word</i>&nbsp;action button in Microsoft 365 Copilot Chat. This feature allows users to seamlessly transfer Copilot-generated responses into Microsoft Word for further editing, formatting, or collaboration. It enhances productivity by bridging AI-generated content with familiar document workflows.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide): Rollout begins in mid-September 2025 and is expected to complete by late September 2025.</p><p><b>How this affects your organization</b></p><p>Users with a Copilot license will see a new <i>Open in Word</i> button within Microsoft 365 Copilot Chat. This feature is on by default and requires no configuration. It enables users to move Copilot responses directly into Word, streamlining content creation and editing workflows.</p><p>There is no impact to existing workflows or user permissions. The feature is designed to enhance usability without requiring training or support.</p><p><b>What you can do to prepare</b></p><ul><li>No admin action is required. The feature will be available automatically to all users with a Copilot license.</li><li>You may wish to inform users about this new capability to encourage adoption and improve productivity.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat will add an \"Open in Word\" button by late September 2025, allowing users with a Copilot license to transfer AI-generated content directly into Word for editing. The feature is automatic, requires no admin action, and has no impact on existing workflows or compliance."
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143298",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T22:04:03.077Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T22:03:28Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New \"Open in Word\" action button in Microsoft 365 Copilot Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
