{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We’re introducing <b>OpenAI’s Sora 2</b>, an advanced video generation model, into <i>Microsoft 365 Copilot</i>. This integration enables licensed Microsoft 365 Copilot users in the Frontier Program to create short, AI-generated videos using natural language prompts. The feature helps organizations accelerate creative workflows while maintaining enterprise-grade security and compliance.</p>\n<p><b><b>When this will happen:</b></b></p><ul><li><b>Preview (Frontier):</b> Available now for Microsoft 365 Copilot licensed users in the <i>Create experience</i> under the Frontier program.</li></ul>\n<p><b><b>How this affects your organization:</b></b><b></b></p><p><b>Who is affected:</b>&nbsp;Microsoft 365 Copilot licensed users in participating Frontier tenants.</p><p><b>What will happen:</b></p>\n<ul>\n<li>Users can generate clips at 720p x 1080p resolution with synchronized audio and realistic visuals:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/191f9c65-8719-459b-abde-4104f2f3bab3/870c71ab404c824d9de2b6742d37cf60cf7a2c0c.png\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li>Users can replace media in their video projects with generated clips.</li>\n<li>Videos are stored in <i>OneDrive for Business </i>or <i>SharePoint Online</i>, following your organization’s retention and compliance policies.</li>\n<li>By default, generative AI video is enabled for Copilot licensed users in participating tenants.</li>\n<li>Security and compliance: All interactions are logged, encrypted (TLS 1.2 in transit, Customer Key or Microsoft Managed Key at rest), and governed by Microsoft Purview policies (audit logging, retention, eDiscovery, DLP).</li>\n<li>Responsible AI safeguards: Prompts are screened for inappropriate content; generated videos include visible AI-generated watermarks for transparency.</li></ul><ul>\n</ul>\n<p><b><b>What you can do to prepare:</b></b></p><p>No configuration or technical admin action is required. However, we recommend that you:</p><ul><li>Inform your Frontier users about the new generative video capability in<i> Microsoft 365 Copilot</i>.</li><li>Share guidance on how to generate clips and replace media in projects.</li><li>Update internal documentation if you maintain feature details for your organization.</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/microsoft365copilotblog/available-today-openais-sora-2-in-microsoft-365-copilot/4469721\" target=\"_blank\">Available today: OpenAI's Sora 2 in Microsoft 365 Copilot | Microsoft 365 Copilot Blog</a></li><li><a href=\"https://support.microsoft.com/topic/create-ai-generated-short-clips-with-microsoft-365-copilot-frontier-07694d9a-9a39-4c87-8c5b-a1190365759f\" target=\"_blank\">Create AI-generated short clips with Microsoft 365 Copilot (Frontier) | Microsoft Support</a></li><li><a href=\"https://support.microsoft.com/topic/replace-part-of-a-video-project-with-an-ai-generated-short-clip-frontier-cc3b07ba-1b57-46be-8be4-a2338f75bdc8\" target=\"_blank\">Replace part of a video project with an AI-generated short clip (Frontier) | Microsoft Support</a></li></ul><p></p><table>\n<tbody><tr><th>Question</th><th>Answer</th></tr>\n<tr><td>Does the change store new customer data, if so, where, and is the data cached or permanently stored?</td><td>Yes. Generated videos are stored in OneDrive for Business or SharePoint Online under your organization’s retention and compliance policies.</td></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data, if so summarize changes?</td><td>Yes. This change introduces OpenAI’s Sora 2 model into Microsoft 365 Copilot, enabling users to create AI-generated videos using natural language prompts.</td></tr>\n<tr><td>Does the change provide end users any new way of interacting with generative AI, if so how?</td><td>Yes. Users can now generate video clips and replace media in projects using AI-generated content directly within Microsoft 365 Copilot.</td></tr>\n<tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities e.g., Purview or admin reporting, if so summarize the changes?</td><td>Yes. All interactions are logged and governed by Microsoft Purview policies, ensuring auditability and compliance reporting.</td></tr>\n<tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes. Admins can manage access through Microsoft 365 Copilot licensing and Entra ID group membership.</td></tr>\n\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OpenAI’s Sora 2 video generation model is now integrated into Microsoft 365 Copilot for licensed Frontier users, enabling AI-generated 720p videos with synchronized audio. Videos are stored securely in OneDrive or SharePoint, with compliance, audit logging, and responsible AI safeguards in place. No admin setup required."
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188596",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-21T00:15:32.397Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-21T00:15:22Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: OpenAI’s Sora 2 available for video generation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
