{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 16, 2025: We have updated the timeline. Thank you for your patience.</p><p>Coming soon for Microsoft Copilot in Teams: Intelligent meeting recap will be able to incorporate content shared on screen into the AI-based summary provided after the meeting, providing a richer and more comprehensive recap of the meeting. Intelligent meeting recap will capture details shown when a participant shares their screen, ensuring those unspoken insights become part of the meeting recap.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.\n</p><p>This feature requires a Microsoft 365 Copilot license.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490052\" target=\"_blank\">490052</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September2025 and expect to complete by late-September 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Copilot users will receive intelligent recap summaries that incorporate shared-screen content, preserving every detail and its context.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3ac073cb-92c4-4c40-a300-618ec03b3217\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be available by default with no admin controls.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/intelligent-recap-calls-meetings\" target=\"_blank\">Intelligent recap for Teams calls, meetings, and events - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</p><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490052"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot in Teams will soon provide intelligent meeting recaps that include content shared on screen, enhancing the comprehensiveness of meeting summaries. This feature, requiring a Microsoft 365 Copilot license, will roll out globally from mid to late September 2025, with no admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1115314",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-17T13:26:13.84Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-15T00:00:02Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Copilot in Teams: Visual Insight for intelligent recap",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
