{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We're introducing a <b>new Overview feature</b> in <i>Microsoft 365 Copilot Search</i> that uses AI and Microsoft Graph to surface key information from search results. This enhancement helps users quickly understand the context of a result without needing to open the full item, streamlining their search experience.</p><p>A Microsoft 365 Copilot license is required to access this feature.</p>\n\n<p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide): </b>Rollout is scheduled to begin in <b>mid-November 2025 (or earlier) </b>and is expected to complete by<b style=\"\"> late November 2025</b>.</p>\n\n<p><b><b>How this affects your organization</b></b><b></b></p><p><i>Who is affected:&nbsp;</i>Users with a Microsoft 365 Copilot license who use Microsoft 365 Copilot Search.\n</p><p><i>What will happen:</i></p><ul>\n<li>A new <b><i>Overview</i></b> option will appear on the <i>Copilot Search results page</i>.</li>\n<li>When selected, users will see a concise, AI-generated summary of the search result.</li>\n<li>The feature is powered by Microsoft Graph and AI to highlight key information.</li>\n<li>The feature will be <b>enabled by default</b> for all tenants for all tenants with eligible licenses.</li>\n<li>No changes to existing admin policies are required.</li>\n</ul>\n<p></p>\n\n<p><b><b>What you can do to prepare</b></b></p><ul>\n<li>No admin action is required.</li><li>Ensure users have a Microsoft 365 Copilot license to access the feature.</li>\n<li>Encourage users to explore the new <b><i>Overview</i></b> option in <i>Copilot Search</i>.</li>\n<li>If you maintain internal documentation or training materials, consider updating them to reflect this new capability.</li></ul><p><b><b>Compliance considerations</b></b>&nbsp;</p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Search will add an AI and Microsoft Graph-powered Overview feature by mid-November 2025, providing concise summaries of search results. It requires a Copilot license, is enabled by default, needs no admin action, and helps users quickly grasp search context."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181660",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-30T15:46:06.147Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-30T15:45:59Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: AI and Microsoft Graph-powered overview in Copilot Search",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
