{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Update: As part of our continued investment in simplifying and strengthening the content creation experience, we're consolidating content creation capabilities in Microsoft 365 Copilot. Starting mid-July 2025, the Visual Creator agent will no longer be preinstalled in Copilot Chat (MC1098165), and by late July, it will be removed from the Agent Store.\n</p><p>With the introduction of the Create module in Microsoft 365 Copilot and ongoing improvements to image generation in Copilot Chat, the Visual Creator agent will be retired. Starting mid-July 2025, it will no longer be preinstalled, and by late July, it will be removed from the Agent Store. Users can continue generating images directly in Copilot Chat and for broader content creation scenarios, users with a Microsoft 365 Copilot license will continue to be able to use the Create experience in the Microsoft 365 Copilot app to create videos, posters, banners, and other content.</p><p>\n</p><p><b>When this will happen:</b></p><ul><li>Mid-July 2025: The Visual Creator agent will no longer be preinstalled in Copilot Chat\n</li><li>Late July 2025: Full removal of the Visual Creator agent from the Agent Store will be completed\n</li></ul><p><b>How this will affect your organization:</b></p><ul><li>The Visual Creator agent will no longer be preinstalled or appear in the agent list in Copilot Chat across endpoints.<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/55c31a2a-7761-4ab8-8a51-df466698da6d\" width=\"200\" height=\"\"></p>\n</li><li>After full removal, users will not be able to find or install the Visual Creator agent from the Agent Store.\n</li><li>Past interactions and files created using the Visual Creator agent will remain accessible in Chat &gt; Conversations.\n</li><li>Users will still be able to generate images within the Copilot Chat experience or use the Create experience in the Microsoft 365 Copilot app for broader content generation such as videos, posters, and banners.\n</li></ul><p><b>What you need to do to prepare:</b></p><p>No admin action is required for this change. However, it is recommended that you notify your users about the upcoming change and update internal documentation that references the Visual Creator agent.\n</p><p>For more information on the Create experience, visit: <a href=\"https://support.microsoft.com/en-us/topic/get-started-with-microsoft-365-copilot-create-6e0c616d-69fb-42f2-a4cb-c59e006ec4f5\" target=\"_blank\">Get started with Microsoft 365 Copilot Create</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will retire the Visual Creator agent in Copilot Chat by late July 2025. Users can continue generating images in Copilot Chat and use the Create module in Microsoft 365 Copilot for broader content creation. No admin action is required, but users should be informed about this change."
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1105000",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-27T23:09:05.337Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-27T23:08:52Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft 365 Copilot: Retirement of Visual Creator Agent in Copilot Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
