{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>An agent for every channel: Teams channels provide an organized space for teams to manage workstreams and communicate with stakeholders. Now, each channel can have a dedicated agent that draws on its conversations and meetings to act as a domain expert for the team. These agents adopt the channel’s name and help with common tasks – for example, flagging important deadlines that are buried in conversations, summarizing progress with succinct status reports, assigning tasks and due dates, and answering questions asked in natural language like “What’s the latest on our budget?” You can even invite these agents into meetings when you need expert insights in the discussion.</p><ul><li>Status reporting: The agent can draft a status report for your project on your behalf. It pulls updates from channel conversations, meeting summaries, Planner boards, and announcements, organizing them into sections within the report. You can edit the draft directly in Teams before publishing it to the channel</li><li>Providing answers: Instead of manually searching for information across posts and threads, simply ask the agent. It checks the channel’s conversations, meetings, and plans, and can also trigger a web search. Then it quickly compiles the insights, summarizes the information, and delivers a clear, actionable reply</li><li>Planner integration: When a user assigns a task to another user via your channel’s agent, it creates a plan in Planner. Users can then ask the agent questions about the plan and the agent will keep them updated on the status of action items</li></ul><p><i>Image 1 - Add an agent to a Teams channel:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/b37eb87a-ae47-4abe-9154-fc43cc71afa5/0dfa6d004503fcc979d6357a0d048c342c77ad08.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>Image 2 - Channel Agent participates in the conversation:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/74cb68c0-fa7e-45c1-be0b-8dee58e92eda/6ae144c0efe5c493db21344abb1225ad3d120d55.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p>Limitations:</p><ul><li>Channel Agent may gather and share context that crosses information barriers.</li><li>Channel Agent is best supported by English (US).</li><li>Channel Agent is not supported in private channels.</li><li>Channel Agent is not functional in channels that contain external or guest users.</li><li>Channel Agent is not supported in tenants that use Customer Key.</li><li>Processing data from previews can happen outside of the EU Data Boundaries</li></ul>\n\n<p></p><p><b>When this will happen:</b></p><ul><li><b>Public Preview</b>: We will begin rolling out in <b>mid-September 2025</b> and expect to complete by <b>mid-October 2025</b>.</li></ul><p><b>How this affects your organization:</b></p><p>This new agent is available in public preview and customers are required to have the following licenses to access in public preview. Beyond preview access, additional licensing details will be communicated at general availability.</p><ul><li>An eligible Microsoft 365 base license.<ul><li>For the list of eligible base licenses, see <a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-licensing\" target=\"_blank\">Understand licensing requirements for Microsoft 365 Copilot</a>.</li></ul></li><li>Have an eligible Microsoft Teams license.<ul><li>Teams licenses might be included in your Microsoft 365 subscription. If you have Microsoft 365 (no Teams) licenses, you need to purchase separate Teams licenses.</li></ul></li><li>Have a Microsoft 365 Copilot license.<ul><li>For information on how to acquire Microsoft 365 Copilot licenses, see <a href=\"https://support.microsoft.com/topic/where-can-i-get-microsoft-copilot-40a622db-6d25-4266-b008-4bbcb55cf52f\" target=\"_blank\">Where can I get Microsoft Copilot?</a>.</li></ul></li></ul><p>Channel Agent and Microsoft 365 are built on Microsoft’s comprehensive approach to security, compliance, and privacy. Learn more about Microsoft Purview: <a href=\"https://learn.microsoft.com/purview/ai-teams-channel-agent\" target=\"_blank\">Use Microsoft Purview to manage data security &amp; compliance for Channel Agent in Teams</a>.</p><p>For existing Teams channels, users will need to manually add an agent in to use its capabilities. To add an agent to a channel, open the side panel through the “Agents and Bots” button in the upper right-hand corner of the channel. Once the side panel is open, you will see a banner to add an agent to this channel.</p><p>An agent will be automatically added to newly created channels. This means that for any new channel that an eligible user creates, an agent will be automatically added to the channel. If you would like to change this behavior, IT admins can choose to update this in <i>Teams admin center</i>.</p><p>Within<i> Teams admin center</i>, in the <i>Teams apps section</i> you will see a new page called Agent settings, where you can manage the configuration for the auto-creation feature. By default, auto-creation is enabled. It can be disabled by turning the toggle off.&nbsp;</p><p><b>What you can do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>The “Channel Agent” app will be turned on by default unless all apps are blocked by your organization. However, as an admin, you control whether Channel Agent will be available to your entire organization or to a certain group of users. For more information, refer to our admin documentation <a href=\"https://learn.microsoft.com/microsoftteams/set-up-channel-agent-teams\" target=\"_blank\">here</a>.</p><p>To create Channel Agent, a user needs to be Copilot licensed, have the necessary admin permissions, and be an owner of the channel or have permissions to add/remove apps in the channel.</p><p><b>Documentation:</b></p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/set-up-channel-agent-teams\" target=\"_blank\">Set up Channel Agent in Microsoft Teams</a></li><li><a href=\"https://support.microsoft.com/office/get-started-with-channel-agent-for-teams-channels-b85945cf-deef-4f1e-9db1-66e1a23b6a65\" target=\"_blank\">Get started with Channel Agent in Microsoft Teams</a></li></ul><p><b>Compliance considerations:</b>\n</p><table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Question</th><th>Explanation</th></tr>\n<tr><td>Does this change store new customer data?</td><td>Channel agent may generate new content (e.g., status reports, summaries) based on user interactions and store it within Teams or associated Microsoft 365 services.</td></tr>\n<tr><td>Does this change introduce or significantly modify AI/ML capabilities that interact with customer data?</td><td>Channel agent introduces new generative AI capabilities that interact with customer data to assist with project management tasks.</td></tr>\n<tr><td>Does this change provide users a new way of interacting with generative AI?</td><td>Users can interact with Channel agent to generate summaries, draft emails, and get contextual answers using generative AI.</td></tr>\n<tr><td>Does this change modify Microsoft Purview capabilities?</td><td>See documentation: <a href=\"https://learn.microsoft.com/purview/ai-teams-channel-agent\" target=\"_blank\">Use Microsoft Purview to manage data security &amp; compliance for Channel Agent in Teams</a></td></tr>\n\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams introduces Channel Agent, an AI-powered assistant for each channel that summarizes conversations, drafts status reports, assigns tasks via Planner, and answers questions. Available in public preview from mid-September 2025, it requires specific Microsoft 365 and Copilot licenses and has limitations on channel types and languages. Admins can manage auto-creation settings."
    }
  ],
  "EndDateTime": "2025-11-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1155329",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-18T18:57:19.98Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-18T18:57:11Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Channel Agent",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
