{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 19, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>Users can now listen to podcast-style audio overviews of PDFs, Word documents, and Notebooks—making it easier to consume content on the go. These overviews feature two-host narration and can be customized on the Create experience, including options for length, speaker voices, and more.</p><p><b>When this will happen\n</b></p><p><b>General Availability (Worldwide):</b> Rollout will begin in late September 2025 (previously mid-September) and is expected to complete by mid-October 2025 (previously late September).\n</p><p><b>How this affects your organization\n</b></p><p>This feature enhances document accessibility and flexibility for users who prefer audio content. Only users with a Copilot license will be able to generate audio overviews.&nbsp;</p><p>This feature is on by default and does not require admin configuration.\n</p><p><b>What you can do to prepare\n</b></p><p>No action is required at this time. You may wish to inform users with Copilot licenses about this new capability and encourage adoption for productivity and accessibility benefits.</p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Audio overviews for PDFs, Word documents, and Notebooks with customizable two-host narration will roll out worldwide from late September to mid-October 2025. Available by default to users with Copilot licenses, this feature enhances accessibility and requires no admin setup or compliance changes."
    }
  ],
  "EndDateTime": "2025-11-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130396",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-19T14:31:14.553Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:45:19Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Audio overviews now available for files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
