{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing that the agent inventory page for the Power Platform admin center is now available for Public Preview. This page allows administrators to effortlessly discover, search, filter, and sort the entire inventory of agents by owner, creation date, region, and other key attributes, streamlining common administrative tasks.<br><br><b>How does this affect me?</b><br>The agent inventory page grants administrators the ability to:<ul style=\"margin-top: 0px\"><li><b>Accelerate support:</b> Quickly locate agents referenced in support tickets to improve response times.</li><li><b>Prevent orphaned agents:</b> Identify agents owned by departing users to proactively transfer ownership and maintain continuity.</li><li><b>Enforce compliance standards:</b> Easily detect agents created in nonapproved regions, ensuring adherence to organizational compliance policies.</li></ul><b>What do I need to do to prepare?</b><br>The <a href=\"https://aka.ms/11287/1\" target=\"_blank\">agent inventory page</a> requires tenant-level analytics to be enabled and can only be accessed by tenant administrators.<br><br><b>Learn more:</b><br><ul style=\"margin-top: 0px\"><li><a href=\"https://aka.ms/11287/2\" target=\"_blank\">How do I turn on tenant-level analytics?</a></li><ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-08-02T21:24:04Z",
  "HasAttachments": false,
  "Id": "MC1108089",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-02T21:26:46.817Z",
  "Services": [
    "Power Platform"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-02T21:24:04Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Platform admin center – The agent inventory page is now available for Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
