{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing two new Microsoft 365 Copilot skills in the <i>SharePoint Admin Center</i> that improve administrative efficiency and governance:</p>\n<ul>\n<li><b>Step-by-step task guidance:</b> Copilot now provides clear, sequential instructions to help admins complete common tasks confidently and quickly.</li>\n<li><b>Multi-variable site search:</b> Copilot enables admins to search for sites using multiple conditions, such as inactivity, external sharing, and size, and suggests recommended actions.</li>\n</ul>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501427\" target=\"_blank\">501427</a>.</p><p><b>When this will happen</b></p>\n<p><b>General availability (Worldwide): </b>Rollout begins on <b>October 6, 2025</b>, and is expected to complete by <b>October 7, 2025</b>.</p>\n\n<p><b>How this affects your organization</b></p>\n<ul>\n<li><b>Improve admin efficiency:</b> Step-by-step guidance reduces the need for documentation searches or trial-and-error, helping both new and experienced admins complete tasks faster.</li>\n<li><b>Strengthen governance at scale:</b> Multi-variable site search allows admins to ask complex questions and receive actionable results, making it easier to detect risks and enforce lifecycle policies across large environments.</li>\n</ul>\n<p>These features are <b>off by default</b> and require a <b>Microsoft 365 Copilot license</b> to be enabled.</p>\n\n<p><b>What you can do to prepare</b></p>\n<p>Ensure that your organization has the appropriate Microsoft 365 Copilot for Microsoft 365 licenses to use these features. A Copilot license is required for these features to work. These features will not function without the appropriate licensing.</p><p>No additional configuration is required at this time.</p>\n\n<p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?&nbsp;</td><td>Yes. This change introduces new Microsoft 365 Copilot capabilities that use AI to interact with customer data in SharePoint Online. Copilot can analyze site metadata and permissions to provide task guidance and filtered search results.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>&nbsp;Yes. Admins can now use natural language queries to interact with Copilot, which responds with step-by-step instructions and filtered site lists based on complex criteria.</td></tr><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td><td>&nbsp;Yes. The multi-variable site search feature helps admins trigger actions and analyze reports that identify oversharing, inactive sites, and other governance risks, making it easier to enforce lifecycle policies and demonstrate compliance.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>&nbsp;Yes. Access to these Copilot features can be managed through licensing and Entra ID group membership.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501427"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot introduces two new SharePoint Admin Center skills: step-by-step task guidance and multi-variable site search for improved admin efficiency and governance. Available worldwide from October 6-7, 2025, these AI-driven features require a Copilot license and offer enhanced compliance and control via Entra ID."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1147976",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-04T22:59:47.647Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-04T22:59:39Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint Online: New Microsoft 365 Copilot skills for SharePoint administration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
