{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Coming soon to Microsoft Teams: a new control for users to turn off Microsoft Copilot during a meeting. This control will also turn off recording, transcript, and Facilitator if they are active. Copilot will not have access to what was said or shown in the meeting while it was turned off.&nbsp; After the meeting ends, Copilot will have access to all chat content and any recordings or transcripts created while it was active.</p>\n\n<b>When this will happen</b><ul>\n<li><b>Targeted Release:</b> Rollout will begin mid-September 2025 and is expected to complete by late September 2025.</li>\n<li><b>General Availability:</b> Rollout will begin late September 2025 and is expected to complete by early October 2025.</li>\n</ul>\n\n<b>How this affects your organization</b>\n<p>This feature will be available to users by default.</p>\n<p>After rollout, users can turn off Copilot during a meeting using the following methods:</p>\n<ul>\n<li><b>Teams for desktop and web:</b> Select the Copilot icon at the top of the screen to open Copilot, then select <i>Turn off for everyone</i> from the <i>More options</i> (three-dot) menu in the top-right corner of the Copilot panel.</li>\n<li><b>Teams for iOS/Android:</b> Tap the meeting screen, tap the Copilot icon at the top, then tap the gear icon on the Copilot sheet.</li>\n</ul>\n\n<b>What you can do to prepare</b>\n\n<ul><li>No admin action is required.</li><li>We recommend reviewing your current meeting configurations and notifying users about this change. </li><li>Update any relevant training materials or documentation to reflect the new Copilot controls.</li></ul>\n<p><b>Compliance considerations</b></p>\n<table border=\"1\">\n<tbody><tr>\n<th>Compliance Area</th>\n<th>Explanation</th>\n</tr>\n<tr>\n<td>Alters how existing customer data is processed, stored, or accessed</td>\n<td>When Copilot is turned off during a meeting, it does not process or store any spoken or shared content during that time.</td>\n</tr>\n<tr>\n<td>Modifies how users can interact with generative AI</td>\n<td>Users can now turn off Copilot during meetings, limiting its generative AI capabilities temporarily.</td>\n</tr>\n<tr>\n<td>Allows users to enable/disable the feature themselves</td>\n<td>Users have direct control to turn Copilot off or on during meetings.</td>\n</tr>\n</tbody></table>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon let users toggle Copilot off during meetings, disabling recording, transcripts, and Facilitator while off. Rollout starts mid-September 2025. Users control this via the Copilot icon on desktop, web, and mobile. No admin action is needed, but user notification is recommended."
    }
  ],
  "EndDateTime": "2025-11-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1139485",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-22T00:04:47.29Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-22T00:04:39Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Copilot in Teams meetings: user-controlled on/off toggle",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
