{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 22, 2025: To ensure an optimal experience for our customers we have determined that we won't be proceeding with this change at this time. We will communicate future updates via Message center.</p><p><b>Introduction:</b></p><p>The Skills agent is now available in <i>Frontier</i>, a program that provides early access to experimental Microsoft 365 Copilot innovations. The Skills agent helps individuals and leaders discover people with specific skills, make informed decisions about skill development, and build dynamic, skill-based teams. It is available across Microsoft Teams, Surface devices, and Web experiences. </p><p>The Skills agent is powered by the People Skills service, which infers skills from user activity mapped to a customizable built-in skill taxonomy. People Skills enhances Microsoft 365 Copilot Chat, Microsoft 365, and Microsoft Viva experiences with contextualized information about the people in your organization.</p><p>Frontier agents and AI features are previews, built for evaluation and feedback purposes. These features are still in development, and their availability and capabilities may change at any time.</p><p>Users must have an active Microsoft 365 Copilot license to access Frontier features.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489823\" target=\"_blank\">489823</a>.</p><p><b>When this will happen:</b></p><p>Frontier Availability (Worldwide): Rollout begins week of September 15, 2025, and is expected to complete by the week of September 22, 2025.</p><p><b>How this affects your organization:</b></p><p><i>Who is affected: </i></p><ul><li>Admins managing Microsoft 365 Copilot deployments</li><li>Users with Microsoft 365 Copilot and the “Microsoft 365 Copilot in Productivity Apps” service plan (excluding faculty and student SKUs) will see the Skills agent available to deploy in the <i>Copilot Control center</i> within <i>Microsoft 365 admin center</i>.</li></ul><p><i>What will happen:</i></p><ul><li>Skills agent (Frontier) will be available for installation and use within <i>Microsoft 365 Copilot and Teams</i></li><li>Admins can manage deployment and access via the Copilot Control center in <i>Microsoft 365 admin center</i></li><li>Available deployment controls include:<ul><li><b>Deploy the agent</b>: Install on behalf of users by accepting Microsoft Entra permissions</li><li><b>Restrict access</b>: Limit availability to specific users or groups</li><li><b>Remove/block</b>: Disable or remove the agent entirely from your tenant</li></ul></li><li>Additional People Skills capabilities now generally available:<ul><li>Skills landscape reports via <i>Viva Insights</i></li><li>Skills for Leaders in <i>Viva Insights</i></li></ul></li></ul><p><b>What you can do to prepare:</b></p><p>To prepare for rollout:</p><ul><li>Set up <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-overview\" target=\"_blank\">People Skills in your tenant</a>. – This is a required prerequisite for the Skills agent to function. Without it, the agent will not operate as expected.</li><li>If you are planning to use the leader experiences in <i>Skills agent</i>, there are additional prerequisite conditions to be aware of when setting up leader roles. Review and&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/manager-settings#configure-manager-settings\" target=\"_blank\">configure manager settings</a>.</li><li>Identify users for early access and add them to a Microsoft Entra ID group.\n</li><li>Review and configure deployment controls.</li><li>Review <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-sharing-inferencing-controls\" target=\"_blank\">privacy and sharing settings</a>. Admins and individuals can manage their own visibility settings for People Skills.</li><li>Access <a href=\"https://adoption.microsoft.com/ai-agents/people-skills/\" target=\"_blank\">adoption resources</a>.</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/microsoft365copilotblog/announcing-people-skills-general-availability-and-new-skills-agent/4406364\" target=\"_blank\">Announcing People Skills general availability and new Skills agent | Microsoft Community Hub</a></li><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/manager-settings#configure-manager-settings\" target=\"_blank\">Configure manager settings - Viva Insights | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#settings-for-agents\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center - Microsoft 365 | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-sharing-inferencing-controls\" target=\"_blank\">Manage privacy and sharing controls in People Skills - Microsoft 365 Copilot | Microsoft 365 | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-overview\" target=\"_blank\">Overview of People Skills - Microsoft 365 Copilot | Microsoft 365 | Microsoft Learn</a></li><li><a href=\"https://adoption.microsoft.com/ai-agents/people-skills/\" target=\"_blank\">People Skills adoption site</a></li></ul><p><b>Compliance considerations:</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>The Skills agent uses AI to infer skills from user activity in Microsoft 365 and integrates with Microsoft 365 Copilot Chat, Microsoft 365, and some Viva applications.</td></tr><tr><td>Does the change include an admin control, and can it be controlled through Entra ID group membership?</td><td>Admins can manage access and deployment using Microsoft Entra ID group membership.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Users can install or remove the agent themselves if permitted by admin settings.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489823"
    },
    {
      "Name": "Summary",
      "Value": "The Skills agent, powered by People Skills, is now available in Frontier for early Microsoft 365 Copilot access, helping identify and develop skills across Teams, Surface, and Web. Admins can manage deployment via the Copilot Control center. Rollout began September 2025 but is paused for now."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1155426",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-22T23:08:14.057Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-18T23:47:55Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot (Microsoft 365): Skills agent now available in Frontier",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
