{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are introducing Windows 365 for Agents, a new feature that enables the use of cloud PCs for computer-use scenarios in Microsoft Copilot Studio. Windows 365 for Agents enables Copilot Studio agents to leverage secure, enterprise-ready cloud PCs that are Entra-joined and Intune-managed by your organization without any infrastructure setup required. This feature will be available for all Power Platform environments in the First Release and United States regions on November 18, 2025.<br><br> \n\n<b>How does this affect me?</b><br> \n\nUsage of Windows 365 for Agents is billed on a pay-as-you-go (PAYGO) basis. If your environment already has Copilot Studio PAYGO enabled, Windows 365 for Agents billable usage will automatically be available. <a href=\"https://aka.ms/ADO13113a\" target=\"_blank\">Learn more about Copilot Studio licensing</a>.<br><br> \n\nIf you do not want to enable billable usage of Windows 365 for Agents, you must uncheck the corresponding option in your PAYGO setup within the Power Platform admin center.<br><br> \n\nTo access this setting:<ol> \n\n<li>Go to the <b>Power Platform admin center</b> (new admin center)</li> \n\n<li>Navigate to <b>Licensing</b> &gt; <b> Billing plans</b> </li> \n\n<li>Select the <b>billing plan</b>(s) that have Copilot Studio enabled</li> \n\n<li>Uncheck the <b>Windows 365 for Agents</b> option</li></ol> \n\n<b>What action do I need to take?</b><br> \n\nThis message is for awareness, and no action is required.<br><br> \n\nFor more information about Windows 365 for Agents, please review <a href=\"https://aka.ms/ADO13113b\" target=\"_blank\">Learn more about computer use</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-12-07T21:54:46Z",
  "HasAttachments": false,
  "Id": "MC1183828",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-07T21:55:14.1Z",
  "Services": [
    "Power Platform"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-07T21:54:46Z",
  "Tags": [],
  "Title": "Microsoft Copilot Studio – Information about Windows 365 for Agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
