{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the public preview of a new security control that allows Power Platform admins to <a target=\"_blank\" href=\"https://aka.ms/ADO11381_1\">block the selection and use of agent author authentication</a> for tools in Microsoft Copilot Studio. This feature will be available in preview in early August and will reach general availability in the Fall of 2025.<br><br><b>How does this affect me?</b><br>Agent authors (also known as makers) who are building agents in the configured environments can only select \"User authentication\" when adding a tool to an agent. Authentication will occur at runtime, when the connection is requested during the agent’s conversation and will prompt for the user’s authentication. This feature enables admins to restrict authentication options for tools in Microsoft Copilot Studio.<br><br>By default, agent authors are unrestricted in their choice of authentication methods for agent tools in Microsoft Copilot Studio. This feature gives Power Platform admins the ability to apply this restriction authentication choice across either individual environments or environment groups for all agents created in Microsoft Copilot Studio.<br><br><b>What action do I need to take?</b><br>This message is for awareness and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-08-21T13:17:48Z",
  "HasAttachments": false,
  "Id": "MC1119222",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-21T13:18:51.837Z",
  "Services": [
    "Power Platform"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-21T13:17:48Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Copilot Studio – Block agent author provided authentication in agent tools",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
