{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are introducing a tenant level product feature setting, <i>hosted browser in computer use</i>, for Microsoft Copilot Studio. This feature allows administrators to control whether Copilot Studio’s <i>computer use tool</i> can be executed on a hosted browser powered by Windows 365. This feature will reach preview on September 10, 2025, for all Power Platform environments in the First Release and United States regions and will be enabled by default. <br><br>\n\n<i>Computer use is a powerful tool that automates interactions across websites and desktop applications, but it also comes with important security considerations. In some cases, the AI automates interactions but may cause unintended actions that compromise device, data, or account security. Please review the <a href=\"https://aka.ms/12038/faqs-computer-use\" target=\"_blank\">FAQ for computer use tool</a> for more information. </i> <br><br>\n\n<b>How does this affect me? </b><br> \nHosted browser enables Makers to get started with computer use tool without any infrastructure setup. It supports web automation and access to built-in Windows apps via a non-customer Entra joined Windows-based virtual machine. <a href=\"https://aka.ms/10238/new-machine-registration\" target=\"_blank\">Learn more about computer use</a>.<br><br>\n\nAdmins can centrally control the availability of <i>hosted browser in computer use</i> across the tenant. To access this setting:<ol>\n<li>Navigate to <b>Power Platform admin center</b> (new admin center)</li>\n<li>Go to <b>Manage</b> > <b>Tenant settings</b></li>\n<li>Find <b>Name: Hosted browser in computer use </b></li>\n<li>Toggle <b>On/Off</b> and <b>Save</b></li></ol>\n<b>What action do I need to take? </b><br>\nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-10-01T22:11:03Z",
  "HasAttachments": false,
  "Id": "MC1146242",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-01T22:18:28.11Z",
  "Services": [
    "Power Platform"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-01T22:11:03Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Copilot Studio – Information about hosted browser in computer use",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
