{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Update: The timing of this change has been delayed, review the <a href=\"https://techcommunity.microsoft.com/blog/windows-itpro-blog/get-ready-for-windows-quality-updates-out-of-the-box/4434498\" target=\"_blank\">Windows blog announcement</a> for additional details.</p><p>In an upcoming Windows security update, quality updates will get installed by default during the out-of-box experience (OOBE) for devices that are on Windows 11, version 22H2 or later. </p><p> Expected in Intune’s August (2508) service release, we will introduce a new setting \"Install Windows updates\" in the Enrollment Status Page (ESP) to allow you to manage the installation of quality updates during OOBE. Stay tuned to <a href=\"https://aka.ms/IntuneWN\" target=\"_blank\">What’s new in Intune</a> for the release.</p><p><b>How this will affect your organization:</b>\n</p><p>If you are using Windows Autopilot and ESP, the Install Windows updates setting will be automatically set to “Yes” for new ESP profiles and “No” for existing profiles. If the ESP setting is set to “Yes”, updates will be delivered during OOBE. When configured to “No”, updates will be prevented during OOBE. Additionally, update rings settings (if assigned, as defined below) will be delivered during the ESP and the quality updates page will be shown while the update is applied after ESP completes.</p><p><b>Important:</b> Devices enrolling with Windows Autopilot device preparation or with ESP disabled, cannot prevent Windows updates during OOBE and will receive the latest published security updates.</p><p><b>What you need to do to prepare:</b>\n</p><p>Update your documentation and user guidance as needed. To manage quality updates installed during OOBE for devices using ESP: \n</p><ol><li>In the ESP profile, set Install Windows updates to “Yes” to allow updates or “No” to prevent updates. \n</li><li>(Recommended) Use or create an <a href=\"https://learn.microsoft.com/intune/intune-service/protect/windows-10-update-rings\" target=\"_blank\">update rings policy</a> to manage pause and deferral settings for quality updates. Quality updates installed during OOBE will follow this policy. \n</li><li>Assign the ESP profile and the update rings policy to “All devices” or device groups with devices registered for Windows Autopilot.\n</li></ol><p><b>Related information:</b></p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/windows-itpro-blog/coming-soon-quality-updates-during-the-out-of-box-experience/4374291\" target=\"_blank\">Coming soon: Quality updates during the out-of-box experience </a></li><li><a href=\"https://learn.microsoft.com/intune/intune-service/enrollment/windows-enrollment-status\" target=\"_blank\">Set up the Enrollment Status Page&nbsp;</a></li></ul><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Windows 11 (22H2+) devices will install quality updates by default during out-of-box experience (OOBE). Intune’s August release adds an \"Install Windows updates\" setting in Enrollment Status Page (ESP) to control this. Update rings can manage update timing; devices without ESP cannot block updates during OOBE."
    }
  ],
  "EndDateTime": "2025-10-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134168",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-09T21:51:27.217Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-12T22:57:53Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Plan for Change: Windows quality updates during the out-of-box experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
