{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 28, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re introducing the ability to reference a PDF file when creating a slide using Copilot in PowerPoint. This enhancement enables users to extract and reuse content from cloud-stored PDFs, streamlining slide creation and improving productivity.</p><p>This feature is associated with Microsoft 365 Roadmap IDs <a href=\"https://www.microsoft.com/microsoft-365/roadmap?id=497536\" target=\"_blank\">497536</a>,&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497540\" target=\"_blank\">497540</a>, and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?id=497541\" target=\"_blank\">497541</a>.&nbsp;</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide):</b> We will begin rolling out in mid-October late (previously August 2025) and expect to complete by late November 2025 (previously late September).</p><p><b>How this will affect your organization</b></p><p>With this update, users can reference PDF files stored in OneDrive or SharePoint when using the<b> “New Slide with Copilot” </b>button in PowerPoint or the <b>“Add a slide” </b>option from the Copilot pane. Copilot will access the entire PDF file (text-based only) to generate slide content.\n</p><p>Key details:\n</p><ul><li><b>Supported files:</b> Text-based PDFs stored in OneDrive or SharePoint. Password-protected or scanned/image-based PDFs are not supported.\n</li><li><b>File size: </b>Recommended maximum size is 24MB for optimal performance.\n</li><li><b>Platform support: </b>Available across PowerPoint for Windows, Mac, and Web.\n</li><li><b>Prompting guidance: </b>Users can click the paperclip icon or use the backslash (\\) to reference a file. For large files, including the topic of interest in the prompt improves results.\n</li><li><b>Licensing:</b> Requires the Microsoft 365 Copilot add-on ($30/user/month). Not available with Copilot included in Microsoft 365 SKUs alone.\n</li><li><b>Availability: </b>This feature is available to tenants with Copilot enabled. There are no admin controls to enable or disable it.\n</li><li><b>User control: </b>Users can choose to keep or delete Copilot-generated slides.\n</li><li><b>Telemetry: </b>Usage of this feature is tracked.\n</li></ul><p>This feature does not remove or alter any existing functionality. It is being added to the existing “New Slide with Copilot” experience.</p><p><b>What you need to do to prepare</b></p><ul><li>Inform your users about this new capability.\n</li><li>Encourage them to explore how referencing PDFs can help them create slides more efficiently.\n</li><li>No admin action is required for this update.</li></ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/topic/add-a-slide-from-a-file-with-copilot-in-powerpoint-9034b581-38df-46be-a725-986cbbd4b5d4\" target=\"_blank\">Add a slide from a file with Copilot in PowerPoint</a></p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497536,497540,497541"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot in PowerPoint will allow users to reference text-based PDFs stored in OneDrive or SharePoint to create slides, rolling out from mid-October to late November 2025. This feature requires the Copilot add-on, supports Windows, Mac, and Web, and needs no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Web, Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-01-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130390",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-28T13:18:23.953Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:33:17Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot | Reference a PDF file when creating a slide with PowerPoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
