{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 8, 2025: We have updated the timeline below. Thank you for your patience.</p><p>We're enhancing the meeting experience in Copilot Chat. Users will now be able to select both individual meeting instances and entire meeting series from the Calendar Insights Queue (CIQ) to include in their prompts to Copilot Chat. This provides more context and continuity for Copilot responses, improving productivity and relevance.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=481137\" target=\"_blank\">481137</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout has begun and is expected to complete by late July 2025 (previously early July).\n</p><p><b>How this affects your organization:</b></p><p>Users can now insert meeting series—alongside individual meeting instances—into their Copilot Chat prompts. This enhancement enables more comprehensive context for Copilot, especially when referencing recurring discussions or decisions.\n</p><p>This feature is on by default and requires no admin action.\n</p><p><b>What you can do to prepare:</b></p><p>No preparation is required. This is a standard feature rollout.</p><p><b>Compliance considerations:</b></p><ul><li>Alters how existing data is processed/stored/accessed?\tYes - Meeting series data is now accessible to Copilot</li><li>Introduces/modifies AI/ML capabilities?\tYes - Enhances Copilot’s contextual understanding\n</li><li>New way of interacting with generative AI?\tYes - Users can now reference meeting series in prompts</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481137"
    },
    {
      "Name": "Summary",
      "Value": "Copilot Chat in Microsoft 365 now allows users to select meeting series from the Calendar Insights Queue for prompts, enhancing context and productivity. This feature is rolling out worldwide and will be completed by late July 2025. No admin action or preparation is required. Compliance considerations include changes in data processing and AI capabilities."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-09-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108138",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-08T14:17:43.493Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-02T22:41:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Copilot (Microsoft 365): Copilot Chat now offers meeting series selection on CIQ Menu",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
