{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 18, 2025: We've revised the timeline below and broadened the audience to help ensure all customers are informed of the change. We appreciate your continued patience.</p><p>Based on your feedback, we’re simplifying the behavior of Copilot Chat in the Microsoft 365 Copilot app. This change only impacts users without a Microsoft 365 Copilot license.</p><p>\n</p><p>Today, the <a href=\"https://go.microsoft.com/fwlink/?linkid=2310640\" target=\"_blank\">Pin Microsoft 365 Copilot Chat admin setting</a> controls Copilot Chat entry points in Microsoft 365 apps, including the Microsoft 365 Copilot app across web, mobile, and desktop. Pinning is off by default, but users may be prompted to pin.</p><p>\n</p><p>We have heard from customers that this default experience creates confusion in the Microsoft 365 Copilot app. Users expect to see Copilot Chat but don’t know how to find it.</p><p>\n</p><p>To solve this, we are removing the Microsoft 365 Copilot app from the scope of the pinning setting. Instead, Chat will appear as the default module.&nbsp;</p><p><i>Setting before and after this change:</i> </p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/abb10ceb-fa64-4deb-9e0c-d56c24e15043\" width=\"400\" height=\"\"></p><p><br></p><p><b>How this will affect your organization:</b></p><p>There is no change for users with a Microsoft 365 Copilot license. \n</p><p>When users without this license open the Microsoft 365 Copilot app, Chat will appear as the default module, with an entry point in the navigation menu.  \n</p><p><i>Microsoft 365 Copilot app for users without a Microsoft 365 Copilot license:</i> </p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/014a666c-3c6b-413f-8d78-8de2f35ae13c/bd75cd8ed78d83b53728b5071c8ecc3f36344bb2.png\" width=\"400\" height=\"\"></p><p><br></p><p>While this change will help users discover Copilot Chat, these users have the choice to unpin Chat in their navigation bar.</p><p>Copilot Chat in the Microsoft 365 Copilot app will continue to honor other admin controls: <a href=\"https://learn.microsoft.com/copilot/manage\" target=\"_blank\">Manage Microsoft 365 Copilot Chat | Microsoft Learn</a>.</p><p><b>When this will happen:</b></p><p>The rollout of this change begins mid-August 2025 and completes in the weeks following.</p><p><b>What you need to do to prepare:</b></p><p>No admin action is required. If you would like to inform users of this simplification, you could consider the following message:  \n</p><p>“Copilot Chat, Microsoft’s free and secure generative AI powered by GPT-4o, is now available in the Microsoft 365 Copilot app. Try it today to summarize, rewrite, or answer questions so you can work smarter and accomplish more.”  \n</p><p>Discover how users can get value from Copilot Chat and agents: <a href=\"https://adoption.microsoft.com/en-us/copilot/chat-and-agent-starter-kit/\" target=\"_blank\">Microsoft 365 Copilot Chat and agent starter kit | Microsoft Adoption</a>.&nbsp;</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? No. \n</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data? No. \n</li><li>Does the change provide a new way of communicating between users, tenants, or subscriptions? No. \n</li><li>Does the change provide end users any new way of interacting with generative AI? No - It improves access to existing Copilot Chat capabilities for users without a Microsoft 365 Copilot license.&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is simplifying Copilot Chat in the Microsoft 365 Copilot app for users without a Microsoft 365 Copilot license. Chat will now appear as the default module, making it easier to find. This change begins in mid-August 2025, with no admin action required."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1107496",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-23T05:56:24.307Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-01T23:23:51Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Simplifying Copilot Chat in the Microsoft 365 Copilot app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
