{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We're enhancing threaded channel experiences by extending the thread summarization feature to post/reply channels. This update replaces the <i>Highlights from this conversation</i>&nbsp;option in the <i>More options menu</i>&nbsp;with <i>Summarize Thread</i>, providing a consistent and improved way to generate conversation summaries across all channel types.\n</p><p><b>When this will happen</b></p><p>General Availability: Rollout will begin in mid-August 2025 and is expected to complete by mid-September 2025.\n</p><p><b>How this affects your organization</b></p><p>Previously, users could select <i>Highlights from this conversation</i>&nbsp;to summarize posts and replies. This option is now replaced with <i>Summarize Thread</i>, which shows up for conversations with more than 1000 characters. This new option offers a more intuitive and consistent experience across threaded and post/reply channels. The feature is enabled by default on both desktop and mobile and does not require admin configuration.</p><p><i style=\"\">Figure i. Find the Summarize Thread option in the More Options menu if there are a minimum of 1000 characters in a conversation</i></p><p></p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e9ff56cd-854b-4cda-ae17-515c658fa06a\" style=\"width: 269px;\" alt=\"user settings\"><i style=\"background-color: rgb(255, 255, 0);\"></i><p></p><p></p><p></p><p><i>Figure ii: Your summary shows up on both desktop and mobile</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/53c073e6-6592-4c9b-964c-d51d16530fdf\" style=\"width: 100%;\" alt=\"user settings\"></p><p></p><p>\n</p><p><b>What you can do to prepare</b></p><ul><li>Inform users about the updated summarization option.\n</li><li>Update internal training materials or documentation to reflect the new label and functionality.\n</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will replace \"Highlights from this conversation\" with \"Summarize Thread\" in post/reply channels starting mid-August 2025. This new feature, enabled by default, summarizes conversations over 1000 characters for a consistent experience across channels, requiring no admin setup. Inform users and update training accordingly."
    }
  ],
  "EndDateTime": "2025-10-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134178",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T23:04:59.893Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-12T23:04:54Z",
  "Tags": [
    "Feature update"
  ],
  "Title": "Microsoft Teams: “Summarize thread” replaces “Highlights from this conversation” in post/reply channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
