{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 1, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction:</b></b>\n</p><p>We're introducing the ability to use Microsoft 365 Copilot directly from the OneDrive activity center on macOS. This update enables users to perform Copilot actions—such as summarizing documents, generating FAQs, and asking questions—by selecting a file and clicking the vertical ellipsis. This enhancement brings Copilot closer to where users work, helping them extract insights and take action faster.</p>\n\n<p><b><b>When this will happen:</b></b>\n</p><ul>\n</ul><p><b>General Availability (Worldwide, GCC, GCCH, and DoD):</b> Rollout began in<b> mid-November 2025</b> and is expected to complete by <b>mid-December 2025 </b>(previously&nbsp;early December).</p><ul>\n</ul><p></p>\n\n<p><b><b>How this affects your organization:</b></b>\n</p><p><b>Who is affected:&nbsp;</b>Users of OneDrive on macOS <b>with a Microsoft 365 Copilot license</b>.\n</p><p><b>What will happen:</b>\n</p><ul>\n<li>Users will be able to access Copilot actions from the OneDrive activity center by selecting a file and clicking the vertical ellipsis.</li>\n<li>Available actions include summarizing documents, generating FAQs, and asking questions:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/cdfacd85-fc7e-4054-86b9-1f25373d81c3/5ded026093272dee0f5cc47614e1c09839421850.png\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li>The feature is<b> ON by default </b>and does not require admin configuration.</li>\n<li>Microsoft 365 Copilot availability depends on market and language support.</li>\n<li>A qualifying Microsoft 365 enterprise or business plan is required.</li>\n</ul><p></p>\n\n<p><b><b>What you can do to prepare:</b></b>\n</p><ul>\n<li>Inform users about the new Copilot capabilities in the<i> OneDrive activity center</i>.</li>\n<li>Review your organization's Copilot licensing and availability.</li>\n</ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/office/get-started-with-copilot-in-onedrive-7fc81e10-e0cf-4da8-af2e-9876a2770e5d\">Get started with Copilot in OneDrive | Microsoft Support</a></p><p><b><b>Compliance considerations:</b></b></p><ul><p></p><table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n<tbody><tr><th>Question</th><th>Explanation</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes – This feature enables users to interact with Microsoft 365 Copilot, which uses AI to process and summarize file content.</td></tr>\n<tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes – Users can now initiate Copilot actions (e.g., summarization, Q&amp;A) directly from the OneDrive activity center on macOS.</td></tr>\n</tbody></table><p></p></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot is now accessible from the OneDrive activity center on macOS, allowing users with a Copilot license to summarize documents, generate FAQs, and ask questions directly from files. The rollout began mid-November 2025 and will complete by mid-December 2025, with the feature enabled by default."
    }
  ],
  "EndDateTime": "2026-01-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187835",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-01T23:46:31.603Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T22:49:38Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Use Copilot with OneDrive files in macOS activity center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
