{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 5, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>&nbsp;<b>What and Why</b></p><p>We’re introducing a new capability that allows users with a Microsoft 365 Copilot license to scope and control Copilot Chat responses by selecting specific content sources. This enhancement is designed to improve the relevance and accuracy of Copilot responses by limiting them to user-selected sources, aligning with customer feedback for more transparent and customizable AI interactions.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=496596\" target=\"_blank\">496596</a></p><p><b>Rollout Schedule</b></p><p><b>General Availability (Worldwide):</b> Rollout will begin in late November 2025 (previously&nbsp;late October)&nbsp;and is expected to complete by mid-December 2025 (previously&nbsp;mid-November).</p><p><b>Impact on Your Organization</b></p><ul>\n<li><b>Who is affected:</b> <ul><li>Users with a Microsoft 365 Copilot license.</li></ul></li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will see a new option to select content sources when using Copilot Chat.</li>\n    <li>Copilot responses will be scoped only to the selected sources, improving control and precision.</li>\n    <li>This feature will follow a standard rollout and is enabled by default.</li>\n    <li>There is no impact to admin settings or policies.</li>\n    <li>No changes to existing Copilot behavior unless users actively select sources.</li></ul></li></ul><p></p><ul></ul><p></p><p><b>Action Required/Recommendations</b></p><ul>\n  <li>No admin action is required.</li>\n  <li>This feature does not impact admin controls or require configuration.</li>\n  <li>We recommend:\n    <ul>\n      <li>Informing helpdesk staff of this new user-facing capability.</li>\n      <li>Updating internal documentation if you provide guidance on Copilot usage.</li></ul></li></ul><p></p><ul></ul><p></p><p><b>Compliance Considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "496596"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will let licensed users select specific content sources to scope Copilot Chat responses, enhancing relevance and control. The feature rolls out worldwide from late November to mid-December 2025, is enabled by default, requires no admin action, and does not affect existing policies."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2026-01-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1127230",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-05T22:21:07.81Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-01T23:19:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot: Content Sources in Copilot Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
