{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re providing standard access to AI video generation in the Create experience of Microsoft 365 Copilot to users without a Microsoft 365 Copilot license, enabling all Copilot Chat users in your organization to generate AI-powered videos using curated stock content. This feature enables users to create videos using natural language and Word, PowerPoint, and PDF files to communicate their ideas.\n</p><p>Learn more about standard vs. priority access to Copilot features: <a href=\"https://support.microsoft.com/topic/standard-versus-priority-access-to-features-in-microsoft-365-copilot-chat-12c8d9f8-db32-4f99-8ebe-d8d85879137f\" target=\"_blank\">Standard versus priority access to features in Microsoft 365 Copilot Chat - Microsoft Support</a>\n</p><p><b><b>When this will happen:</b></b></p><ul>\n<li><b style=\"\">General availability (Web, Windows, macOS):</b> Begins rolling out early November 2025 and is expected to complete by mid-November 2025.</li>\n<li><b>General availability (Worldwide): </b>Begins mid-November 2025 and is expected to complete by late November 2025.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected: </b>Microsoft 365 licensed users with access to Copilot Chat\n</li><li><b>What will happen:\n</b><ul><li>Users will find a new option to create videos in the <i>Create experience</i> of the Microsoft 365 Copilot app.</li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f8baa041-8ae7-4c87-91b4-5d3aec78b827\" style=\"width: 400px;\" alt=\"user settings\"></p><li>Users can create a video using natural language and then edit the transcript and update the audio.</li><li>Videos are created using stock video and are fully editable.&nbsp;</li><li><b>Supported input files:\n</b><ul><li>Unencrypted DOCX, PPTX, and PDF formats\n</li><li>Files with sensitivity labels, as long as the label does not display a lock icon\n</li></ul></li><li>No admin action is required to enable this feature.</li></ul></li></ul><p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Review your current settings in the Microsoft 365 admin center.</li>\n<li>If needed, update your tenant configuration using this guide: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-page#copilot-image-generation\" target=\"_blank\">Microsoft 365 admin center scenarios that configure Copilot | Microsoft Learn</a></li>\n<li>Inform users about AI video creation capabilities: <a href=\"https://support.microsoft.com/topic/get-started-with-microsoft-365-copilot-create-6e0c616d-69fb-42f2-a4cb-c59e006ec4f5\" target=\"_blank\">Get started with Microsoft 365 Copilot Create – Microsoft Support</a></li>\n<li>Consider updating internal documentation or training materials to reflect this change.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot now offers AI video generation in the Create experience for all Copilot Chat users without a license, using natural language and Word, PowerPoint, or PDF files. It rolls out globally from November 2025, requires no admin action, and supports editable stock videos."
    }
  ],
  "EndDateTime": "2025-12-22T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1171840",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-13T23:23:30.497Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-13T23:23:26Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot app: AI video generation now available in Create",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
