{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We’re introducing support for Microsoft 365 Copilot in delegated mailboxes. This update enables users with delegate access to use M365 Copilot to reason over emails in those mailboxes, improving productivity and collaboration in shared scenarios. To use this feature, users must have a Microsoft 365 Copilot license.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=416062\" target=\"_blank\">416062</a>.</p><p><b><b>When this will happen:</b></b></p><p><b>General Availability (Worldwide):</b> Rollout will begin in late September 2025 and is expected to complete by late September 2025.</p><p><b><b>How this affects your organization:</b></b></p><p>Who is affected: Users with delegate access to another user's mailbox in Microsoft 365. </p><p>What will happen:</p><ul><li>Users with delegate mailbox access will be able to use Microsoft 365 Copilot to interact with and reason over emails in delegated mailboxes:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/1ae8ba7a-63d6-4415-8568-4b0ad56a4096/ebaec32b462bef4fbe8328934861d58128f608b7.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>The feature will be available on Android, Desktop, Developer, iOS, Linux, Mac, and Web platforms.</li><li>No changes to existing delegate permissions are required.</li><li>The feature will be ON by default for eligible users.</li><li>Admin policies governing mailbox access remain unchanged.</li></ul><b><b>What you can do to prepare:</b></b><ul><li>Ensure users providing delegate access are aware that delegates will be able to use Copilot to reason over emails in the delegated mailbox.</li><li>Communicate this change to helpdesk and support staff.</li><li>Update internal documentation if you detail Copilot capabilities or delegate access.</li><li>No configuration changes are required unless you wish to restrict delegate access to Copilot features.</li></ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/topic/use-copilot-in-shared-mailboxes-and-delegate-mailboxes-3e7e5130-eabe-4c19-94ea-117b2a4c14d6\" target=\"_blank\">Use Copilot in shared mailboxes and delegate mailboxes | Microsoft Support</a></p><b><b>Compliance considerations:</b></b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "416062"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will support delegate mailbox access starting late September 2025, allowing users with delegate permissions to use Copilot on those emails across multiple platforms. No permission changes are needed, the feature is on by default, and admin policies remain unchanged."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, Developer, iOS, Linux, Mac, Web"
    }
  ],
  "EndDateTime": "2025-11-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162968",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-30T23:23:07.42Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-30T23:23:00Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot (Microsoft 365): Delegate mailbox access for emails in M365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
