{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Copilot</b> in <i>PowerPoint </i>is getting smarter. Soon, users will be able to generate a compelling title, concise summary, or captions for visuals simply by describing what they want in natural language. Copilot will use the context of the slide to generate relevant text, helping users turn ideas into content quickly and efficiently.</p>\n<p><b>Note:</b> A Microsoft 365 Copilot license is required to access this feature.</p><p>This message is associated with Microsoft 365 Roadmap IDs: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=513427\" target=\"_blank\">513427</a>.</p>\n\n<b>When this will happen:</b>\n<p>General Availability (Worldwide): Rollout will begin in <b>mid-December</b> and is expected to complete by <b>late December</b>.</p>\n\n<b>How this affects your organization:</b>\n<ul>\n<li><b>Who is affected:</b> Users of <b>PowerPoint for Windows desktop</b>, <b>PowerPoint for Mac desktop</b>, and <b>PowerPoint Online Web</b>.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>A new Copilot dropdown (pen icon) will appear for blank textboxes.</li>\n    <li>Editors will see a prompt box to enter instructions for generating text.</li>\n    <li>The feature will be <b>on by default</b>.</li>\n  </ul>\n</li>\n</ul>\n\n<b>What you can do to prepare:</b>\n<ul>\n<li>No admin action is required before rollout.</li>\n<li>You may want to:\n  <ul>\n    <li>Notify users about this new capability.</li>\n    <li>Update internal documentation to reflect the change.</li>\n  </ul>\n</li>\n</ul>\n\n<b>Compliance considerations:</b>\n<table border=\"1\">\n<tbody><tr><th>Question</th><th>Answer</th></tr>\n<tr><td>Does this change introduce or significantly modify AI/ML capabilities that interact with customer data?</td><td>Yes. Copilot uses generative AI to analyze slide content and generate text based on user prompts.</td></tr>\n<tr><td>Does this change provide end users a new way of interacting with generative AI?</td><td>Yes. Users can now describe desired content in natural language and receive AI-generated text directly in PowerPoint.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "513427"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot in PowerPoint will soon generate titles, summaries, and captions using slide context via natural language prompts. Rolling out mid to late December, it appears as a default dropdown for blank textboxes on Windows, Mac, and Web. No admin action needed; user notification recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Mac"
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1178510",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-23T23:00:02.087Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-23T22:59:35Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Generate text for a PowerPoint slide using slide context",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
