{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 8, 2025: We have updated the content. Thank you for your patience.</p><p>Starting July 16, 2025, we’re rolling out the new Researcher agent in Microsoft Word for Microsoft 365 Copilot licensed users. This agent combines OpenAI’s deep research model with Copilot’s orchestration and search capabilities to help users conduct complex, multi-step research across work and web data.</p><p><b>When this will happen:</b></p><ul><li>Word on the web and Mac: Rollout begins July 16, 2025, and completes by July 28, 2025.\n</li><li>Word on Windows: Rollout begins July 28, 2025, and completes by August 14, 2025.\n</li></ul><p><b>How this affects your organization:</b></p><ul><li>For users with a Microsoft 365 Copilot license, the Researcher agent will appear:\n<ul><li>In the Copilot prompt box in Word.\n</li><li>In the Copilot Chat Agent Store under “Built by Microsoft.</li></ul></li><li>The Researcher agent supports 37 languages.\n</li><li>Admin settings for the Researcher agent apply specifically to its use in Word.\n</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3c12e413-65b4-4cdc-94d0-002aec0c73aa \" width=\"400\" height=\"\" &gt;<=\"\" p=\"\"></p><p><b>What you can do to prepare:</b></p><p>No admin action is required to enable the Researcher agent for Microsoft 365 Copilot users.\n</p><p>To manage agents in the Microsoft 365 admin center, refer to:\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#block-or-unblock-agentsG%2Bxlh%2BQ%3D&amp;reserved=0\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a>.&nbsp;</li><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#block-or-unblock-agents\" target=\"_blank\">Block or Unblock Agents</a>\n</li></ul><p>For more details, see Message center post MC1085251 (May 2025).\n</p><p><b>Compliance considerations:</b></p><ul><li>Does the change store new customer data?\tMaybe - The Researcher agent may generate or retrieve content based on user prompts. If this content is stored (e.g., in documents or logs), it could involve new customer data. However, storage behavior may depend on tenant configuration and usage.\n</li><li>Does the change alter how existing customer data is processed, stored, or accessed?\tYes - The agent can access and reason over existing work data (e.g., documents, emails) to generate research responses, which changes how that data is processed and potentially accessed.\n</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with customer data?\tYes - This is a new generative AI agent that uses OpenAI models and Copilot orchestration to interact with customer data in Word.\n</li><li>Does the change provide end users any new way of interacting with generative AI?\tYes - This is a new generative AI experience embedded in Word, enabling users to conduct research through natural language prompts.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting July 16, 2025, the Researcher agent will be available in Word for Microsoft 365 Copilot licensed users, combining OpenAI’s research model with Copilot’s capabilities. The rollout completes by August 14, 2025, and supports 37 languages. No admin action is required. Compliance considerations are noted."
    }
  ],
  "EndDateTime": "2025-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1111176",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-08T21:25:59.49Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-07T23:57:26Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Researcher is available in Word for Microsoft 365 Copilot licensed users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
