{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p></p><p><b><b>Introduction</b></b>\n</p><p>We're introducing a new capability that allows users to <b>copy agents created</b> <b>in the</b><i style=\"font-weight: bold;\"> lite Copilot Studio experience</i> into the<b> <i>full Copilot Studio experience</i></b>. This upgrade unlocks advanced authoring tools, broader publishing options, and enhanced governance features. It supports organizations looking to scale agent capabilities while maintaining control over lifecycle and data policies.</p>\n\n<b><b>When this will happen</b></b>\n<p><b>General Availability (Worldwide):&nbsp;</b>Rollout begins <b>the first week of November 2025</b>&nbsp;and is expected to complete by <b>mid-November 2025</b>.</p>\n\n<b><b>How this affects your organization</b></b>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Users authoring agents in the<i> lite Copilot Studio experience within Microsoft 365</i>.</li>\n<li>Admins managing environments and governance in <i>Power Platform admin center</i>.</li>\n</ul>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Users can copy agents from the lite experience into the <i>full Copilot Studio experience</i>.</li>\n<li>The original agent remains unchanged and usable.</li><li>The copied agent becomes a <b>Copilot Studio custom agent</b>, enabling broader lifecycle and compliance controls.</li><li>Users can edit the copied agent in <i>Microsoft Copilot Studio</i> and test it before sharing.</li><li>As a Copilot Studio custom agent, the copied agent comes with enhanced lifecycle management, usage monitoring and analytics, and governance controls.</li><li>Admins get more governance capabilities from applying Data Loss Prevention (DLP) policies to ensuring Application Lifecycle Management (ALM).</li>\n<li>Copied agents gain access to advanced features such as:\n  <ul>\n    <li>Topics and Automations</li>\n    <li>Publishing to additional channels</li>\n    <li>Lifecycle management and analytics</li>\n    <li>Governance controls including DLP and ALM</li>\n  </ul>\n</li>\n<li>Admins can apply Power Platform governance policies to copied agents.</li><li><b>Licensing requirements: </b></li><li>Users must have a Microsoft 365 Copilot license or be on a Pay-As-You-Go plan.</li><li>Trial licenses are supported:<ul><li>A user holding a trial license can use this feature.</li><li>Admins can block trial signups via the Power Platform admin center.</li><li>Trial licenses include limited capabilities (such as agents cannot be published beyond personal use).</li></ul></li><li>The copy process does not impact the original agent’s data; the copy is made separately.</li><li>All agents in the full experience are managed using Power Platform environments.</li></ul>\n\n<b><b>What you can do to prepare</b></b><p></p><p>Admins should take the following steps:\n</p><ul>\n<li><b>Understand Power Platform concepts:</b> The lite version of Copilot Studio is managed via the <b>Microsoft admin center</b> and focuses on agents within <i>Microsoft 365</i>. The full version is managed through the <a href=\"https://learn.microsoft.com/power-platform/admin/admin-documentation?tabs=new\" target=\"_blank\"><b>Power Platform admin center</b></a>, enabling users to build more advanced agents that can connect beyond Microsoft 365 and leverage Power Platform capabilities such as environments, Dataverse, and lifecycle management.</li>\n<li><b>Review security and governance capabilities: </b>The full version uses Power Platform concepts, offering enhanced <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/security-and-governance\" target=\"_blank\">security and governance capabilities</a>. Copied agents are stored in <i><a href=\"https://learn.microsoft.com/power-apps/maker/data-platform/data-platform-intro\" target=\"_blank\">Dataverse</a></i> for robust lifecycle and access management.</li><li><b>Set up environments: </b>The full experience manages agents using <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/environments-first-run-experience\" target=\"_blank\">Power Platform environments</a>. Admins should create or assign environments, optionally link them to groups, and configure <a href=\"https://learn.microsoft.com/power-platform/admin/database-security\" target=\"_blank\">role-based access control (RBAC)</a>. If no environments exist, users default to the standard environment. Environments are tied to a <a href=\"https://learn.microsoft.com/power-platform/admin/regions-overview?tabs=new\" target=\"_blank\">Power Platform region</a>, so verify location settings.</li><li><b>Enable environment routing: </b>Admins can turn on <a href=\"https://learn.microsoft.com/power-platform/admin/default-environment-routing?tabs=new\" target=\"_blank\">Environment routing</a> in the Power Platform admin center to guide users to preferred environments during agent copying.</li><li><b>Prepare licensing: </b>The system will verify <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/billing-licensing\" target=\"_blank\">Copilot Studio licensing</a> before copying. <b>Users with the Microsoft 365 Copilot license or on Pay-As-You-Go already have access. </b>Trial licenses are available, but admins can <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/admin-block-viral-signups\" target=\"_blank\">restrict trial signups</a>.</li><li><b>Set up data policies: </b>Define <a href=\"https://learn.microsoft.com/power-platform/admin/advanced-connector-policies?tabs=new\" target=\"_blank\">connector policies</a> and <a href=\"https://learn.microsoft.com/power-platform/admin/wp-data-loss-prevention\" target=\"_blank\">data policies</a> in the <i>Power Platform admin center</i> to restrict connections and ensure compliance. Ensure the <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/dlp-example-6\" target=\"_blank\">Teams and Microsoft 365</a> channels are enabled for publishing.</li><li><b>Add admin contact info:</b> Including <a href=\"https://learn.microsoft.com/%20microsoft-copilot-studio/admin-data-loss-prevention#add-and-update-the-learn-more-and-admin-contact-email-links\" target=\"_blank\">admin contact details</a> helps users get familiar with Copilot Studio and know where to go for support.</li>\n</ul>\n<p>More details will be available on <b><a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/copilot-studio-experience\" target=\"_blank\">Microsoft Learn</a></b> starting the week of <b>October 20, 2025</b>.</p>\n\n<b><b>Compliance considerations</b></b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Users can now copy agents from the lite Copilot Studio into the full experience, gaining advanced authoring, publishing, lifecycle, and governance features. Rollout starts November 2025. Admins should prepare by managing environments, licensing, security policies, and governance via the Power Platform admin center."
    }
  ],
  "EndDateTime": "2025-12-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1176363",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-20T23:44:19.817Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-20T23:44:14Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot Studio: Copy an agent from the lite experience into the full experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
