{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to use the Lead Manager and Customer Brief templates in Microsoft Copilot Studio. This feature will reach general availability on August 1, 2025.<br><br><b>How does this affect me?</b><br>These two new agent templates help accelerate customer adoption of autonomous agents by providing ready-made agents that connect to your existing line of business apps.<br><br>The <b>Lead Manager template</b> focuses on top-of-funnel sales development by managing incoming leads, offering functionalities like duplicate handling and automated email responses. It integrates with Salesforce and Outlook while allowing customization such as setting employee count thresholds for meeting scheduling.<br><br>The <b>Customer Brief template</b> streamlines meeting preparation by generating executive summaries from Salesforce data and automating email workflows.<br><br>Both agents are installed via Microsoft Copilot Studio \"Managed Agents.\" The templates can be edited before being published and customized for your business processes.<br><br><b>What action do I need to take?</b><br>This message is for awareness and no action is required.<br><br>If you would like more information about this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/ADO11235\">Use the Lead Manager and Customer Brief templates</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-08-02T17:39:26Z",
  "HasAttachments": false,
  "Id": "MC1108001",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-02T17:39:56.047Z",
  "Services": [
    "Power Platform"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-02T17:39:26Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Copilot Studio - Use the Lead Manager and Customer Brief templates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
