{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting September 1, 2025, Microsoft 365 Copilot will introduce Enhanced Personalization for Copilot-licensed enterprise users through a new feature called communication memory. This AI-powered capability improves the relevance and quality of Copilot responses by summarizing and learning from previous communications the user has access to. Communication memory is private to each user and designed to enhance productivity across Microsoft 365 apps.</p><div>\n\n<p><b>When this will happen</b></p>\n<ul><li><b>General Availability (Worldwide):</b> Rollout begins early September 2025 and is expected to complete by late October 2025.</li></ul>\n\n<p><b>How this affects your organization</b></p>\n<p>Communication memory uses AI to analyze and summarize digital communications—such as emails, chats, and meeting transcripts—to build a live memory of key highlights. This enables Copilot to deliver more personalized and context-aware responses across Microsoft 365 apps.</p>\n<p>Unlike existing personalization features that operate within a single app (e.g., Outlook, Teams Recap, or Facilitator), communication memory provides a unified view across communication channels. Summaries are generated by large language models (LLMs) and may occasionally be inaccurate; each memory includes source links for user review.</p>\n<p>This feature is <b>on by default</b> for Copilot-licensed users.</p>\n\n\n<p><b>What you can do to prepare</b></p>\n<p>Admins can manage communication memory through the <b>Enhanced Personalization admin control</b>, available via <b>Microsoft Graph</b>. Disabling Enhanced Personalization will turn off all Copilot memory and personalization features across your organization.</p>\n\n<p><b>Compliance considerations</b></p>\n<table>\n<tbody><tr>\n<td>Does the change store new customer data, if so, where, and is the data cached or permanently stored?</td>\n<td>Communication memory stores AI-generated summaries based on user-accessible communications (e.g., emails, chats, meetings). These summaries are stored securely and privately per user.</td>\n</tr>\n<tr>\n<td>Does the change alter how existing customer data is processed, stored, or accessed (e.g. documents, emails, chats, etc.), if so how and to what extent?</td>\n<td>Existing communications are processed by large language models (LLMs) to generate summaries that improve Copilot personalization.</td>\n</tr>\n<tr>\n<td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data, if so summarize changes?</td>\n<td>Introduces new AI summarization across communication channels using LLMs, expanding personalization beyond single-app contexts.</td>\n</tr>\n<tr>\n<td>Does the change provide end users any new way of interacting with generative AI, if so how?</td>\n<td>Users receive personalized Copilot responses based on communication memory, representing a new interaction model with generative AI.</td>\n</tr>\n<tr>\n<td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td>\n<td>Admins can disable Enhanced Personalization (and all Copilot memory features) via Microsoft Graph. Control via Entra ID group membership is supported.</td>\n</tr>\n<tr>\n<td>Does the change allow a user to enable and disable the feature themselves?</td>\n<td>Users can view and manage their communication memory, including reviewing linked sources for accuracy.</td>\n</tr>\n</tbody></table>\n</div>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting September 2025, Microsoft 365 Copilot will use AI-powered communication memory to enhance personalization by summarizing users' accessible emails, chats, and meetings. This private feature improves context-aware responses across apps, is enabled by default, and can be managed by admins via Microsoft Graph and Entra ID."
    }
  ],
  "EndDateTime": "2025-11-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1127234",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-01T23:23:51.683Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-01T23:23:29Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Enhanced Personalization via Communication Memory in Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
