{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Copilot is making it easier to manage scheduling conflicts by automatically rescheduling 1:1 meetings and personal events. Within the meeting event form, users can indicate which events are more flexible and allow Copilot to reschedule them if conflicts arise. Users can also set preferences for when rescheduled events should occur. Copilot will detect double-bookings and automatically move these flexible events to a better time—saving users time and reducing manual coordination.</p><p>A Microsoft Copilot license is required to utilize this functionality.</p><p>\n</p><p><b>When this will happen:</b></p><p>Targeted Release: Rollout begins mid-November 2025 and expected to complete by late November 2025.</p><p><b>How this affects your organization:</b></p><p>Copilot users will gain the ability to automatically resolve scheduling conflicts for 1:1 meetings and personal events. This feature is especially useful for users with recurring 1:1 series that do not need to occur at a specific time each week, helping automatically reschedule those meetings if a conflict arises. The feature is available for Copilot-licensed users and can be enabled through the meeting form.\n</p><p></p><p><i>Main form with new toggle control for automatic rescheduling:</i></p><p></p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5a4b6b80-b2cc-4d6b-90d1-471d9018bd24 \" width=\"400\" height=\"\"><br><p><br></p><p><i>Users can specify their rescheduling preferences (if not set, Copilot will pick intelligent defaults):</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/664b3dcd-b70d-4d7b-ba06-bf1e68b85527 \" width=\"400\" height=\"\"></p><p>This post will be updated with a link to the support article once published.</p><p><b>What you can do to prepare:</b></p><p>No admin action is required. However, you may want to:\n</p><ul><li>Inform users about this new capability and how to set their rescheduling preferences in the meeting form.\n</li><li>Review any internal guidance on calendar management or Copilot usage to ensure alignment.</li></ul><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tYes – Calendar data is used to identify and reschedule events.</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?\tYes – Copilot uses AI to analyze and reschedule events.\n</li><li>Does the change provide end users any new way of interacting with generative AI?\tYes – Users interact with Copilot to manage scheduling.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Copilot can now automatically reschedule flexible 1:1 meetings and personal events based on user preferences to resolve scheduling conflicts. This feature, requiring a Copilot license, will roll out from mid to late November 2025 and helps save time by reducing manual rescheduling."
    }
  ],
  "EndDateTime": "2026-02-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1184999",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-12T00:12:16.443Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-12T00:12:03Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Copilot can now automatically reschedule 1:1 meetings and personal events based on your preferences",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
