{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Clipchamp is a simple and robust video editor that enables users to combine video, images, and audio files, with text and effects to create videos worthy of sharing.<br></p><p>Clipchamp can be accessed via the Clipchamp for Windows application or on desktop computers using Microsoft Edge or Google Chrome browsers. It allows for editing and creating videos in OneDrive or SharePoint.</p><p>\n</p><p>You are receiving this message because Office 365 license holders will gain access to Microsoft Clipchamp capabilities. This update will not impact any other parts of your Office 365 license or Microsoft 365 admin center.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Available beginning late August 2024.</p><p><b>How this will affect your organization:</b><br></p><p>Users with corresponding licenses will gain access to Clipchamp. \n</p><p>A new app or service plan, Microsoft Clipchamp, will begin to appear as activated for these license holders in the Microsoft 365 Admin Console.</p><p><b>What users will see</b>\n</p><p>Clipchamp will be available from the following locations:\n</p><ul><li>New Clipchamp Video and Edit in Clipchamp menu in OneDrive and SharePoint document libraries\n</li><li>Clipchamp for Windows application\n</li><li>Microsoft365.com/launch/clipchamp start page\n</li></ul><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/371f9c35-418b-4155-a440-29e2334ad735\" style=\"width: 400px;\"><br></p><p>Help articles can be found at Clipchamp help and learning (microsoft.com). All articles pertaining to the \"for work\" version will be updated to also apply for education.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>When this change takes effect, please make note of the new service plan names for your administrative records and ensure that you update any relevant provisioning documentation, as needed.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Clipchamp, a video editing tool, is launching for Office 365 E3 and E5 subscriptions. It will be accessible via its Windows app or on desktops through Edge or Chrome browsers. Users can edit videos in OneDrive or SharePoint, and it will appear activated in the Microsoft 365 Admin Console. General availability begins late August 2024. No other parts of Office 365 licenses will be affected."
    },
    {
      "Name": "HelpLink",
      "Value": "https://support.microsoft.com/clipchamp"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC823281",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-19T21:28:05.053Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-19T21:27:38Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Clipchamp is launching for Office 365 E3 and E5 commercial subscriptions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
