{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<div>The August 2024 non-security preview update is now available for Windows 11, versions 23H2 and 22H2. The non-security preview update for Windows 10, version 22H2 will be available soon. Information about the contents of this update is available from the release notes, which are accessible from the <a href=\"https://support.microsoft.com/help/5041587\" rel=\"noopener noreferrer\" target=\"_blank\">Windows 11</a> update history page. To learn more about the different types of monthly quality updates, see <a href=\"https://aka.ms/Windows/MonthlyUpdates\" rel=\"noopener noreferrer\" target=\"_blank\">Windows monthly updates explained</a>. To be informed about the latest updates and releases, follow us on X <a href=\"https://x.com/windowsupdate\" rel=\"noopener noreferrer\" target=\"_blank\">@WindowsUpdate</a>.</div><div><br></div><div><b>Highlights for the Windows 11, versions 23H2 and 22H2 update:&nbsp;</b></div><ul><li>You can now share content to your Android device from the Windows Share window. To do this, you must pair your Android device to your Windows PC. Use the Link to Windows app on your Android device and Phone Link on your PC.​​​​​​​</li><li>​​​​​​​This update makes scan mode respond quicker in Narrator. This is especially helpful when you use Microsoft Edge and read large documents. To use scan mode, you must turn on Narrator first (Windows logo key + Ctrl + Enter). Then, turn on scan mode by pressing Caps lock + Spacebar during a Narrator session.</li><li>This update improves Voice access. You can now dictate the characters that you spell at a faster speed. You also have more editing options for the commands that select, delete, and move within text.</li><li>This update improves Widgets Board security and APIs for creating widgets and feeds for users in EEA regions.&nbsp;</li></ul><div><br></div><div><b>For instructions on how to install this update, see the KB for your OS listed below:&nbsp;</b></div><ul><li>Windows 11, version 23H2 and 22H2: <a href=\"https://support.microsoft.com/help/5041587\" rel=\"noopener noreferrer\" target=\"_blank\">KB5041587</a></li></ul><div><br></div><div><b>REMINDER</b>&nbsp;The October 2024 security update is the last security release for&nbsp;<a href=\"https://learn.microsoft.com/lifecycle/products/windows-11-enterprise-and-education\" rel=\"noopener noreferrer\" target=\"_blank\">Enterprise and Education editions</a> of&nbsp;Windows 11, version 21H2 and <a href=\"https://learn.microsoft.com/lifecycle/products/windows-11-home-and-pro\" rel=\"noopener noreferrer\" target=\"_blank\">Home and Pro editions</a> of&nbsp;Windows 11, version 22H2. After this date, devices running these editions will no longer receive monthly security and preview updates containing protections from the latest security threats. Supported editions of Windows 11, versions 23H2 and 22H2 will continue to have support through their specific lifecycle dates, which can be found at the&nbsp;<a href=\"https://learn.microsoft.com/windows/release-health/windows11-release-information\" rel=\"noopener noreferrer\" target=\"_blank\">Windows 11 release information page</a>.</div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-08-27T17:04:19.477Z",
  "HasAttachments": false,
  "Id": "MC874713",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-27T17:04:20.453Z",
  "Services": [
    "Windows"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-27T17:04:19.523Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "The August 2024 Windows non-security preview update is now available for Windows 11, versions 23H2 and 22H2",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
