{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<div>If you manage Windows updates for your enterprise, you can do so with a single solution, Windows Autopatch. The functionality formerly known as Windows Update for Business deployment service has been woven into Windows Autopatch. A new, unified dashboard in the Microsoft Intune admin center now has four main sections: update policies, update groups, update status, and update reports. Your current license rights and functionalities under either Windows Autopatch or Windows Update for Business deployment service will remain the same. Learn more at <a href=\"https://techcommunity.microsoft.com/t5/windows-it-pro-blog/consolidating-update-management-for-enterprises/ba-p/4246896\" rel=\"noopener noreferrer\" target=\"_blank\">Consolidating update management for enterprises</a>.</div><div>&nbsp;</div><div><b>When will this happen:</b>&nbsp;</div><div>The unified solution and new experience are already available to you.&nbsp;</div><div>&nbsp;</div><div><b>How this will affect your organization:</b>&nbsp;</div><div>Whether you’ve been using Windows Autopatch or Windows Update for Business deployment service, your update management experience is becoming simpler and more streamlined. Windows Update for Business deployment service is now fully integrated into Windows Autopatch. This experience includes a new, unified dashboard in the Intune admin center to manage update policies and device groups, monitor update status, and generate reports.&nbsp;&nbsp;</div><div>&nbsp;</div><div><b>What you need to do to prepare:</b>&nbsp;</div><div>If you’ve already been using Windows Autopatch or Windows Update for Business deployment service, your license rights and functionalities will remain the same. If you’d like to consider this update management solution for your enterprise, see Additional information below.&nbsp;</div><div>&nbsp;</div><div><b>Additional information:</b>&nbsp;</div><ul><li>Read the official announcement at <a href=\"https://techcommunity.microsoft.com/t5/windows-it-pro-blog/consolidating-update-management-for-enterprises/ba-p/4246896\" rel=\"noopener noreferrer\" target=\"_blank\">Consolidating update management for enterprises</a>.&nbsp;</li><li>Learn more about the unified solution at <a href=\"https://learn.microsoft.com/windows/deployment/windows-autopatch/overview/windows-autopatch-overview?tabs=business-premium-a3-communications\" rel=\"noopener noreferrer\" target=\"_blank\">What is Windows Autopatch?</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-09-23T17:00:04.183Z",
  "HasAttachments": false,
  "Id": "MC896361",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-23T17:00:05.263Z",
  "Services": [
    "Windows"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-23T17:00:04.217Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Unified: Windows Autopatch and Windows Update for Business deployment service",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
