{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 8, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>The <i>Universal Print anywhere</i> feature offers customers Pull Print queue functionality through Microsoft Universal Print. This feature allows admins to configure one or more virtual printer queues and map any number of registered printers in Universal Print to these virtual printer queues. The goal is to simplify the end-user's experience as the user only needs to know the one printer for their region/location and can walk up to any physical printer near them to securely release their print jobs.</p><p><i>Universal Print anywhere</i> is initially paired with the <a href=\"https://learn.microsoft.com/universal-print/fundamentals/universal-print-qrcode\" target=\"_blank\">Secure release with QR code</a> functionality. Additional secure release options will be made available in the future.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=395937\" target=\"_blank\">395937</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late November 2024 (previously early October) and expect to complete by late December 2024 (previously late October).<br></p><p>General Availability (Worldwide, GCC High, GCC): We plan to begin rolling out late June 2025 (previously late May) and expect to complete by early July 2025 (previously late July).</p><p><b>How this will affect your organization:</b>\n</p><p>This is a new feature, and we do not expect any impact on your existing use of Universal Print.</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins should set aside some test printers that are configured with <a href=\"https://learn.microsoft.com/universal-print/fundamentals/universal-print-qrcode\" target=\"_blank\">Secure release with QR code</a>. Additionally, admins should make sure the mobile Microsoft 365 app is installed on their mobile devices through the mobile device's application store/marketplace and the appropriate organization user account is configured in the Microsoft 365 app.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395937"
    },
    {
      "Name": "Summary",
      "Value": "Universal Print's Pull Print queues feature allows admins to configure virtual printer queues and map registered printers to them. The feature simplifies the user experience by enabling secure print job release at any nearby printer. Public Preview starts in late November 2024, and General Availability begins in late June 2025. No impact on existing use is expected. Admins should prepare test printers and ensure the Microsoft 365 mobile app is installed and configured."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC896708",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-08T18:43:58.32Z",
  "Services": [
    "Universal Print"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-24T00:14:04Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Universal Print: Pull Print queues",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
