{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<div><a href=\"https://aka.ms/how-to-get-24H2\" rel=\"noopener noreferrer\" target=\"_blank\">Windows 11, version 24H2</a> - also referred to as the Windows 11 2024 Update – has reached general availability. Today we also <a href=\"https://aka.ms/W11/NewExperiences\" rel=\"noopener noreferrer\" target=\"_blank\">announce new Copilot+ PC innovations</a> that enable more natural and conversational engagement with your devices.&nbsp;</div><div>&nbsp;</div><div>The Windows 11 2024 Update contains new features, including enhanced battery saver, Bluetooth LE Audio, HDR background support, and support for Wi-Fi 7. Learn more in <a href=\"https://support.microsoft.com/windows/inside-this-update-93c5c27c-f96e-43c2-a08e-5812d92f220d\" rel=\"noopener noreferrer\" target=\"_blank\">What’s new inside this update</a>.&nbsp;&nbsp;</div><div>&nbsp;</div><div>We recommend that you begin a targeted deployment to validate that your apps, devices, and infrastructure work as expected with the new release. For details on the overall rollout strategy for this release, see <a href=\"https://aka.ms/how-to-get-24H2\" rel=\"noopener noreferrer\" target=\"_blank\">How to get new experiences for Windows 11</a>. For insight into the experience for people running the Home and Pro editions on devices not managed by an organization, see <a href=\"https://aka.ms/video/W11/how-to-get-24H2\" rel=\"noopener noreferrer\" target=\"_blank\">How to get the Windows 11 2024 Update</a>.&nbsp;</div><div>&nbsp;</div><div><b>When will this happen:&nbsp;&nbsp;</b>&nbsp;</div><div>For commercial organizations, availability of Windows 11, version 24H2 begins today through familiar channels, such as Windows Server Update Services (WSUS), Windows Update for Business, and the Microsoft 365 admin center. It is also available for Windows 365 and Azure Virtual Desktop.&nbsp;</div><div>&nbsp;</div><div><b>How this will affect your organization:&nbsp;&nbsp;</b>&nbsp;</div><div>Today, October 1, 2024, marks the start of 36 months of servicing support lifecycle for Enterprise and Education editions of Windows 11, version 24H2.&nbsp;&nbsp;</div><div>&nbsp;</div><div>You can prepare for and deploy Windows 11, version 24H2 using the same processes, policies, and management solutions you use for the original release of Windows 11 or Windows 10. Popular tools, such as the security baseline, administrative templates (ADMX), and the Group Policy settings reference have been updated for version 24H2. For information on features and improvements for commercial organizations, and links to the latest deployment tools and onboarding kits, see <a href=\"https://aka.ms/new-in-24H2\" rel=\"noopener noreferrer\" target=\"_blank\">What’s new for IT pros in Windows 11, version 24H2</a>.&nbsp;</div><div>&nbsp;</div><div><b>What you need to do to prepare:&nbsp;&nbsp;</b>&nbsp;</div><div>You can use <a href=\"https://learn.microsoft.com/windows/deployment/update/waas-manage-updates-wufb\" rel=\"noopener noreferrer\" target=\"_blank\">Windows Update for Business</a>, <a href=\"https://learn.microsoft.com/mem/intune/protect/windows-10-feature-updates\" rel=\"noopener noreferrer\" target=\"_blank\">Microsoft Intune</a>, or your preferred endpoint management solution to deploy Windows 11, version 24H2. This update is a full operating system (OS) swap that contains new foundational elements required to deliver transformational AI experiences and exceptional performance. Endpoints managed by Windows Update for Business will not be automatically updated to Windows 11, version 24H2 unless you explicitly set it up. To do this, configure a <b>Target Version</b> via the <b>TargetReleaseVersion</b> setting using a Windows CSP, a feature update profile in Microsoft Intune, or the <b>Select the target Feature Update</b> <b>version</b> setting in Group Policy.&nbsp;</div><div><br></div><div><b>Additional information:</b>&nbsp;</div><div>A list of currently supported Windows versions by servicing option – along with release dates, build numbers, end of service dates, and release history – is available on the <a href=\"https://learn.microsoft.com/windows/release-health/windows11-release-information\" rel=\"noopener noreferrer\" target=\"_blank\">Windows 11 release information</a> page. Windows 11, version 24H2 known issues (and resolutions) have been added to the <a href=\"https://admin.microsoft.com/Adminportal/Home?#/windowsreleasehealth\" rel=\"noopener noreferrer\" target=\"_blank\">Windows release health</a> section of the Microsoft 365 admin center.&nbsp;</div><div>&nbsp;</div><div>If you need help with deployment, or are looking for tips and best practices, join <a href=\"https://aka.ms/windows/officehours\" rel=\"noopener noreferrer\" target=\"_blank\">Windows Office Hours</a> every third Thursday on the Windows Tech Community. This monthly chat-based Q&amp;A on the Tech Community is supported by the Windows, Intune, and Windows 365 product teams.&nbsp;</div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-10-11T13:41:44.857Z",
  "HasAttachments": false,
  "Id": "MC902431",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-11T13:41:50.697Z",
  "Services": [
    "Windows"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-11T13:41:46.293Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "How to get new experiences for Windows 11",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
