{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 30, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Starting in mid-March 2025, Microsoft Copilot in Edge will introduce support for page summarization and contextual queries to the <i>Work </i>tab for Microsoft 365 Copilot Business Chat. With this feature, users can ask Copilot contextual queries such as “summarize this page.” This feature will also include contextual prompt suggestions to help users ask relevant questions about open pages in Edge. Page summarization and contextual prompt suggestions will be accessible for users when using Copilot through the Edge side pane.</p><p>A Microsoft 365 Copilot license is required to use this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468884\" target=\"_blank\">468884</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 (previously mid-February 2025) and expect to complete by early July 2025 (previously late May).</p><p><b>How this will affect your organization:</b></p><p>After this rollout, Copilot may have access to a user’s page context when a user sends contextual prompts to Copilot in Edge in the side pane when a webpage or PDF is open.\n</p><p>The page summarization feature will be available by default when it rolls out in March. It can also be configured by admins.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>The existing <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-policies#edgeentracopilotpagecontext\" target=\"_blank\">EdgeEntraCopilotPageContext</a> policy is available now for you to manage whether your users have access to page context while using Copilot in Edge across Copilot Business Chat and Microsoft Copilot with enterprise data protection. Before this rollout, the policy only applied to the <i>Web</i> tab of Business Chat and to Copilot with enterprise data protection. After this rollout, the <i>EdgeEntraCopilotPageContext</i> policy will include the <i>Work</i> tab of Business Chat. If the policy is not configured, users can enable or disable Copilot’s access to page context in their Copilot settings.\n</p><p>If you prefer to disable Copilot Chat for your tenant, review these <a href=\"https://learn.microsoft.com/copilot/manage#removing-access-to-microsoft-3Ao7TYx1ZnYigZNzo96NU9vudwEAyvH6G3g%3D&amp;reserved=0\" target=\"_blank\">instructions</a> in Manage Copilot | Microsoft Learn.\n</p><p>This rollout will happen automatically by the specified date. Review your current configuration to determine the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li>The section called <a href=\"https://learn.microsoft.com/copilot/overview#whats-the-difference-between-microsoft--and-microsoft-365-\" target=\"_blank\">What’s the difference between Microsoft Copilot and Microsoft 365 Copilot?</a> in Overview of Copilot | Microsoft Learn\n</li><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/enterprise-data-protection\" target=\"_blank\">Enterprise data protection in Microsoft 365 Copilot and Microsoft Copilot | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468884"
    },
    {
      "Name": "Summary",
      "Value": "Starting mid-March 2025, Microsoft Copilot in Edge will support page summarization and contextual queries in the \"Work\" tab of Microsoft 365 Copilot Business Chat. This feature requires a Microsoft 365 Copilot license and can be managed through the EdgeEntraCopilotPageContext policy. The rollout will complete by early July 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC966641",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-30T15:16:09.84Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-27T01:53:03Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot in Edge: New contextual features like page summary on Microsoft 365 Copilot Business Chat \"Work\" tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
