{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 2, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Coming soon for Microsoft 365 Copilot: When writing Copilot prompts in the chat box, users will be able to use CIQ to select Microsoft SharePoint and Microsoft OneDrive folders using the existing <i>Attach cloud files</i> icon.</p><p><a href=\"https://support.microsoft.com/topic/using-context-iq-to-refer-to-specific-files-people-and-more-in-microsoft-365-copilot-272ac2c1-c5f7-49c9-8a42-2a8a87846fa0\" target=\"_blank\">Context IQ (CIQ)</a> is a set of AI capabilities from Microsoft that allows users to search for, select, and insert relevant enterprise or personal data directly into their prompts or conversations. This capability helps users to “ground” or anchor their prompts in specific, contextually relevant data, making responses more accurate, specific, and useful.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413109\" target=\"_blank\">413109</a>.\n</p><p>A Microsoft 365 Copilot license is required to use this feature. \n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late July 2025 (previously late June) and expect to complete by late August 2025 (previously late July).</p><p><b>How this will affect your organization:</b>\n</p><p>No impact to tenant admins. This change is available by default. Users will be able to attach a OneDrive folder or a SharePoint folder to their prompt, similar to how they can select files to attach before the rollout. Users can only select folders that they own or that are shared to the user.\n</p><p>To add OneDrive or SharePoint folders to add to their Copilot prompt, users can select the <i>Attach cloud files</i> icon in the Copilot chat box:</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7f2274c2-8455-469c-b1cd-12db01dbfd46\" style=\"width: 400px;\" alt=\"user controls\"></p><p>From the new window, users can select the desired folders to add to their Copilot prompt:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/45e17155-3a42-4e77-8c25-455325d33981\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/using-context-iq-to-refer-to-specific-files-people-and-more-in-microsoft-365-copilot-272ac2c1-c5f7-49c9-8a42-2a8a87846fa0\" target=\"_blank\">Using Context IQ to refer to specific files, people, and more in Microsoft 365 Copilot - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413109"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will soon allow users to select SharePoint and OneDrive folders when writing prompts using the \"Attach cloud files\" icon. This feature will roll out from late July to late August 2025. No admin action is required, but users should be informed. A Copilot license is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC973504",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-04T19:34:47.523Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-07T00:18:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot: Select Microsoft SharePoint and Microsoft OneDrive folders when writing prompts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
