{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 29, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>We are thrilled to announce the upcoming rollout of custom engine agents in Microsoft 365 Copilot. These agents are specialized agentic solutions that can be built on any large language model (LLM), toolchain, or orchestration tool tailored for specific domain or tenant workflows. This feature is already supported in Microsoft Teams and will be available after this rollout in Microsoft 365 Copilot Business Chat (BizChat).</p><p>To access custom engine agents, your organization will need a Microsoft 365 Copilot license.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=474439\" target=\"_blank\">474439</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview:  We will begin rolling out early February 2025 and expect to complete in mid-March 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out in late June 2025 (previously late May) and expect to complete by early July 2025 (previously early June).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Custom engine agents will empower your organization to create highly customized agentic experiences that leverage your own AI systems and orchestrators. This means you can design unique prompts, connect to any LLM, and integrate these custom agents with Microsoft 365 Copilot.\n</p><p>After this rollout, all users or specific users will be able to access the agents, provided the agents have been enabled and deployed in the Microsoft 365 admin center &gt; <i>Copilot </i>tab.\n</p><p><i>Creating custom engine agents</i>\n</p><p>Eligible users, or those designated by you, will have the capability to create agents using Microsoft Copilot Studio for low-code tools or the Microsoft Teams Toolkit in Microsoft Visual Studio for pro-code solutions. Users can access Copilot Studio only if you have enabled the Microsoft Power Automate free license for them.\n</p><p>Developers can also use the Teams Toolkit in Visual Studio and the <a href=\"https://learn.microsoft.com/microsoftteams/platform/bots/how-to/teams-conversational-ai/teams-conversation-ai-overview?tabs=javascript%2Cjavascript1\" target=\"_blank\">Teams AI Library</a> for pro-code solutions to build these agents from scratch.\n</p><p><i>Deploying custom engine agents</i>\n</p><p>All the familiar admin deployment and management controls in the Microsoft 365 admin center for declarative agents will seamlessly transition to custom engine agents:\n</p><p>Admin controls in the Microsoft 365 admin center for a published custom engine agent:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/521cf24f-4ca0-4c49-96dc-6af0ec60d768\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Custom engine agents created using Copilot Studio can be deployed by users for their individual work-related tasks. Also, users have the flexibility to share these agents with internal teams, contingent on the settings you configure in the Microsoft 365 admin center &gt; <i>Teams applications &gt; Shared Copilot applications.</i> Organization-wide sharing requires admin approval through the Microsoft 365 admin center.\n</p><p>Custom engine agents created or updated using the Teams Toolkit in Visual Studio and the Teams AI Library requires admin approval and admin deployment in the Microsoft 365 admin center.\n</p><p>Provisioning a customer engine agent in the Microsoft 365 admin center &gt; <i>Integrated apps:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/861b011d-45e4-4c21-9e1c-58804f8df787\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-copilot-studio/publication-add-bot-to-microsoft-teams\" target=\"_blank\">Connect and configure an agent for Microsoft Teams - Microsoft Copilot Studio</a> | Microsoft Learn (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/overview-custom-engine-agent\" target=\"_blank\">Custom engine agents for Microsoft 365 | Microsoft Learn</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/en-us/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Manage Copilot agents in Integrated Apps - Microsoft 365 admin | Microsoft Learn</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/en-us/microsoft-copilot-studio/admin-share-bots?tabs=web\" target=\"_blank\">Share agents with other users - Microsoft Copilot Studio | Microsoft Learn</a> (will be updated before rollout)</li></ul><p>Custom engine agents using Microsoft Copilot Studio\n</p><p>We are excited to announce that you can now create a Custom engine agents using Microsoft Copilot Studio. This enables you to use your own foundational model to respond to prompts without requiring any extensive coding knowledge. Eligible Users or users designated by you can deploy agents personally or share them with internal teams, depending on 'Shared Copilot' settings within the Admin Centre. Organization-wide sharing requires admin approval through the admin centre.\n</p><p>To get started please refer to the following \n</p><p>Key concepts - Authoring agents -<a href=\"https://learn.microsoft.com/microsoft-copilot-studio/authoring-fundamentals\" target=\"_blank\"> Microsoft Copilot Studio | Microsoft Learn</a>\n</p><p>Connect and configure an agent for <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/publication-add-bot-to-microsoft-teams\" target=\"_blank\">Teams and Microsoft 365 Copilot - Microsoft Copilot Studio | Microsoft Learn</a>\n</p><p>Stay tuned for an update on when you can start creating Custom engine agents using Teams Toolkit in Visual Studio and the Teams AI Library.</p><p>\n</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "474439"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will soon support custom engine agents, allowing organizations to create specialized agents using any large language model or toolchain. The rollout begins in February 2025 for public preview and will be generally available by July 2025. Admins can deploy and manage these agents via the Microsoft 365 admin center."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC985480",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-29T15:03:33.627Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-22T02:01:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: New custom engine agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
