{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 5, 2025:&nbsp; After further review we have decided not to proceed with this change at this time. We apologize for any inconvenience.</p><p>Coming soon to Microsoft Teams: When in a meeting that is being recorded and has content shared onscreen, Microsoft Copilot will be able to answer questions based on the shared onscreen content. Before this rollout, Copilot was only able to answer questions based on the transcript and meeting chat, and this capability will continue after the rollout. This message applies to Teams on VDI, Teams on Windows desktop, Teams on Mac desktop, Teams on the web, and Teams for iOS/Android. A Microsoft 365 Copilot license is required to use this feature.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=32587\" target=\"_blank\">325873</a>.\n</p><p><b>When this will happen:</b></p><p>Targeted Release: We will communicate via Message center when we are ready to proceed.</p><p>General Availability (Worldwide): We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users will be able to ask Copilot questions about screenshare data, but only if a meeting is recorded <i>and </i>transcribed. If the meeting is only transcribed, users can still use Copilot, just without screenshare data.\n</p><p>Copilot will be able to understand slides, documents, spreadsheets, and websites, or anything else shared onscreen. Users will be able to ask simple recall questions, such as “Show me the content that was shared on the screen” or more specific questions like “what was the Sales target number” if it was shared on a previous slide. Users will also be able to combine screenshare with transcript and chat data to ask, “Show me all the slides and the feedback on each slide,” or “Rewrite the paragraph based on the comments from the audience.”\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/85618e42-22f6-4361-b92d-df2744b46fe3\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Copilot can only answer questions about content shared onscreen if the meeting is recorded and transcribed, and if the specific slide, document, spreadsheet, and website is shared for longer than 10 seconds. This will alleviate potential accidental shares being used by Copilot. For example, if a user accidentally shares the wrong content and changes it within 10 seconds, Copilot will not have access to it. However, when the meeting is recorded, the recording will still have this information. Deleting a recording will also delete all associated screen data along with it, so Copilot will no longer have access to screen data if the meeting recording was deleted.\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-copilot-in-microsoft-teams-meetings-0bf9dd3c-96f7-44e2-8bb8-790bedf066b1\" target=\"_blank\">Use Copilot in Microsoft Teams meetings - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "325873"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft has decided not to proceed with enabling Microsoft Copilot to analyze shared onscreen content in recorded and transcribed Teams meetings at this time. Previously, Copilot could only use transcripts and chat. The feature required no admin action and applied across multiple Teams platforms."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC998512",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-05T13:55:59.097Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-06T01:01:38Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Microsoft Copilot can analyze content shared onscreen in a meeting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
