[
  {
    "Id": "ROADMAP_498356",
    "Title": "Microsoft 365: SMTP onboarding to App Role Based Access Control",
    "Description": "We're simplifying how organizations grant applications permission to send email on behalf of mailboxes. Today, customers must manually assign permissions to each individual mailbox using PowerShell, which is time-consuming and inefficient. With this new capability, admins can assign the SMTP.SendAsApp role to an app through App Role-Based Access Control (RBAC), enabling group-based or scoped access to mailboxes.",
    "Link": "https://www.microsoft.com/microsoft-365/roadmap?id=498356",
    "PubDate": "2025-07-10T23:00:59Z",
    "Categories": ["In development", "General Availability", "Exchange", "Microsoft 365"],
    "Services": ["Exchange Online"],
    "Type": "roadmap"
  },
  {
    "Id": "ROADMAP_498323",
    "Title": "Microsoft Viva: Unread News Notifications in Connections",
    "Description": "Users will receive a weekly notification in the Connections apps in Microsoft Teams on mobile and desktop linking them to relevant SharePoint news that they might have missed in the preceding week. This unread news will be available in the \"News\" tab in the Connections app under the \"unread\" pill.",
    "Link": "https://www.microsoft.com/microsoft-365/roadmap?id=498323",
    "PubDate": "2025-07-10T23:00:59Z",
    "Categories": ["In development", "General Availability", "Microsoft Viva"],
    "Services": ["Microsoft Viva"],
    "Type": "roadmap"
  },
  {
    "Id": "ROADMAP_498319",
    "Title": "Immersive Search",
    "Description": "After completing a search in Outlook, a user will see a Copilot entry point that will take them to an LLM generated summary of their search query (emails, Teams messages and documents) within their Copilot side pane. They will be able to interact further with Copilot to dig deeper into these results and take action items accordingly.",
    "Link": "https://www.microsoft.com/microsoft-365/roadmap?id=498319",
    "PubDate": "2025-07-10T23:00:59Z",
    "Categories": ["In development", "General Availability", "Outlook"],
    "Services": ["Outlook"],
    "Type": "roadmap"
  },
  {
    "Id": "ROADMAP_414513",
    "Title": "Microsoft Teams: Network Strength icon to understand strength of your network",
    "Description": "Quickly understand strength of your network along with suggestions to conserve bandwidth if you are experiencing networking issues.",
    "Link": "https://www.microsoft.com/microsoft-365/roadmap?id=414513",
    "PubDate": "2024-09-10T23:15:45Z",
    "Categories": ["In development", "General Availability", "Microsoft Teams"],
    "Services": ["Microsoft Teams"],
    "Type": "roadmap"
  }
]
